[
  "u Do not use blower or infotainment system in engine oƯ mode. Ensure door, hood and tail gate are properly locked. Shift to P before switching oƯ ignition. Please do not use Accelerator & Brake pedal simultaneously. Prohibited to drive the vehicle in ﬂood / high water level conditions. u u u u Thank you for selecting JSW MG New Energy Vehicle! Your new energy vehicle is integrated with advanced technologies, safety, environmental protection and economy. This manual provides necessary information to help you drive your vehicle safely and eƯectively. The driver shall always note that improper operation of vehicle may cause the risk of accidents and injuries. To ensure optimal usage and maintenance of your MG, please thoroughly review this manual and save it securely once you have ﬁnished. Special Instructions: We advise using genuine spare parts and following this manual for proper vehicle use, maintenance, and repairs. Substituting or altering the vehicle with non-genuine spare parts can compromise overall performance, particularly safety and durability. Any vehicle damage or performance issues resulting from non-genuine spare parts are not covered under warranty. Furthermore, vehicle modiﬁcations may infringe government regulations. To enhance our service to you, please verify that your contact information is up to date. If there are any changes, please contact an authorized MG dealer to ensure our records are accurate. It is crucial to comply with national laws and local regulations and to promptly register your vehicle to prevent any potential registration issues. The descriptions marked with “*” in this manual apply speciﬁcally to certain models, and the images depict a single conﬁguration. In case of any diƯerences with your vehicle, the actual conﬁguration takes precedence.” Please take note of the “NOTE”, “CAUTION”, “DANGER” and “WARNING” symbols in this manual, and carefully follow the instructions to prevent injury or damage. The deﬁnitions of these symbols are as follows: NOTE Items that must be observed to facilitate maintenance, etc. WARNING ! Items that must be observed to avoid damage to the vehicle. DANGER Indicates risks of accidents or injuries. Ignoring such information may lead to injuries or property loss. ! CAUTION Indicates an operation that should be avoided or should not occur. FOREWORD This manual aims to assist you in correctly using the product and does not include details about its conﬁguration and software version. For information on these aspects, please refer to the product's brochure or consult the dealer from whom you purchased the product. MG operates a policy of constant product improvement and therefore reserves the right to change speciﬁcations without notice at any time. Whilst every eƯort is made o ensure complete accuracy of the information in this publication, no liabilities for inaccuracies or damage to property, or injury to persons, can be accepted by the manufacturer or JSW MG Authorised Repairer who supplied the publication, except in respect of personal injury caused by the negligence of the manufacturer or JSW MG Authorised Repairer. In case you require assistance or clariﬁcations please visit nearest dealer or",
  "contact us at 24 hours Helpline at 1800 100 6464 or email us at: pulsehub@mgmotor.co.in Copyright © JSW MG Motor India Ltd. All rights reserved. No part of this document may be reproduced or transmitted in any form or by any means without prior written consent of JSW MG Motor India. Know Your Electric Vehicle Safety Systems Starting Your EV Interior Features Storage Emergency & Breakdown Vehicle Maintenance 1 2 3 4 5 6 7 8 9 10 11 INDEX Know your Electric Vehicle Electric vehicle 1-1 l Overview 1-2 Know your electric vehicle 1-5 l Main components 1-6 l Safety of HV system 1-8 l Emergency situation 1-8 l Battery information 1-8 l Common terminologies 1-9 1 K n o w y o u r E l e c t r i c V e h i c l e 1 Overview This vehicle runs on a battery and uses electricity instead of gasoline like traditional cars. Please read this manual carefully before using the vehicle because it operates diƯerently. This vehicle is powered by electricity and has two batteries. One battery, located under the chassis, gives power to drive the vehicle. The other battery, a 12V car battery in the front compartment, powers instruments, lights, and control modules. 1. Charging the traction battery: The HV battery in the car needs to be charged using household electricity or approved DC - DC chargers. Make sure all wires, sockets, and plugs can handle the power. Have a professional electrician set up the charging system. It must be grounded correctly and have a main switch and safety device. 2. High-voltage cable warning: The orange cable in the car carries high voltage. Do not touch it. Pay close attention to warning signs on parts with high voltage. 3. Entering ready mode: When you open the door, the car switches to high-voltage mode. Step on the brake pedal to start driving. 4. Using high-voltage mode: Once the car is in high-voltage mode (doors open and car powered on), it mainly uses the HV battery. It can run lights and air conditioning for a long time. The HV battery also charges the 12V battery. 5. Winter driving tips: In winter, the HV battery's performance decreases when it's cold but improves as it warms up. To take care of the battery, avoid fast starts and driving fast for a long time in cold weather. Use the heater smartly, plan your trip well, and charge the car on time. 6. Vehicle data collection: The background server terminal equipment will retrieve vehicle data as speciﬁed in GB/T32960.3- 2016, including vehicle data, drive motor data, extreme value data, vehicle position data, alarm data, voltage data of rechargeable energy storage device, temperature data of rechargeable 1-1 ELECTRIC VEHICLE K n o w y o u r E l e c t r i c V e h i c l e 1 1-1 ELECTRIC VEHICLE energy storage device, and user- deﬁned data. If we ﬁnd any abnormal running data",
  "of your vehicle on the background server terminal equipment, our service personnel may contact you. At this time, we need your support and cooperation to eliminate possible hidden dangers in time 7. Safety during charging: It is forbidden to use false grounding equipment such as the grounding and resistance reduction module, which may cause potential safety hazards of electric shock during charging. K n o w y o u r E l e c t r i c V e h i c l e 1 Safety of HV system a. HV component safety: Avoid touching exposed or damaged orange HV cables. b. High-voltage system: Water contact The high-voltage system remains generally safe in the following scenarios: • Water in the footwell after a rainstorm with the sunroof open. • Vehicle partially submerged in water up to 300 mm. • Leakage of liquids in the trunk. In these situations, there is no risk of electric shock. However, there is a possibility of other damage to the vehicle. WARNING ! Each HV component has a warning label. Please pay attention to relevant warnings. To avoid electric shock, do not touch any EV components, HV cables & other connectors. Do not touch any exposed or damaged orange HV cables, otherwise you may be exposed to a risk of electric shock. Please read and follow these warnings carefully to avoid electric shock. Do not touch any HV components or cables. 1-2 MAIN COMPONENTS OF ELECTRIC VEHICLE a. Low voltage component: The LV equipment operates at 12V and includes things like instruments, audio systems, lights, horns, and blowers. Switch oƯ LV equipment when not in use to avoid 12V battery drain. ! NOTE Main components b. High voltage component: HV equipment includes the drive motor, motor controller, traction battery pack, charging system, A/C compressor, and heater. CAUTION After you receive the vehicle, make sure to fully charge the HV battery to 100% before it drops below 30% to keep it in good condition. K n o w y o u r E l e c t r i c V e h i c l e 1 c. Avoid modiﬁcations: Do not take disassemble or modify any electrical parts in the vehicle. Modifying them could lead to serious problems like short circuits, ﬁres, or burns. Improper execution of the work poses a risk of ﬁre and serious injury from electric shock caused by the high-voltage system. JSW MG MOTOR advises that modiﬁcations and maintenance on the vehicle should only be conducted by JSW MG authorised service center. The high-voltage system in your vehicle is self- contained, ensuring safety as long as no unauthorized work is done on high-voltage electrical parts or the chassis. Emergency situation a. Accident response: If there's an accident and you have time, turn oƯ the vehicle's power, set the parking brake, turn on hazard lights, place a warning triangle, and leave the vehicle. Contact the JSW MG authorised service centre right away. If there's no time, like if there's a",
  "ﬁre or strong burning smell, turn oƯ the vehicle and activate the parking brake to get out. b. Fire or smoke situation: Immediately turn oƯ the power supply and get oƯ the vehicle. If the ﬁre is intensive or develops rapidly, stay away from the vehicle immediately and call 101. If the ﬁre is not intensive, use a water- based ﬁre extinguisher to put out the ﬁre and keep a safe distance from the ﬁre source. Battery information a. Battery replacement and recycling: If you need to replace the HV battery, handle it carefully to avoid injury. According to Indian laws & regulations, recycle the HV battery at an MG-designated recycling station. Disposing of these batteries improperly can harm the environment and people. Check the oƯicial website for recycling details. b. Battery maintenance: When the instrument cluster's power bar turns red, it means the HV battery is low. Charge it promptly and avoid letting it completely run out before charging again. This helps keep the battery working well. It is recommended to fully charge the battery at least once every two weeks when using the vehicle regularly for maintenance. 1-3 MAIN COMPONENTS OF ELECTRIC VEHICLE K n o w y o u r E l e c t r i c V e h i c l e 1 DANGER Do not alter the charging port or equipment. Doing so could lead to charging problems or even cause a ﬁre or may lead to fatal injuries. Do not dismantle or open the lithium-ion traction battery pack without authorization. In case of accidents, professionals should not cut or impact the battery pack to avoid leaks, deformation, and potential injury. WARNING ! Before storing the vehicle for an extended period (over one month), ensure the battery is charged to more than 50%. After prolonged parking, perform charging maintenance at least once a month. This involves fully charging the vehicle using AC slow charging, then discharging it to between 40% and 60% before parking again. Failure to maintain the battery as recommended could lead to vehicle issues caused by over-discharge, which may not be covered under warranty. NOTE Be extra cautious of pedestrians. Since the vehicle is quiet and doesn't make noise from the engine, pedestrians might not realize it's approaching, moving, or getting ready to move, and could accidentally step into its path. ! Common terminologies and abbreviations EV - Electric Vehicle HV battery - High Voltage battery LV battery - Low Voltage (12V) battery AC - Alternating Current DC - Direct Current OBC - On Board Charger PDU - Power Distribution Unit VCU - Vehicle Control Unit BMS - Battery Management System OBD - On Board Diagnostics SoC - State of Charge SRS - Supplementary Restraint System CRS - Child Restraint System DAB - Driver Airbag PAB - Passenger Airbag 1-4 MAIN COMPONENTS OF ELECTRIC VEHICLE K n o w y o u r E l e c t r i c V e h i c l e 1 ABS",
  "- Anti-lock Braking System EBD - Electronic Brake Force Distribution ESC - Electronic Stability Control PEPS - Passive Entry/Passive Start ESCL - Electronic Column Steering Lock EPAS - Electric Power Assisted Steering LED - Light Emitting Diode DRL - Daytime Running Lamp ORVM - Outer Rear View Mirror IRVM - Inside Rear View Mirror EC-IRVM - Electric Chromic Inside Rear View Mirror HVAC - Heating Ventilation and Air Conditioning FATC - Fully Automatic Temperature Control DIS - Driver Information System DTE - Distance to Empty IGN - Ignition ACC - Accessory EPB - Electronic Parking Brake (EPB) CPL - Centre Positioning Light V2L - Vehicle to Load V2V - Vehicle to Vehicle 1-5 MAIN COMPONENTS OF ELECTRIC VEHICLE Safety Systems 2 Important safety precautions Seats & protective devices l Front seat l Rear seat l Head rest l Seat belt l Use of seat belts during pregnancy Child restraint system (CRS) l CRS l Types of child restraint system l Child seat ﬁxing device Airbag l Supplementary restraint system (SRS – Airbags) l Airbag safety tips Brake system l Electronic brake force distribution (EBD) system l Electronic stability control (ESC) l Electronic parking brake (EPB) l Automatic vehicle hold (AVH) l Electric power steering (EPS) l Emergency brake* S a f e t y S y s t e m s 2 This section of the manual, along with others, contains crucial safety guidelines. Please pay special attention to the following precautions: a. Always use your seat belt It provides the best protection in any type of accident. Airbags are designed to complement seat belts, not to replace them. Therefore, even though your vehicle has airbags, ALWAYS ensure that you and your passengers wear your seat belts and wear them correctly. b. Secure all children All children under the age of 13 should ride in the back seat of your vehicle, properly restrained. Infants and small children should be secured in an appropriate Child Restraint System. Older children should use a booster seat with a lap/shoulder belt until they can safely use the seat belt alone, without the booster seat. WARNING ! Do not use a cushion that reduces friction between the seat and the passenger. The passenger's hips may slide under the lap portion of the seat belt during an accident or a sudden stop. Serious or fatal internal injuries could result because the seat belt cannot operate properly. IMPORTANT SAFETY PRECAUTIONS c. Safety precautions Adjusting the seats so that you are sitting in a safe and comfortable position plays an important role for the safety of the driver and passengers, as much as seat belts and air bags when in an accident. d. Airbag risks Though airbags can be life-saving, they can also cause serious or fatal injuries to those who are too close or not properly restrained. Infants, young children, and shorter adults are especially at risk. Adhere to all instructions and warnings provided in this manual regarding airbags. 2-1 CAUTION Adjusting the seats so that you",
  "are sitting in a safe and comfortable position plays an important role for the safety of the driver and passengers, as much as seat belts and air bags when in an accident. 2 e. Avoid driver distraction Driver distraction is a signiﬁcant and potentially fatal hazard, particularly for inexperienced drivers. Always prioritize safety and be aware of distractions like drowsiness, reaching for objects, eating, grooming, interacting with other passengers, and using mobile phones. To minimize distraction: • Set up mobile devices (e.g., MP3 players, phones, navigation units) only when your vehicle is parked or stopped. • Use mobile devices only when permitted by laws and when it is safe. Never text or email while driving; many places have laws against texting and some also ban handheld phone use. • Do not let mobile device use distract you from driving. It's your responsibility to ensure that both hands remain on the wheel and your attention stays on the road. f. Maintain appropriate speed Driving at excessive speeds is a leading cause of accidents and injuries. Higher speeds increase the risk of severe consequences, although serious injuries can also occur at lower speeds. Always drive at a safe speed for the current conditions, regardless of posted speed limits. g. Ensure vehicle safety Tire blowouts or mechanical failures can be dangerous. To minimize these risks, regularly check your tire pressures and conditions, and follow all scheduled maintenance guidelines. S a f e t y S y s t e m s 2-2 IMPORTANT SAFETY PRECAUTIONS 2 a. Front seat position SEATS AND PROTECTIVE DEVICES S a f e t y S y s t e m s 2-3 Front seat When you sit on the seat, make your hip as close to the backrest as possible. Adjust the distance between the seat and the pedal to make your leg slightly bend when you press the pedal. The passenger’s seat shall slide as backward as possible. Make your shoulders lean on the backrest as backward as possible. Set the backrest inclination angle to make your arm conveniently to reach the steering wheel while slightly bending the arm. Keep the shoulders leaning against the backrest while turning the steering wheel. The backrest shall not incline excessively backward. We suggest that the inclination angle of all backrests shall not be more than 25 degrees. The seat height shall be so set that the occupant can see all directions and the positions of all display instruments. The head must be at least one hand away from the roof lining. The thighs are right on the seat without constriction. WARNING ! When adjusting your seat, follow these precautions: • NEVER adjust the seat while the vehicle is moving. Unexpected movements could lead to losing control of the vehicle and causing an accident. • Avoid placing anything under the front seats. Loose objects in the driver's foot area might interfere with the foot pedals and cause an accident. • Ensure nothing interferes with the seatback's normal position and proper",
  "locking. • Do not place a cigarette lighter on the ﬂoor or seat. Operating the seat could cause gas to escape from the lighter and start a ﬁre. 2 S a f e t y S y s t e m s 2-4 SEATS AND PROTECTIVE DEVICES WARNING ! • Be careful when retrieving small objects trapped under the seats or between the seat and the center console. Sharp edges of the seat mechanism could cut or injure your hands. • If there are rear seat passengers, adjust the front seat position carefully. • After adjusting the seat, always ensure it is securely locked in place. If it's not locked properly, the seat could unexpectedly move and cause an accident. CAUTION • Don't try to adjust your seat while you're wearing your seat belt. Moving the seat cushion forward could put strong pressure on your stomach. • Be careful not to let your hands or ﬁngers get caught in the seat mechanisms while the seat is moving. • Never leave children alone in the vehicle. WARNING ! The power seats can be moved even when the vehicle is turned oƯ. To avoid damaging the seats: • Always stop adjusting the seats once they've been moved as far forward or backward as they can go. • Avoid adjusting the seats for longer than needed when the vehicle is turned oƯ to prevent unnecessary battery drain. • Do not try to operate two or more seats simultaneously as this could cause an electrical problem. 2 S a f e t y S y s t e m s 2-5 SEATS AND PROTECTIVE DEVICES b. Seat position adjustment Electric adjustment type* As shown in the ﬁgure, the electric adjustment switch is on the outer side of the seat. Push the switch forward or backward, and the seat will move forward or backward accordingly. Release the switch when it reaches a proper position. Manual adjustment type* You can adjust the front seat by using the levers located under the seat cushion. To adjust the seat forward or backward, pull upward the adjustment lever on the front lower part of the seat to adjust the seat forward or backward, and release the lever after the seat is adjusted to a proper position. Try to slide the seat forward and backward to ensure that the seat is locked at a proper position. NOTE Before you start driving, adjust the seat to the right position so that you can comfortably reach the steering wheel, foot pedals, and controls on the dashboard. ! NOTE If the seat does not move when the switch is turned, the seat may be already at its limit position, or the vehicle battery runs out. Please check for conﬁrmation. Never turn the switch forcibly to avoid any damage. ! 2 c. Seat backrest adjustment Electric adjustment type* S a f e t y S y s t e m s 2-6 SEATS AND PROTECTIVE DEVICES As shown in the ﬁgure, turn the adjustment",
  "switch forward and backward, and the backrest will be folded forward or unfolded backward depending on the vehicle conﬁguration. Release the switch when it is adjusted to a proper position. NOTE If the backrest does not move when the switch is turned, the backrest may be already at its limit position, or the vehicle battery runs out. Please check for conﬁrmation. Never turn the switch forcibly to avoid any damage. ! Manual adjustment type* Pull up the handle near the seat cushion; adjust the backrest inclination angle to a proper position; then, release the handle. After adjusting the seat backrest, try to shake the backrest to ensure that the backrest is locked. WARNING ! The backrest plays an important protection role when the vehicle is running. Unlocked backrest may cause severe personal injuries in case of sudden braking or a collision. Any time after adjusting the seat backrest, shake the backrest to check whether it is locked even though no passenger occupies the seat. 2 S a f e t y S y s t e m s 2-6 SEATS AND PROTECTIVE DEVICES WARNING ! Reclining the seatback: Sitting in a reclined position while the vehicle is moving can be dangerous. Even if you're wearing your seat belt, reclining the seatback reduces the eƯectiveness of your seat belt and airbags. Never recline the seatback while the vehicle is in motion. Riding with a reclined seatback increases the risk of serious or fatal injuries in a crash or sudden stop. Drivers and passengers should always sit upright in their seats, properly restrained, with the seatbacks upright. Seat belts need to ﬁt tightly across your hips and chest to work correctly. When the seatback is reclined, the shoulder belt cannot properly secure your chest—it may sit in front of you instead. In an accident, this could cause you to be thrown into the seat belt, potentially causing neck or other injuries. The more the seatback is reclined, the higher the risk that the passenger's hips could slide under the lap belt or the passenger's neck could hit the shoulder belt. d. Seat height adjustment Electric adjustment type* As shown in the ﬁgure, rotate the height adjustment switch on the outer side of the seat cushion, and then release the switch after the seat is adjusted to proper height. Manual adjustment type* Turn the handle on the outer side of the seat upward and downward until the seat is adjusted to the desired height. While adjusting the seat height, the seat must be loaded. Therefore, please sit on the seat before adjustment; otherwise the adjustment device may be damaged. 2 Rear Seat Here are simpler instructions for handling the rear seatback: • When you're putting the rear seatback back up from being folded, hold it and move it slowly. Make sure it locks into place by pushing down on the top of the seatback. If it's not locked during a sudden stop or accident, things in the back could move forward very fast",
  "and hurt people inside the car. • When folding the seatback, gently press against it or the headrest to control how fast it folds. If you don't press, it might fold down suddenly and hurt someone when you pull the lever. CAUTION Do not allow your hands or ﬁngers to get caught in the seat mechanisms whilst adjusting the seats S a f e t y S y s t e m s 2-7 SEATS AND PROTECTIVE DEVICES To keep the vehicle safe: Before you fold the seatback, put the seat belt buckle in the holder between the seatback and cushion. Also, guide the seat belt strap into its place to protect it from getting damaged. a. Backrest adjustment and folding To adjust the seat forward or backward: 1. Lift and hold the seat adjustment lever up. 2. Slide the seat to where you want it. 3. Let go of the lever and check that the seat is securely locked in position. WARNING ! Do not put any article or luggage higher than the rear seat on the seat. No one is allowed to sit on a seat with backrest folded when the vehicle is running. The area for passenger is separated from the area for luggage. In an emergency brake or other accident, the unﬁxed luggage or the passenger sitting on a seat with backrest folded may be thrown out from the vehicle. This may result in serious personal injury or even death. 2 S a f e t y S y s t e m s 2-8 SEATS AND PROTECTIVE DEVICES WARNING ! Ensure that each seat is locked before driving. Do not operate the seat release handle when the vehicle is running. Otherwise, the passenger may be injured. b. Adjust the seatback angle Front and rear seat position and backrest angle when measuring the seat cushion depth. For measurement of the seat cushion thickness, the seat can be in any position. The seat backrest angle state is 25 degrees backward in the vertical state. 1. Pull up the seatback recline lever. 2. Hold the lever and move the seatback to your preferred position. 3. Release the lever and ensure the seatback is securely locked in place. The lever should return to its original position for the seatback to be locked. You can fold the seatbacks using You can fold down the rear seats to make it easier to carry long items or to create more space for luggage in the vehicle. Here are simpler instructions: • Never let anyone sit on a folded seatback while the vehicle is moving. It's not safe because there are no seat belts there. In an accident or sudden stop, this could cause serious injury or death. • Items on a folded seatback should not stick up higher than the front seats. If they do, they might slide forward and hurt someone or cause damage if there's a sudden stop. 2 WARNING ! These headrests are not just for comfort; they are",
  "also meant to protect passengers from neck and spine injuries like whiplash during accidents, especially if the vehicle is hit from behind. To stay safe in case of an accident, follow these steps when adjusting your headrests: • Adjust the headrests correctly for all passengers before driving. • Never allow anyone to sit in a seat without a headrest or with the headrest turned around. Head rest height adjustment To adjust the headrest upward, pull the headrest upward to a proper position and ﬁx it. To remove the headrest, press and hold the release switch. To adjust the headrest downward, press and hold the release switch and push the headrest downward to a proper position, release the release switch for ﬁxation. Do not press the headrest forcibly to avoid injuring the ﬁnger on the release switch. The front and rear seats of the vehicle have headrests that can be adjusted. S a f e t y S y s t e m s 2-9 SEATS AND PROTECTIVE DEVICES Head rest 2 Seat belt In case of accidents, seat belts can provide good protection and that they must be used during driving is stipulated by regulations. The seat belt is primarily designed for adult body sizes and is suitable for passengers with a height greater than 150 centimeters or a weight exceeding 36 kilograms. For children under 12 years old, please choose an appropriate child restraint system based on the child's size. Please check all parts of the seat belt system for any wear or damage or abnormal function regularly. Please replace the damaged parts and components. It is strongly recommended to have the seat belt or deployed seat belt tensioner replaced at the JSW MG authorised service center after an accident. a. Load limiter* It is equipped on the front seat belt. The force limiter can reduce the stress applied on the body through the seat belt damping release in case of a collision accident. DANGER Improper operation (for example removal or installation of seat belt or seat belt anchor buckle) will trigger the seat belt tensioner, leading to injury risks. All passengers shall always fasten their seat belts before driving, and must wear seat belts under any circumstances during driving. In the event of an accident, passengers who do not wear or do not wear seat belts correctly may suƯer serious injuries or deaths. S a f e t y S y s t e m s 2-10 SEATS AND PROTECTIVE DEVICES 2 WARNING ! 1. The seat belt shall not be buckled against a hard or fragile object in your pocket. Otherwise, the hard object will hurt you and the fragile object may be damaged in case of emergencies. 2. Each seat belt can only be used by one person. Do not allow multiple occupants (including children) to share one seat belt. 3. Do not allow a child to sit on the passenger's lap, which cannot be fully protected. 4. If the seat backrest is tilting backwards too",
  "much when the seat belt is used, the protection eƯect will be reduced greatly when the accident occurs. 5. Do not replace, disassemble, assemble or modify the seat belt without permit. It is not allowed to add any accessory or other object that may interference with the operation of the seat belt. NOTE 1. Keep the seat belt retracted and unlocked when it is not used for a long time. Do not allow any seat belt or its buckle or tongue to be clamped by a door; otherwise, the seat belt may be damaged. 2. The seat belt adapts to the human body through the emergency locking retractor. It will tighten automatically and naturally ﬁt the body after locking. Please contact the JSW MG authorised service center for inspection if it is too tight. 3. The seat belt must be kept clean. Rough dirt will hinder the function of the automatic retracting device of the seat belt. It can be wiped with a wet cloth without removal or replacement. Pay attention to prevent foreign matters from getting in the seat belt buckle (such as sunﬂower seed shell and button); otherwise the seat belt buckle will fail. ! S a f e t y S y s t e m s 2-11 SEATS AND PROTECTIVE DEVICES 2 b. Wearing 1. Pull out the seat belt from the retractor and guide it around the body without twisting. The shoulder belt shall span the whole shoulder obliquely, but shall not touch the neck or slip from the shoulder. The lap belt shall span the hip as low as possible. 2. Inserting the latch plate forward (reverse insertion of the latch plate will cause the seat belt to twist, and cut or even endanger life in case of collision). Insert it into the buckle of the seat pair until a \"click\" locking sound is heard, and then pull it to check whether the locking is reliable. Pull the shoulder belt forcibly to adjust the tightness degree of crotch strap. The occupants can move in a small range when the vehicle stably runs, and the seat belt can be pulled out or retracted with the slow movement of the occupants. Loose or heavy clothing will hamper close wearing the seat belt. Do not place any object (such as handbag and mobile phone) between the seat belt and your body. S a f e t y S y s t e m s 2-12 SEATS AND PROTECTIVE DEVICES 2 c. Unlock If you need to release the seat belt, press the red button on the buckle, and the tongue will automatically pop up and the seat belt automatically will retract. The seat belt is locked due to retracting or pulling out too fast, and it can be smoothly pulled out by loosening the webbing. Use of seat belts during pregnancy The seat belt provides protection for everybody, including a pregnant woman. Like all passengers, if pregnant women do not wear the seat belt, severe personal injuries",
  "are more likely to be caused to them. The pregnant woman shall wear the hip/shoulder seat belt during the whole pregnancy, and the hip belt shall be fastened as low as possible. The best way to protect a fetus is to provide safety protection to its mother. If the seat belt is fastened correctly, the fetus is not vulnerable to injury in case of a collision. For a pregnant woman or any person, correct wearing is the key to exerting the best protection eƯect of the seat belt. S a f e t y S y s t e m s 2-13 SEATS AND PROTECTIVE DEVICES WARNING ! The crotch belt shall be placed as low as possible to go across the hip, so as to avoid force on the belly. 2 S a f e t y S y s t e m s 2-14 Child restraint system (CRS) The vehicle is not equipped with a child seat. If you need one, a child seat that is applicable to ISOFIX \"general\" type can be selected. Child seat can only be placed on the 2nd row seat, because the front seat is not equipped with an anchor bracket. The statistical data of accidents show that placing the child seat on the second row seat can largely improve the child safety. CAUTION A young child shall always use the child seat. Never hold a baby in your arms while riding in the vehicle. Never allow a child to stand or kneel on a seat or in the luggage compartment when the vehicle is running. CAUTION An unﬁxed child seat may be thrown out of the vehicle in case of a collision or emergency stop, causing personal injuries to the driver and passengers. Be sure to properly secure the child seat even when it is not in use. CHILD RESTRAINT SYSTEM CAUTION If the child seat is put in a closed compartment in hot weather, its temperature will be very high. Make sure that the child seat temperature is not very high before putting a child in the seat. If the child is too small and the seat belt cannot provide the best protection for him/her, please make sure that a proper child seat is used to provide safety protection. CAUTION The size and conﬁguration range of the child seat is very wide. Not all child seats are applicable to your vehicle due to the interior trim as well as the seat shape and size. You have responsibility to ensure that the child seat installed matches with your vehicle and that the seat can be connected correctly to the vehicle with its anchor system. If the child seat does not match with your vehicle size and the child body ﬁgure or the connection to your vehicle is incorrect, severe personal injuries will be caused to the child and other passengers in the vehicle in case of a collision. 2 CHILD RESTRAINT SYSTEM S a f e t y S y s t",
  "e m s 2-15 Types of child restraint system According to GB27887-2011, the child restraint system can be classiﬁed into 5 groups below: Group 0: for children weighing less than 10 kg. Group 0+: for children weighing less than 13 kg. Group I: for child weighting more than 9 kg and less than 18 kg. Group II: for child weighting more than 15 kg and less than 25 kg. Group III: for child weighting more than 22 kg and less than 36 kg. Please select a suitable child seat according to the child weight and body ﬁgure. For infants under one year old, their bones are very fragile, and a backward-facing child seat shall be used. 2 Applicability of diƯerent riding positions to child restraint system Quality Group Seat (or Other Positions) Front passenger Left/Right rear seat Rear-row middle seat Middle-row side seats Second-row center seat Group 0: <10kg X U X X X Group 0+: <13kg X U X X X Group I: 9kg~18kg X U X X X Group II: 15kg~25kg X U X X X Group III: 22kg~36kg X U X X X Note: Meanings of letters in the table are as follows: U - applicable to universal child restraint system certiﬁed under this mass group. UF - Applicable to the forward-facing universal child restraint system approved by this quality group. L - applicable to special child restraint systems included in the list. Such restraint systems maybe for special, restricted or semi-general vehicles. B - applicable to built-in child restraint system approved for this mass group. X - The seat is not suitable for child restraint systems under this mass group. S a f e t y S y s t e m s 2-17 CHILD RESTRAINT SYSTEM 2 Quality Group Size Class Fixture Seat (or Other Positions) Front passenger Left/Right rear seat Rear-row middle seat Middle-row side seats Second-row center seat Other positions Carry-cot F ISO/L1 X IUF X X X X G ISO/L2 X IUF X X X X 1 Group 0: <10 kg E ISO/R1 X IUF X X X X (1) Group 0+: <13 kg E ISO/R1 X IUF X X X X D ISO/R2 X IUF X X X X C ISO/R3 X IUF X X X X 1 Group I: 9kg~18kg D ISO/R2 X IUF X X X X C ISO/R3 X IUF X X X X B ISO/F2 X IUF X X X X B1 ISO/F2x X IUF X X X X A ISO/F3 X IUF X X X X (1) Group II: 15kg~25kg (1) Group III: 22kg~36kg (1) Note 1: For child restraint systems not marked according to ISO/×× size class (A~G), vehicle manufacturers shall specify the vehicle-speciﬁc ISOFIX child restraint system recommended for each seat. Note 2: Meanings of letters in the table are as follows: IUF - The seat is suitable for universal ISOFIX forward-facing child restraint systems approved for use in this mass group. IL - Applicable to special ISOFIX child restraint systems on the list.",
  "Such restraint systems maybe for special, restricted or semi-general vehicles. X - The ISOFIX position is not applicable to ISOFIX child restraint systems under this mass group and/or size class. Information on suitability of diƯerent ISOFIX positions for ISOFIX child restraint system S a f e t y S y s t e m s 2-18 CHILD RESTRAINT SYSTEM 2 Child seat ﬁxing device There is a set of ﬁxing device on each of the right and left sides of the second row seat. To ﬁx the child seat: 1. The lower anchorage of child seat ﬁxing device is on the joint between the rear row left and right seat backrest and the seat cushion back. Its position can be identiﬁed through the label on the lower edge of the backrest. 2. Clear up the objects on the seat. Note to remove the seat belt and seat belt buckle to avoid aƯecting accurate ﬁxing of the child seat. 3. Put the child seat on the second row seat. 4. ① : Child seat clamp, ② lower ﬁxing point; connect the ﬁxed hook on the child seat with the vehicle's ﬁxed device. Operate according to the child seat instructions. S a f e t y S y s t e m s 2-19 CHILD RESTRAINT SYSTEM 2 5. Connect the upper strap of the child seat to the corresponding ﬁxing point of the vehicle. Refer to the child seat instructions to get to know when and how to strain the upper strap. As shown, the upper anchorage of child seat ﬁxing device is located behind the rear seat backrest. 6. Push and pull the child seat in all directions to make sure it is safely secured. 7. Make sure that the child seat temperature is not very high before putting a child in the seat. In case of a serious collision accident, the child seat ﬁxing device may be damaged. Some parts may require repair and replacement. Please check the child seat ﬁxing device after a collision. S a f e t y S y s t e m s 2-20 CHILD RESTRAINT SYSTEM 2 Supplementary Restraint System (SRS – Airbags) 1. Driver frontal airbag. 2. Front passenger frontal air bag. 3. Front side airbag. (If equipped) Side 4. R oof rail airbags (If equipped) For all airbags, the letter \"AIRBAG\" is marked on the trim panel or the label near the opening where they are deployed. For frontal air bags, the letter \"AIRBAG\" for the driver is located in the middle of the steering wheel, and that for the front passenger is located on the instrument panel. For lateral-impact air bags, the letter \"AIRBAG\" is located on the backrest side, near to the door. The letter \"AIRBAG\" for side curtain airbag is located on the roof lining or trim panel. Safety precautions & warnings The cars have air bags for the driver and front passenger seats. These air bags help the seat belts protect you. DANGER Always wear your seat",
  "belt when driving. The front air bags are designed to supplement the three- point seat belts. For these air bags to provide protection, the seat belts must be always worn when driving. You can be severely injured or killed in an accident if you are not wearing a seat belt. Air bags are designed to supplement seat belts, but do not replace them. NOTE Airbags are not designed to deploy in every collision. In some accidents, the seat belts are the only restraint protecting you. ! SRS - AIRBAGS S a f e t y S y s t e m s 2-21 Airbag layout 2 2-22 Airbag safety tips Always wear seat belts and use Child Restraint Systems on every trip. Even with air bags, you can get seriously hurt or killed in a crash if you're not properly belted or wearing your seat belt when the air bag inﬂates. Never put a child in a Child Restraint System or booster seat in the front passenger seat unless the air bag is turned oƯ. An inﬂating air bag could hit the child and cause serious or fatal injuries. ABC - Always Buckle Children under age 13 in the back seat. It's the safest place for kids of any age. If a child age 13 or older must sit in the front seat, make sure they're properly belted and move the seat as far back as it can go. All passengers should sit upright with their seat belt on, feet on the ﬂoor, until the vehicle is parked and turned oƯ. If someone isn't in the right position during a crash, the air bag could hit them hard and cause serious injuries. You and your passengers should avoid sitting too close to air bags or leaning against the door or centre console. Move your seat back as far as possible from front air bags while still being able to control the vehicle. Airbag position & marking: As shown in the Figure A above, the driver frontal airbag is located in the middle of the steering wheel. Your vehicle is equipped with a Supplemental Restraint System (SRS) and lap/shoulder belts at both the driver and passenger seating positions. S a f e t y S y s t e m s SRS - AIRBAGS 2 2-23 As shown in the Figure B above, the front passenger frontal airbag is located in the passenger's side instrument panel. As shown in the Figure C, the front seat side airbag is installed on the backrest side near to the door As shown in the Figure D, the side curtain airbag is installed at the side wall and roof joint, on the roof lining When shall the airbag be inﬂated? The frontal airbag is designed to be inﬂated in moderate to severe head- on collision or almost head-on collision to reduce severe injury risks ofthe driver's and the front passenger's head and chest. Frontal airbag inﬂation is not primarily dependent on the speed of the",
  "vehicle, but on the object being collided with, the direction of the collision and the deceleration of the vehicle per unit time during the collision. The frontal airbag may be inﬂated at diƯerent collision speed. It depends on whether the vehicle hits the object straight or at an angle at the moment of the collision, and on whether the collided object is ﬁxed or moving, non- deformable or deformable, narrow or wide. Due to diƯerent designs of each model, the collision inﬂation conditions of the frontal airbag may vary. Frontal airbags do not inﬂate in the event of a vehicle rollover, a rear collision and many side collisions. The frontal airbag may not inﬂate in slight head- on or nearly head-on collisions, lateral or diagonal collisions, collisions to cylindrical objects (such as telegraph pole and tree trunk), rear-end collisions under large vehicle (trucks, etc.) breast board and lateral glancing collisions. As per the design, the seat lateral- impact airbag and the side curtain airbag will inﬂate according to the impact position in case of the moderate to severe lateral collisions. The seat lateral-impact airbag and the side curtain airbag will not be inﬂated in case of head-on collisions, nearly head-on collisions, vehicle overturn or rear-end collisions. The seat lateral-impact airbag and the side curtain airbag may not inﬂate in slight side collisions and lateral-frontal or diagonal collisions. As per the design, the seat lateral-impact airbag and the side curtain airbag will inﬂate on the collision side of the vehicle. Airbags are not triggered in S a f e t y S y s t e m s SRS - AIRBAGS 2 2-24 every collision. For a particular accident, it shall not simply judge whether the airbag should be inﬂated according to the causalities, vehicle damage or repair and maintenance expenses. Your vehicle is equipped with a collision sensing and diagnosis module. If a collision accident reaches certain strength, the module may record relevant collision information after the collision. If you have any questions about the airbag working condition of your vehicle in a collision accident, please contact the JSW MG authorised service center in time for professional analysis and diagnosis. How is the airbag inﬂated? During inﬂation, the sensing system sends an electronic signal that triggers the gas generator to release gas to ﬁll the airbag, causing the airbag to inﬂate and eject from the cover. The gas generator, airbag and relevant members are all components of the airbag module. Please refer to \"Airbag Position\" for details. How does the airbag provide protection? The airbags supplement the protection provided by the seat belts by distributing the impact forces more evenly over the occupant's body. However, in collisions where the occupant's body is not moving in the direction of the airbag, and in collisions where an external object has entered the vehicle, the airbag is unable to provide the appropriate protection. The airbag shall only be seen as a supplementary device to the seat belt. WARNING ! When the airbag is",
  "inﬂated, dust may be spread in the air. All persons in the vehicle shall get oƯ the vehicle as soon as possible. If you have a breathing problem and cannot get oƯ the vehicle after airbag inﬂation, open the windows or doors to get fresh air. If breathing problems occur after the airbag is inﬂated, you should seek medical attention as soon as possible. S a f e t y S y s t e m s SRS - AIRBAGS 2 2-25 What will you see after the airbag inﬂates? When the airbag is inﬂated, it will deﬂate so quickly that some people may not even notice that the airbag has been inﬂated because it deﬂates so fast. Smoke and dust may also be emitted from the deﬂated airbag vent. If the vehicle power supply system can still work normally after a collision, the vehicle has the functions of automatically unlocking doors, turning on hazard warning lamps and turning oƯ fuel system after airbag inﬂation. The driver can use corresponding function switch to lock doors, turn oƯ indoors lamps and turn oƯ the hazard warning lamp. The deployment of the front passenger air bag may also cause damage • An airbag is designed to inﬂate only once. After the airbag is inﬂated, some parts of the airbag system need to be replaced. Otherwise, the airbag system will be unable to provide protection in the next collision accident. The airbag system parts that shall be replaced include the airbag module, airbag control module, seat belt pretensioner and other parts. • Work related to the SRS can only be done by JSW MG authorised Service Center technicians with corresponding qualiﬁcation. Improper repair and maintenance may cause that the airbag system cannot function normally. Please drive to the JSW MG authorised Service Center for repair and maintenance. • Repair, maintenance and replacement of airbag system: • The airbag system must be maintained by JSW MG authorised Service Center technicians. Improper maintenance will cause the airbag system to fail to function normally. Please go to the JSW MG authorised Service Center for repair and maintenance of the airbag system. S a f e t y S y s t e m s SRS - AIRBAGS 2 2-26 Hitting the shoulder, edge of pavement or hard surface WARNING ! if the airbag cover is damaged, opened or broken, the airbag may not function normally. It shall be repaired as soon as possible. Never stick or cover any object on the airbag cover surface or reﬁt the airbag cover; never try to repair, adjust or remove or install any airbag system component; never try to reﬁt the front bumper of the vehicle body by yourself. Other situations where the airbag may be inﬂated (deployed) except for a collision The airbags may also inﬂate if the underside of the vehicle suƯers a severe impact. Refer to the following examples. The Frontal airbag may not be inﬂated in the following collisions: The airbags may also inﬂate if the",
  "underside of the vehicle suƯers a severe impact. Refer to the following examples. Fall into or drive into a deep pit Wheel hard landing or vehicle fall S a f e t y S y s t e m s SRS - AIRBAGS 2 2-27 The Frontal airbag may not be inﬂated in the following collisions The frontal airbag is generally not inﬂated in the event of a side collision, rear-end collision, rollover or low-speed frontal collision. No matter what kind of collision, only when the vehicle generates suƯicient forward deceleration, will the frontal airbag be inﬂated. Head-on collision angle over 30° from vehicle longitudinal direction Overturn, falling from high place, rolling Hit deformable objects, such as sandpile, guard bar, column and tree S a f e t y S y s t e m s SRS - AIRBAGS 2 2-28 Hit into front vehicle bottom, especially truck bottom Side Airbag / Side Curtain Airbag (If Equipped) may not be inﬂated in the following collisions The side airbag/side curtain airbag system may not be activated if the vehicle suƯers a lateral collision at a certain angle or if the side of the non-occupant compartment is hit. Vehicle body side (not passenger compartment) collision OƯ-vertical side collision S a f e t y S y s t e m s SRS - AIRBAGS 2 2-29 The side airbags/side curtain airbag do not normally inﬂate in the event of a frontal collision, rear-end collision, rollover or low- speed side impact. Frontal collision Rear-end collision Overturn, falling from high place, rolling Side collision to truck during drifting S a f e t y S y s t e m s SRS - AIRBAGS 2 2-30 Airbag warning On the instrument panel, there is an airbag indicator which displays the airbag shape symbol. The system will check whether the airbag circuit system has a fault and give corresponding prompt through the indicator. The indicator will light up in case of airbag system fault. It must be inspected and repaired as soon as possible. Refer to the Section \"Instruments and controls\" for detailed information. S a f e t y S y s t e m s NOTE Backward child restraint device must not be used on seats protected by a frontal airbag (in the activated state) ! ! SRS - AIRBAGS 2 EBD watches and manages how hard the brakes press on the back wheels to make driving safer when you brake. It adjusts the brake pressure so that the front and back wheels work together to stop the car quickly and keep it steady. This is done by reducing the pressure on the rear wheels when needed. the EBD system uses the high-speed computer to respectively induce and calculate diƯerent ground to which four tires are attached, and thus calculate diƯerent friction values at the moment the vehicle brakes. Therefore, four tires can be able to brake in diƯerent ways and force based on diƯerent conditions, and can be adjusted fast during movement,",
  "so as to ensure that the vehicle is stable and safe. Electronic brake force distribution (EBD) system Brake system/EBD warning lamp The brake system warning lamp illuminates after the ignition switch is turned on and it goes out several seconds later (if the park brake has been released). This indicates that the warning lamp can work normally. The brake system/EBD warning lamp also illuminates when the parking brake engages. The indicator goes out after the park brake is released. Please do fully release the park brake before starting the vehicle. If the brake system warning lamp illuminates after the park brake is fully released, it indicates possibility that the brake ﬂuid level in the ﬂuid reservoir is too low or an EBD system fault has occurred. BRAKE SYSTEM S a f e t y S y s t e m s 2-31 2 In this case, please operate in the following steps: 1. Carefully drive the vehicle oƯ the lane and then stop the vehicle. 2. Check the brake ﬂuid level. 3. Add the recommended brake ﬂuid until the ﬂuid level reaches MAX (highest) mark. Refer to \"Adding Brake Fluid\". CAUTION Please do not drive the vehicle when the brake system warning lamp has illuminated. This indicates that the brake may not work normally. Driving the vehicle with a brake fault can lead to a collision, causing personal injuries and damage to the vehicle or other properties as a result. S a f e t y S y s t e m s 2-32 BRAKE SYSTEM 4. In case of the following circumstances, it is recommended to drive the vehicle at a safe speed to the nearest JSW MG authorised Service Center to inspect the brake and conﬁrm that: • You discovered the brake system leakage. • The brake system warning lamp keeps illuminated. • The brake cannot work normally. Pic The Electronic Stability Control (ESC) system is an advanced safety feature that builds on the functions of ABS and TCS. It includes sensors like the yaw rate sensor, lateral acceleration sensor, and steering wheel angle sensor. These sensors help monitor and control the driving and braking forces of all wheels- front, rear, left, and right-through a computer (ECU). This ensures the vehicle stays stable during turns and manoeuvres. If the driver pushes the limits, especially during high-speed turns, the ESC system steps in automatically to regain control and keep the vehicle safe. Indicators relevant to the ESC system consist of ABS MIL, EBD MIL, ESC MIL and ESC OFF indicator. 1) Indicators illuminate for self- inspect when the instrument is turned on. The 4 indicators are normally on for 3s, indicating that the ESC system is conducting self-inspect and indicators work normally. The 4 indicators go out 3s later under the normal condition. Electronic stability control (ESC) When faults (such as neglected installation, loosened connector, abnormal CAN communication) exist on the ESC system, only the ESC OFF lamp will go out 3s later, and the other 3 lamps are",
  "normally 2) In the process of driving, if the ESC function is activated, the ESC lamp will ﬂicker, telling the user that the ESC system is working. If the ESC system functions are abnormal but the ABS+EBD system functions are normal, the ESC lamp is normally on, indicating that the ESC system gets faulted. If the ESC system and the ABS function are abnormal and the EBD system functions are normal, the ESC lamp and the ABS lamp are normally on. 3) The ESC OFF lamp is used to indicate that the ESC function is disabled (the lamp will be normally on so long as the ESC function is disabled; the lamp will go out if the function is enabled). 2 S a f e t y S y s t e m s 2-33 BRAKE SYSTEM 2 If the user disables the ESC, some ESC functions will be disabled, and the ESC OFF lamp will illuminate. If ESC is working when it is to be disabled, the ESC function will not be disabled immediately and will be disabled after the work is over. If the user enables the ESC again, all functions will be restored. 4) Each time the vehicle is started, the ESC system will be activated automatically. After you start the vehicle, the light on the indicator will turn on for a short time and then turn oƯ. This shows that the indicator is working correctly. While you are driving, if the ESC turns on, its light will blink to let you know the system is active. But if the ESC light stays on without blinking, it means there is a problem with the system. Electronic stability control (ESC) On/OƯ The Electronic Stability Control (ESC) system is a new safety feature in vehicles. It builds on the Anti-lock Brake System (ABS) and Traction Control System (TCS). ESC uses a computer to manage how each wheel moves when you drive or brake, keeping the vehicle stable on turns. ESC is always on by default. If you need to turn it oƯ, you can do so in the vehicle settings under \"Menu- Vehicle settings - Driving - Electronic Stability Control” on the dashboard. When ESC is oƯ, the \"ESC OFF\" light on the dashboard will be on. To turn ESC back on, you can do it from the same screen where you turned it oƯ, and the light will turn oƯ. S a f e t y S y s t e m s 2-34 BRAKE SYSTEM Normally, it's not recommended to turn oƯ ESC. It should only be turned oƯ temporarily if your vehicle is stuck in mud or driving on very slippery surfaces like snow. 2 When you start the vehicle, a light will brieﬂy turn on and then go oƯ, showing that everything is working correctly. The electronic stability control (ESC) is always on when you start the car. If you need to turn it oƯ, you can do this in the vehicle settings under “Menu",
  "- Vehicle settings - Driving - Electronic Stability Control” on the dashboard. When ESC is oƯ, the \"ESC OFF\" light on the dashboard will be on. To turn ESC back on, you can do it from the same screen where you turned it oƯ, and the light will turn oƯ. It's usually best not to turn oƯ the ESC system. Only turn it oƯ temporarily if your vehicle is stuck or climbing out of a diƯicult situation. EPB is used to engage & disengage parking brake electronically using the EPB switch. As shown in the image, the electronic handbrake is located on the right side of the driver's knee. EPB is applied automatically when the lever is shifted to P (Park). At the same time, the EPB working indicator on the instrument will light up, and the parking is completed. Electronic parking brake (EPB) NOTE When shifting from D (Drive) to R (Reverse), the brake pedal must be pressed. Depress the brake pedal when shifting from R to D. Ensure that the vehicle speed is below 6 km/h for a successful gear shift . ! S a f e t y S y s t e m s 2-35 BRAKE SYSTEM NOTE Normally, it is not recommended to disable the ESC system. ! 2 a. Application To manually apply the parking brake, ﬁrst depress the brake pedal to stop the vehicle, and then pull up the EPB switch. The EPB working indicator on the instrument will illuminate. After the instrument displays \"Parking Brake Applied\", release the switch. At the time, the EPB system brake will be clamped to park the vehicle in situation. b. Release To release the parking brake, shift to gear P or N (in READY state) and depress the accelerator pedal to automatically release the parking brake; or depress the brake pedal and press the EPB switch to release the parking brake. The EPB working indicator on the instrument goes out, and the instrument displays “parking Application / Release of parking brake brake released”, reminding you of parking brake released. When you open the driver side door in the motionless state, the vehicle will automatically apply parking brake, and you do not have to pull up the EPB switch. During transport, traction and vehicle cleaning, you may need to deactivate the EPB automatic clamping function so as to make it possible to move the vehicle after exiting READY state. Deactivation method: Depress the brake pedal and hold the EPB switch pressed. The EPB light when go on deactivation. S a f e t y S y s t e m s 2-36 BRAKE SYSTEM Illustration be to added 2 Electronic parking brake (EPB) w i orking ndicator* The Electronic parking brake (EPB) working indicator illuminates as the electronic parking brake is pulled up. This indicates that the vehicle is in a parking state. This indicator goes out as the electronic parking brake is released. This indicates that the vehicle is out of the parking state. This indicator",
  "keeps illuminated as long as the electronic parking brake engages ﬁrmly. Automatic vehicle hold (AVH) After activating the function, the driver presses the brake pedal to stop the vehicle, or presses it while the vehicle is stationary with the engine idling. When the brake pedal is released, hydraulic pressure in the brake system is maintained to keep the vehicle parked where it is. There's no need to manually engage the Electronic Parking Brake (EPB) for parking in this situation. AVH switch (Auto Hold) The automatic parking function is set to the default open state and can be turned on/oƯ in the car “Menu - Vehicle settings - Driving - Auto Hold”. S a f e t y S y s t e m s 2-37 BRAKE SYSTEM 2 Automatic vehicle hold (AVH) working indicator After the vehicle is powered on, the AVH working indicator illuminates for a few seconds and then goes out. This indicates that the indicator can work normally. This indicator illuminates when the automatic vehicle hold function works and the vehicle is being parked. It goes out as the vehicle gets out of the parking state. S a f e t y S y s t e m s 2-38 BRAKE SYSTEM A AVH conditions AVH shall be activated ﬁrstly): 1. The vehicle is stationary and in the READY state. 2. T he brake pedal is depressed to a degree (brake hydraulic pressure > 9 bar). 3. Ensure that the driver's seat belt is buckled and the driver's side door is closed. After the vehicle is parked automatically, if you need to start the vehicle, gently depress the accelerator pedal. When the vehicle reaches the starting condition, the parking brake will be released automatically. 2 time. Electric power steering The EPS system provides steering assistance for the vehicle. This system does not need power steering ﬂuid, which brings great convenience for the daily vehicle maintenance. When the power supply is turned on, the EPS MIL illuminates momentarily. The EPS warning lamp does not go out or illuminates when the vehicle is running, indicating that there is a fault in the EPS system. In case of such condition, there is a need to go to JSW MG authorised Service Center for check in time. When the EPS system is under extreme conditions of high load work for a long time (For example, the steering wheel is “turned to the end” for a long time, or the vehicle is moved into the garage at a low speed repeatedly to a wide angle), the time you have to steer the wheel with great force. If you need to restore normal power assistance, you can steer the wheel at a smaller angle or increase the speed. You can restart the vehicle if necessary. Automatic vehicle hold (AVH) fault warning lamp* After the vehicle is powered on, if the AVH fault warning lamp illuminates for several seconds and then goes out, it indicates that the warning lamp and AVH function module work",
  "normally. In case of an automatic vehicle hold function module fault or a warning lamp fault, it will be indicated in any of the following ways: • When the power supply is on, the lamp remains oƯ. • After lighting up, it does not go out. keep illuminated during driving Once the automatic vehicle hold (AVH) fault warning lamp shows the above abnormalities, please contact the JSW MG authorised service center in S a f e t y S y s t e m s 2-39 BRAKE SYSTEM A 2 EPS fault warning lamp When the vehicle is powered on, the warning lamp will illuminate instantaneously. It indicates that the system is conducting selfinspection and the warning lamp bulb can work normally. The warning lamp goes out several seconds later. When the electronic power steering (EPS) system detects a fault, the warning lamp will give out an indication. When the steering system has a fault, the vehicle can still steer, but requires much greater eƯort. In case of the following circumstances, please consult the nearest JSW MG authorised service center. • This lamp does not illuminate when the vehicle is powered on. • After lighting up, it does not go out. keep illuminated during driving Illuminated ABS warning lamp can indicate that the electronic power steering column cannot work normally. If you fail to keep the steering column in an agreeable working condition, collision may happen and as a result, personal injuries, and damage to the vehicle or other properties can occur. CAUTION NOTE The EPS system will adjust the power assistance according to the vehicle speed. As a result, the steering wheel can beturned easily at low speed and be turned relatively steadily at high speed. ! S a f e t y S y s t e m s 2-40 BRAKE SYSTEM Emergency brake* In case of an emergency requiring rapid deceleration when the braking eƯect is insuƯicient, you can pull up the electronic parking brake switch upward for additional braking assistance. To activate the emergency brake function, release the electronic handbrake switch to cancel the emergency brake function. Do not use the emergency brake function in non-emergency situations. This function is for emergency only and will wear the brake disc and brake caliper. 2 S a f e t y S y s t e m s 2-41 BRAKE SYSTEM WARNING ! Shifting to P (Park) while the vehicle is in motion may cause you to lose control of the vehicle. After the vehicle has stopped, always make sure the vehicle is in P (Park), apply the parking brake, and turn the vehicle oƯ. When parking on an incline, shift the gear to P (Park) and apply the parking brake to prevent the vehicle from rolling downhill. Starting your EV 3 General information Before driving your EV l Trial run of new vehicle l Basic operations l Charging speciﬁcation l Charge operation and precautions l Instructions to follow Driving your EV l Pre-driving safety check l Driving",
  "tips Opening & closing l Keys l Anti-theft / device immobilizer/ PEPS l Remote controller l Doors w Tailgate w Passive unlock/lock of tailgate* w Trunk w Engine hood w Charging ﬂap l Mirror l Exterior rearview mirror l Inside rearview mirror l Sun visor l Vanity mirror l Windows l Assist armrest l Roof l Front windshield wiper Driving & control l Vehicle control l Cruise control system l Electronic shifter l ADAS: Advanced driver assistance system* w Advanced cruise control* w BCA: Bend cruise assist w IDA: Intelligent driving assist* w Lane departure warning* w Safety distance alarm* w Forward collision system* w AFL: Adaptive front-lighting* Starting your EV 3 3 S t a r t i n g y o u r E V BEFORE DRIVING YOUR EV Trial run of new vehicle During the ﬁrst 500 kilometers of driving a new vehicle, follow these steps to enhance performance, improve drive range eƯiciency, and prolong the vehicle's lifespan: 1. Avoid making sudden stops unless it's an emergency. This helps the brakes settle in better. 2. Try not to accelerate rapidly or drive at high speeds to prevent motor damage and conserve power. 3. Do not tow another vehicle with your vehicle during this period. HV state After unlocking the vehicle, open the driver's side door. The instrument panel will activate, and the vehicle will enter the HV state. In HV state, all hybrid circuits are active, allowing you to engage the gear for driving and the A/C system can provide cooling while in HV state. 3-1 S t a r t i n g y o u r E V Basic operations Before you start your EV • Make sure that the area around the vehicle is clear. • Do a check of the ﬂuid levels - coolant, brake ﬂuid, and windshield washer ﬂuid as frequently as possible. • Make sure that all windows and lights are clean. • Examine the tires for their appearance, inﬂation pressure and condition. • Make sure that all doors are closed. • Position the seat and adjust the headrests. • Adjust the inside and outside mirrors. • Fasten seat belts and ask all passengers to do likewise. • Do a check of the operation of the warning lights when the power switch is pushed to the ON position. For additional information, refer to “Warning lamps and audible reminders” in the “Dashboard and Features” section of this manual. 3 BEFORE DRIVING YOUR EV Procedure to start EV 1. With the smart key sit in the driver’s seat (if equipped), vehicle will automatically switch to HV mode. 2. Fasten the seat belt before you start the vehicle. 3. Turn oƯ all electrical devices. 4. Make sure to engage the parking brake for your safety. 5. Make sure the accelerator and brake pedal have clearance with your right foot. 6. Press the brake pedal to enter the READY mode, enabling the vehicle to operate in gear. The \"READY\" state is similar to the starting",
  "state of an internal combustion engine vehicle. 7. The vehicle will get ON in ‘P’ mode only and it will be automatically selected. 8. When ‘Ready’ message appears, you can drive the vehicle. Else, you cannot drive the vehicle. Start the vehicle again. 9. Shift to the desired position (D/R). 10.Release the parking brake and slowly release the brake pedal. See if the vehicle slowly moves forward, then press the accelerator pedal. 3-2 S t a r t i n g y o u r E V NOTE • If the EPB is disengaged manually after selecting required mode (D/R), release the brake pedal slowly to move the vehicle forward with creep activated condition. Further Accelerator pedal input to be given for achieving required speed. ! 3 BEFORE DRIVING YOUR EV When the 'Ready' indicator is illuminated and the gear shifter is not in the Neutral (N) position, the driver may inadvertently press the accelerator pedal, resulting in unexpected vehicle movement. Range of your EV Your EV can drive as per given range in below table, when the high voltage battery is 100 per cent charged. However, in certain situations like driving at high speed or when the air conditioner/heater is ON, the distance to empty can reduce signiﬁcantly, as the high voltage battery consumes more electricity. NOTE The vehicle must always be put in ‘N’ when you stop the vehicle before engaging the park brake. ! Procedure to stop EV 1. Hold down the brake pedal while the vehicle is parked. 2. While pressing the brake pedal, shift to P mode using the gear knob to engage the parking brake. 3-3 Range 360 Battery State 100% Battery Spec 38 kWh NOTE The range is estimated for the reference of the driver and passengers only. The actual endurance mileage is related to various factors such as current road conditions (such as a long steep slope), driving habits (such as frequent acceleration and deceleration), temperature (such as low temperature), and whether electrical equipment (such as A/C) is on. ! Tips to get maximum range while driving EV 1. If safe to do so, modulate the accelerator pedal instead of using the brake pedal when gradually slowing down. Whenever the vehicle is moving and you are not pressing the accelerator pedal, regenerative braking slows down the vehicle and feeds surplus energy back to the HV battery. 2. Limit the use of resources such as heating, and air conditioning. If you operate the air conditioner/heater for long duration, it will use too much electricity from HV battery. S t a r t i n g y o u r E V 3 BEFORE DRIVING YOUR EV Turn OFF the heater and air conditioner if you do not need them. 3. Using the climate control system to heat the cabin when the outside temperature is below 0°C uses more electricity and aƯects vehicle range more than when using the heater when the temperature is above 0°C. 4. Press and hold the accelerator pedal to",
  "maintain speed and drive economically. 5. Gradually press and release the accelerator pedal when accelerating or decelerating. 6. Do not use unnecessary electrical components while driving. 7. Do not load unnecessary items in the vehicle trunk. Any additional load in the car drains the battery. Do not add more accessories, do not keep dead weight in the car, and in general travel as light as possible. 8. Do not mount parts on the exterior of the car as it might increase drag. 3-4 9. Service schedule should be adhered to. Fluid levels should be maintained within tolerance limits. Both of these also helps in realizing the maximum range potential of an electric vehicle 10. To optimize driving range use drive/eco mode and maintain the recommended tyre pressure. 11. Drive in ECO mode 12. ECO mode helps reduce power consumption by reducing acceleration when compared to the same accelerator pedal position in the D (Drive) position. 13. Drive at a constant speed. Maintain cruising speeds with constant accelerator positions as much as possible. 14. Accelerate slowly and smoothly. Gently press and release the accelerator pedal for acceleration and deceleration. 15. Vehicle range may be substantially reduced in extremely cold conditions (for example, 0°C). 16. Release the accelerator pedal to slow down and do not apply the brakes when traƯic and road conditions allow. S t a r t i n g y o u r E V 3 BEFORE DRIVING YOUR EV Charging speciﬁcation Please refer to the contents of the quick guide chapter for charging operation steps. This chapter introduces other relevant contents of charging. Methods of determining whether a vehicle needs charging 1. If conditions permit, it is recommended that you charge the vehicle when parking it. Shallow charge and discharge is conducive to prolonging the battery life. Do not wait until the battery runs out before recharging, which may not be conducive to your next trip and the battery life. 2. If the SOC low warning light goes on during driving, it indicates that the traction battery pack is low and needs to be charged as soon as possible. 3. When the SOC indicator indicates low remaining power, or the driving range cannot meet the travel demand, charging is required 3-5 Requirements for charging power supply The charging system for the (360km) model has a rated power of 3.3KW. The charging power is dependent on the speciﬁcations of the charging gun/charging pile and can be used with a standard household 220V AC power supply. NOTE If there is a diƯerence between the external power supply power and the charging machine's rated power, the charging power is consistent with the smaller one. ! S t a r t i n g y o u r E V 3 BEFORE DRIVING YOUR EV 3-6 Conﬁguration 360km endurance 20%-100% charging time Household 10A socket or smart charging socket 26-27h (under normal ambient temperature) Original 3.5KW charging pile (contact 4S store to install the original charging pile) 12-13h (recommended) (under normal ambient",
  "temperature) Original 7KW charging pile (contact 4S store to install the original charging pile) 12–13h (under normal ambient temperature) DC quick charging 1.5–2.0h (under normal ambient temperature, for charging equipment above 42KW) 30%-80% charging time DC quick charging Approximately 35 minutes (under normal ambient temperature, for charging equipment above 42KW) . . Speciﬁc parameters are as follows: Notes: 1. The standard charging gun provided when you purchases the car can only achieve 1.76KW charging power. If you want to increase the charging power, please purchase the charging pile on the oƯicial APP or contact a 4S store. 2. If the power line consists of multiple segments, each segment's wires, plugs, and sockets must meet the speciﬁed load requirements. Avoid ﬂying wires, and do not wrap the power line or harness around the charging equipment. Otherwise, the part that cannot meet the load requirements may melt or catch ﬁre due to overheating. 4. It is recommended to install and use the original charging gun/charging pile. The charging voltage of the original charging pile/charging gun is technically 3. When the household power supply is used for charging, the main switch and leakage protection switch shall be installed at the front end of the charging line, so that the main switch can be disconnected and leakage protection can be carried out in an emergency. Ground wire must be grounded properly. 5. Normal ambient temperature is deﬁned as 25°C adjusted to match the working voltage of the traction battery. The use of non-original charging pile/charging gun may damage the performance of the traction battery. 9. If the vehicle has a battery heating function, activating battery heating during charging may result in a certain extension of charging time, and there maybe a slight increase in power consumption during charging. This is considered a normal phenomenon 6. It is normal that the time for fully charging the battery will deviate to some extent under diƯerent battery capacities, SOC, ambient temperature, battery temperature and external charging equipment. 7. The above charging data is based on the optimal charging state. The actual charging time is subject to the actual charging time of the vehicle. 8. To ensure charging eƯiciency, it is recommended to keep the A/C oƯ during quick charging S t a r t i n g y o u r E V 3 BEFORE DRIVING YOUR EV 3-7 Charging schematic diagram CAUTION Be sure to ask a professional electrician to install the charging line for you; otherwise it may cause ﬁre or electric shock. Check for charging 1. Power oƯ the vehicle. 2. Do not ride in the vehicle when charging. Ensure the ventilation of charging places, and do not charge in conﬁned and narrow spaces. 3. Before charging, please check whether the skin and casing of the charging cable are broken. If so, please contact the JSW MG authorised service center for repair or replacement. Make sure that the charging cable is in a state of natural extension, and do not hang in the air.",
  "4. During charging, appropriate protective measures should be taken to avoid children and other irrelevant personnel approaching the charging vehicle and charging cable. 5. During charging, it should be noted that there should be no residual rainwater in the charging socket and its vicinity. 6. Do not charge the vehicle in an environment where there is rain, snow or accumulated water, or ﬁre source thunder weather. In case of rain, snow, rising water and strong wind during charging, stop charging and take away the charging cable. Otherwise, there is risk of electric leakage. 7. If the vicinity of the charging port gets wet during charging, please pull out the charging plug from the power supply socket and then unplug the charging gun from the charging port while ensuring safety. If necessary, please use insulating gloves and contact the JSW MG authorised service center for testing and conﬁrmation as soon as possible. 8. When touching the charging plug, please keep your hands dry, and use insulating gloves if necessary. S t a r t i n g y o u r E V 3 BEFORE DRIVING YOUR EV 3-8 9. The ambient temperature of charging is recommended to be 0 0 between 0 C and 35 C, and avoid charging at low or high temperature (it is recommended to charge the vehicle at noon in winter, and in the morning or evening in summer). Avoid charging in an environment of high temperature such as direct sunlight. If the vehicle is equipped with a traction battery heating system, when the internal temperature of the 0 traction battery is below 0 C during charging, the traction battery system will automatically heat up ﬁrst, and then the traction battery pack is charged after heating. 10. The charging plug is a high- voltage electrical device, which is strictly prohibited for children. It is strictly prohibited for children to operate during charging. If there are many children or people walking frequently in the charging area, safety signs should be set up. 11. Lock the doors before leaving the vehicle CAUTION Before charging, check the charging cable and charging port to make sure that the cable is not damaged and that no water or foreign matter enters the charging gun and port. NOTE 1. To extend the service life of the traction battery pack and ensure the driving safety, do not drive when the SOC is too low (< 10%). 2. Do not use the traction battery pack onboard for other purposes 3. Improper handling of the traction battery may cause serious accidents, such as traction battery damage or personal injury. In order to avoid accidents, attention should be paid to the following matters: a. Do not expose the vehicle to the environment above 0 45 C for more than 24 hours, and place the vehicle in a cool environment in time. ! S t a r t i n g y o u r E V 3 BEFORE DRIVING YOUR EV 3-9 NOTE b. Do not",
  "place the vehicle in 0 an environment of -25 C for more than 7 days, and place the vehicle in a warm environment in time. If the vehicle is in a low- temperature environment 0 (below -25 C) for a long time, the traction battery pack may freeze inside, resulting in failure to charge and to provide driving power to the vehicle, which is very dangerous. 4. To increase the service life and safety of battery packs, it is recommended: a. The vehicle without traction battery heating system cannot be charged when the internal temperature of the traction battery is below 0 0 C. Therefore, at a low ambient temperature, please charge the vehicle as soon as possible within one hour after parking. If the vehicle cannot be charged due to the low temperature of the traction battery, move ! NOTE the vehicle to a warm place or drive for a period of time before charging. b. When the vehicle will be stored for a long time (more than 1 month), charge the battery to about 60%, and disconnect the negative terminal of 12V battery in the compartment c. Please try to avoid sharp acceleration or deceleration during driving. ! NOTE If the vehicle will be stored for a long time, charge the battery to about 60%, and disconnect the negative terminal of 12V battery. Long-term storage at very low SOC is not conducive to the service life of the traction battery. ! S t a r t i n g y o u r E V 3 BEFORE DRIVING YOUR EV 3-10 NOTE The batteries are special chemical products that need proper use and maintenance. Routine full charge and full discharge are critical to the maintenance of their performance. In addition, the battery capacity is subject to natural attenuation due to the chemical properties. When you ﬁnd a decrease in SOC range, it is recommended to check it at the JSW MG authorised service center. If the battery consistency is turned out to be within the normal range, this decrease is due to the normal attenuation of the battery capacity. ! Charge operation and precautions Preparations: Cut oƯ the power supply, pull up the handbrake, take out the charging cable from the car, and check whether the cable is intact. (Note: The external view of the charging gun is for illustration only. The ﬁnal appearance shall be subject to the physical object). Charging with AC supply 1. As shown in the ﬁgure, press the right side of the charging port cap, and it will open automatically. S t a r t i n g y o u r E V 3 BEFORE DRIVING YOUR EV 3-11 4. Insert the charging gun into the charging port. 5. Pull out the charging plug cap. Insert the charger plug into the charging port until you hear a \"click\". Display \"Charging\", current battery percentage, charging connection icon and charging status icon. 5. Pull out the charging gun after charging. After charging, press the",
  "button to pull out the charging plug and cover the charging port cap. S t a r t i n g y o u r E V 3. Insert the plug into power socket 3 2. Turn the locking hook to the right to open the charging socket cap, as shown in the ﬁgure. 3-12 BEFORE DRIVING YOUR EV 7. Close the charging port cap As shown in the image, turn right to close the charging port cover until you hear a \"click\". (When closing the charging port cover, make sure that the ﬂip cover of the charger receptacle has been closed). NOTE When you charge your car in winter, due to the temperature, the lower the battery temperature is, the longer the charging time will be. Therefore, you should schedule charging reasonably so as not to delay your trip. If normal charging fails during the use of public charging facilities, please check whether the public charging facilities used function normally ﬁrst. Charging in high-temperature conditions will cause the battery temperature to rise rapidly. The charging machine will limit the charging power according to the battery temperature to avoid overheating, resulting in an extension of the charging time. This is a normal phenomenon. ! S t a r t i n g y o u r E V As shown in the ﬁgure, pull the ﬂip cover of the charger receptacle to the right and press it until a \"click\" sound is heard. If the ﬂip cover no longer rebounds after releasing, close the ﬂip cover of the charger receptacle. 3 6. Close the ﬂip cover of charging base. DC charging During DC charging, please follow the operation instructions of the charging equipment or charge under the guidance of the staƯ at the charging station (the charging equipment shall be subject to the physical object). 3-13 BEFORE DRIVING YOUR EV DANGER Before charging, check the charging port and the connector port of the charging plug for any water or foreign matter. If any, charging is not allowed. Otherwise, it may lead to short circuit or electric shock, resulting in personal injury and property loss. Do not touch the metal parts of plugs and other connectors during charging. Water conducts electricity. During charging, do not touch the charging cable and plug with wet hands, and do not charge the vehicle in a wet place; otherwise you may get an electric shock. In case of any abnormal smell or smoke during charging, stop charging immediately and contact the JSW MG authorised service center in time. Do not charge the vehicle in thunder and lightning conditions, and do not charge in the open air on rainy days. Otherwise, it may damage the charging equipment, or cause lightning strike and electric shock. Power supply function* According to the vehicle conﬁguration, some models are equipped with optional power take- oƯ function. You can draw 220V AC power from the vehicle to supply conventional household appliances with a power rating of up to 2.2kw. AC charging",
  "gun* First, put the vehicle in the Ready state and shift to the P (Park) position. Then, insert the AC power plug into the AC charging socket, and plug the appliance (with a power rating of less than 2.2 kW) into the socket on the AC power plug. The indicator light on the AC power plug will light up, indicating that power is being drawn. S t a r t i n g y o u r E V 3 3-14 BEFORE DRIVING YOUR EV NOTE The AC power plug cannot be used to draw power from one electric vehicle to charge another electric vehicle. ! DANGER If the indicator light on the power take-oƯ gun does not illuminate despite the appliance functioning properly and the correct operation, it may indicate a fault with the power take-oƯ gun. Please cease power extraction immediately. DANGER Before charging, check the charging port and the connector port of the charging gun for any water or foreign matter. If any, charging is not allowed. Otherwise, it may lead to short circuit or electric shock, resulting in personal injury and property loss. Do not touch the metal parts of plugs and other connectors during charging. DANGER Water conducts electricity. During charging, do not touch the charging gun with wet hands or charge the vehicle in a wet place; otherwise, you may get an electric shock. In case of any abnormal smell or smoke during charging, stop charging immediately and contact the JSW MG authorised service center in time. Do not charge the vehicle in thunder and lightning conditions, and do not charge in the open air on rainy days. Otherwise, it may damage the charging equipment, or cause lightning strike and electric shock. S t a r t i n g y o u r E V 3 3-15 BEFORE DRIVING YOUR EV Instructions to Follow Instructions • It is recommended to charge the vehicle to 100% every time, whenever vehicle is being charged. • After a maximum of 4 continuous fast charging cycles/ opportunity charging cycles (Opportunity Charging - where it was below 100% SoC) it is mandatory to use slow/AC Charging and charge the vehicle to 100% SoC. • Slow/AC charging till 100% SoC is must, at least once a 15 Days or after every 4 fast /opportunity charging cycles whichever is earlier, for SoC calibration & cell balancing. • Avoid charging vehicle under heavy rain / thunderstorms • Avoid driving vehicle below 10% SOC. • Make sure the charge station’s supply cable is positioned so it will not be stepped on, tripped over, or otherwise subjected to damage or stress. • There are no user serviceable parts inside the charging gun. Contact JSW MG authorised service center should you experience any problems with the charging gun. Do not attempt to repair or service the charge station or charging gun yourself may result in injury. • Do not operate your charge station and gun if it or the supply cable is visibly damaged.",
  "Contact your service representative for service immediately. Refer to the ‘Emergency and Breakdown’ section in this manual for information on the service representative in your area. • Do not place ﬁngers inside the coupler on either end of the charging gun. • Do not allow children to operate this device. Adult supervision is mandatory when children are in proximity to a charge station that is in use. • Not for use in commercial garages. • Slow charging only happens in park brake engaged condition. So always keep the park brake engaged during a charging session. S t a r t i n g y o u r E V 3 3-16 BEFORE DRIVING YOUR EV • Change of vehicle state (Ignition OFF to Ignition ON or vice-versa) should be avoided while charging. • Post switch oƯ the charger, provide min 5 seconds for touching and pulling out the gun. • If the charging gun removed and reinsertion required it could be done after at least 10 seconds of removal of the charging gun from socket. • Do not disengage/play around with the Park brake/hand brake while vehicle in fast charging condition. • Over current and leakage current protections are given in the home charging box and charging gun. The RCBO should always be in ON state during normal charging use-case and there should be no error (Red) LEDs on the charging gun. In case any tripping of RCBO is observed or error LEDs start blinking on the Charging gun, please contact TML authorized EV workshop. • Home charging box comes with a key and lock. It is recommended to lock the box during overnight charge or when the charging box is not in use to avoid misuse of charging point. DANGER Unplug both couplers of your Portable Charging Gun before cleaning. S t a r t i n g y o u r E V NOTE During normal operation, the charging gun or couplers may feel warm. If either coupler or the charging gun feels hot during charging, unplug the gun and have a qualiﬁed electrician inspect the connections before you continue charging. ! CAUTION Do not use a damaged charging station, plug point or charging port. Using the charger with a worn or damaged port may result in unanticipated consequences. 3 3-17 BEFORE DRIVING YOUR EV DANGER The charger generates electromagnetic waves that can seriously impact medical electric devices such as an implantable cardiac pacemaker in a person. When a person has an implant like the one mentioned above, make sure to ask the medical team and the manufacturer whether charging your EV will impact the operation of the medical electric device implant. In such case, do not go near the vehicle when it is charging. DANGER Ensure that the charging gun is always stored in a safe place. Do not expose it to rain or wet conditions. Avoid pouring or dripping water or other liquids over it. If water penetrates the electrical devices, the risk of electric shock",
  "increases. Ensure that all plugs and cables are free of moisture before using the charging gun. Never connect the charging gun to the mains with wet or moist hands or when the charging gun is wet. S t a r t i n g y o u r E V CAUTION Make sure that the device is always stored in a safe place. Do no expose the device to rain or wet conditions. DO NOT use this product if the EV charge connector/cable is damaged. During charging the vehicle must not be exposed to rain, lightning and snow. DANGER Charging should be done in Ignition OFF state 3 3-18 BEFORE DRIVING YOUR EV Important Tips Do and don’t • Do not allow the vehicle to be discharged to 0% in storage. • Long duration Parking o Avoid parking vehicle below 20% SOC for more than 14 days. o Ideal condition to park vehicle for longer duration (> 14 days) is with SOC between 40% to 60%. o If vehicle is not to be used for very long duration (more than 3 months) and is in parked condition, ensure the SOC between 50% to 60%. • During the resting period, the user may choose either of the following options to prevent discharge of low voltage battery. o Periodically (weekly once) user may switch on the remote Air conditioning for 20-30 mins. This wakes up both the high voltage and low voltage systems and prevents low voltage battery from getting discharged. S t a r t i n g y o u r E V o If possible, user may choose to disconnect the negative terminal of the low voltage battery. This results in complete vehicle sleep and minimum loss of charge for both low voltage and high voltage batteries. • Do not direct high pressure washer ﬂuid/ water jets (Pressure above 0.5 bar) at electrical devices and connecter during washing. This is to prevent malfunction/ failure of electrical system due to water ingress. No High pressure washing in Motor compartment, Under-ﬂoor battery pack and CCS Charging port. • Drive though calm water only and only if it is not deeper than 300mm and at this depth, the vehicle speed to be maintained at creep speed. • As EV service requires certain skill sets and trained manpower, it is always recommended to get the car serviced or repaired at only JSW MG authorised service center. 3 3-19 BEFORE DRIVING YOUR EV S t a r t i n g y o u r E V • Always check the SOC level before start of journey & ensure car is adequately charged. You may check the SOC level on the mobile app also. • Remote AC command not to be executed through mobile app while/during the charge initiation process. 3 3-20 BEFORE DRIVING YOUR EV 3 Before driving long distances, it's important to conduct a safety check. You can also visit a JSW MG authorised service center for inspection. Exterior: • Check tire",
  "pressure and inspect tires for damage. • Ensure wheel nuts are tightened securely. • Conﬁrm headlights and all other lights are functioning properly. Interior: • Ensure seat belts fasten securely and are undamaged. • Check that maintenance indicators, instrument lights, and defroster are working. • Ensure there's enough space for the brake pedal to function properly. • Inspect battery connectors for corrosion, looseness, or cracks in the casing. Under the hood: • Ensure there are fuses of correct speciﬁcations available. • Check that refrigerant levels are normal. Pre-driving safety check After starting: • Verify that instrument cluster indicators and speedometer are operating normally. • Ensure the vehicle maintains a straight path when brakes are applied. • Listen for any unusual noises. Preparations before driving: • Check surroundings before entering the vehicle. • Adjust seat position, backrest angle, seat cushion height, headrest height, and steering wheel angle and height. • Adjust rearview mirror and side mirrors. • Ensure all doors are closed securely. • Fasten seat belts. Gear shift controls: • Gear positions are marked on the gearshift lever. • Press the \"P\" button to stop the vehicle; use this position when starting or stopping the motor. • Press the brake pedal and the unlock button to shift gears. DRIVING YOUR EV S t a r t i n g y o u r E V 3-21 3 CAUTION • Only press the \"P\" button after the vehicle has completely stopped. • Use reverse gear (R) only after the vehicle has stopped. • Shift to \"P\" when leaving the vehicle. • Use \"D\" for normal driving. Driving tips Here are some tips for safe driving in diƯerent conditions: Driving through water • Check that wiper blades, lights, and brakes are working well. • Inspect tire treads and their condition. • Avoid sudden braking and sharp turns to prevent skidding. • When slowing down, shift to a lower gear and brake gently. • Keep headlights on in poor visibility. Driving on a rainy day • Check wipers, lights, and brakes for proper function. • Assess tire tread depth and condition. • Avoid abrupt braking and sharp turns to prevent skidding. • When slowing down, shift to a lower gear and brake gently. • Keep headlights on in low visibility. S t a r t i n g y o u r E V 3-22 DRIVING YOUR EV 3 Driving on snowy roads • Use snow chains when driving on snowy roads. Follow the assembly and safety instructions provided by the snow chain manufacturer. Do not slide the vehicle with the power turned oƯ. In such case, many systems (e.g. brake booster) cannot work. Driving in this way will pose a danger to yourself and others. Pedals To ensure that the pedal travel is unhampered, the ﬂoor mat in the pedal area shall not be excessively thick, and no article shall be placed in the pedal area. Night driving • Ensure all lights are working and windows are clean. • Drive more cautiously",
  "at night due to reduced visibility. • Maintain a speed where you can stop within the distance illuminated by your headlights. • Avoid using high beams unless necessary to prevent dazzling oncoming drivers. • Use indicators and headlights properly for turning and lane changes. S t a r t i n g y o u r E V 3-23 DRIVING YOUR EV NOTE If you've been driving in heavy rain for an extended period without braking, there might be a delay in the brakes' response when you ﬁrst apply them. You may need to press the brake pedal more ﬁrmly. Ensure you maintain a larger distance from the vehicle ahead. ! Driving on wet roads • Wet roads can lead to \"aquaplaning,\" where tires lose contact due to water buildup. This makes steering and braking diƯicult. • Slow down on wet roads to reduce the risk of aquaplaning. 3 Avoid leaving the vehicle in temperatures below -25°C for more than seven days. If the outside temperature drops to - 25°C or lower, the Li-ion battery may freeze, preventing it from charging or powering the vehicle. Move the vehicle to a warmer location to prevent this issue. CAUTION Driving on Highways: Avoid rapid changes in accelerator pedal inputs. Drive as smoothly as possible. EVs respond instantly to pedal inputs due to their immediate torque and power. The stopping distance increases progressively with vehicle speed, so maintain a safe distance from the vehicle ahead. For long-distance driving: Perform safety checks before starting your trip and take breaks at regular intervals to prevent fatigue. Driving in hot and cold weather: The vehicle's heating and cooling systems use energy from the battery. Set the temperature to a comfortable range of 24°C to 26°C with Auto mode and Econ activated to maximize both comfort and range. S t a r t i n g y o u r E V 3-24 DRIVING YOUR EV CAUTION When driving on long, steep gradients, it is important to lessen the strain on the brakes by releasing the accelerator pedal. This action utilizes regenerative braking to its advantage and prevents the service brakes from overheating, which could otherwise reduce their eƯectiveness. Driving on gradients: • When going downhill, ease oƯ the accelerator to reduce speed. Avoid shifting to neutral or turning oƯ the vehicle. EVs (Electric Vehicle) typically achieve their best range between speeds of 40 to 60 km/h, making them ideal for city driving. Staying within this speed range, along with following other driving tips, can signiﬁcantly increase your mileage. On highways, it's recommended to maintain a speed between 60 to 80 km/h to optimize range. Higher speeds can lead to a noticeable decrease in range. 3 Driver distraction Distractions can be deadly, especially for new drivers. Safety should always come ﬁrst. Avoid distractions like reaching for things, eating, grooming, passengers, and using phones. Taking your eyes oƯ the road or hands oƯ the wheel can lead to accidents. To stay safe: • Set up devices like phones",
  "and GPS when stopped. • Use your phone only when safe and legal. • Never let a device distract you from driving. Control your speed Speeding causes many injuries and deaths in accidents. Faster speeds mean more risk, but even slower speeds can be dangerous. Drive at a safe speed for the conditions, no matter the posted limit. Keep your vehicle safe Blown tires or mechanical failures are extremely dangerous. To avoid these problems: • Check tire pressure and condition often. • Keep up with regular maintenance. S t a r t i n g y o u r E V 3-25 DRIVING YOUR EV NOTE Always wear your seat belt Wearing your seat belt is crucial in any accident. Air bags are there to help, but they can't replace seat belts. Make sure you and your passengers always wear seat belts and wear them correctly. Restrain all children Children under 13 should sit in the back seat, not the front. Babies and small kids should be in a proper Child Restraint System. Older kids should use a booster seat with the lap and shoulder belt until they can use the seat belt alone. Air bag hazards Air bags save lives but can also hurt people who are too close or not properly restrained. Babies, small adults, and kids are most at risk. Follow all instructions and warnings in this manual. ! 3 Keys A key serves as the electronic access and authorization mechanism included as a standard feature in your vehicle. Every new vehicle is supplied with two keys; it's advisable to keep one as a spare. To ensure security, please store the key number plate safely to prevent unauthorized duplication. Note that various vehicle models may come with diƯerent types of keys, so please consult the speciﬁc details for your vehicle model. The eƯective distance of remote control is about 15m without shielding. Unlocking all doors Press the unlock button once to unlock all doors; the hazard warning lamp will ﬂash once, and anti-theft state is released. Locking all doors Press the lock button once to lock all doors after all doors are closed; the hazard warning lamp will ﬂash twice, and the vehicle is at anti-theft state. Smart key* NOTE If the smart key battery is low or drained, or if the vehicle battery is low or drained, users can unlock and enter the vehicle using the mechanical key blade located inside the smart key. ! Keep the smart key with you to enable passive access. It is used for locking, unlocking, and starting the vehicle. 1. Unlocking all doors 2. Locking all doors 3. Tail gate opening Tail gate opening Press the tailgate opening button for 3 sec to unlock the liftgate. OPENING & CLOSING S t a r t i n g y o u r E V 3-26 3 3-27 NOTE The functioning range of the remote control may be diƯerent due to environmental reasons. Radio interference signals and barriers will aƯect the remote",
  "control functions. ! Smart Key Precautions • If smart key is close to radio transmitter such as radio station or an airport which can interfere with normal operation of the transmitter. • If smart key is near a mobile two- way radio system or a cellular phone, then it will not work properly. • If another vehicle's smart key is being operated close to your vehicle, the signal will ﬂuctuate. NOTE Keep smart key away from electromagnetic materials that blocks electromagnetic waves to the key surface. ! Keyless Entry* Depending on the vehicle conﬁguration, some models are equipped with keyless entry function that the vehicle automatically unlocks when the key is close to it or locks when away from vehicle. Enabling this function allows the vehicle to automatically unlock when the key is within a range of about 1.3 meters. For some models, the door handles unfold automatically; if not, the handles need to be manually pressed to open. When the key is about 2.3 meters away from the vehicle, the vehicle automatically powers oƯ, locks, retracts the door handles, and raises the windows. The keyless entry switch can be turned on/oƯ in instrument panel settings under “Menu - Vehicle settings - Door & windows - Lock - Approach unlock & Tailgate open” S t a r t i n g y o u r E V OPENING & CLOSING 3 3-28 when approaching. When the key is close to the vehicle, the vehicle unlocks automatically; When the key is away from the vehicle, Lock automatically when away from the vehicle PEPS triggering conditions (all the following conditions are met simultaneously): • All doors close; • The locks on the driver's or front passenger's side provide feedback indicating whether they are unlocked. • The door handle micro switch is pressed; • No valid key inside the vehicle, and a valid key is found within the eƯective range outside the vehicle's Passive Entry (PE) area. Anti-theft / Device- Immobilizer / PEPS Immobilizer systems are designed to prevent vehicle theft by electronically disabling the vehicle's ignition system. The vehicle can only be started using the original immobilizer ignition key, which contains a programmed electronic identiﬁcation code. PEPS* PEPS triggering conditions (all of the following conditions are met simultaneously): • The vehicle speed is lower than 2km/h; • Both the driver's door lock feedback and the front passenger door lock feedback indicate a locked status; • The door handle micro switch is pressed; • A valid key is found within the eƯective Passive Loss of keys If one of the keys is lost, contact the JSW MG authorised service center immediately. S t a r t i n g y o u r E V OPENING & CLOSING 3 3-29 Do not leave the key in the vehicle. Take the key with you when you leave the vehicle. CAUTION NOTE If the key is lost, please contact JSW MG authorised service center. ! Never leave a child or pet unattended in the vehicle.",
  "Otherwise, it may cause injuries or death due to high temperature in the vehicle. Do not to leave valuables in the vehicle to prevent losses due to unforeseen circumstances. CAUTION The vehicle is equipped with a non- inductive key, which cannot be left in the vehicle for a long time. Vehicle locating* Press the remote lock button quickly twice to activate the vehicle locating function, the horn will sound 3 times, and the hazard warning lamp will ﬂash 20 times. Activation of door lock and CTD mode 1. Close all the windows. 2. All passengers leave the vehicle. 3. Close all doors, engine hood and l 4. Press the lock button on the smart key once, and the hazard warning lamp will ﬂash twice to lock all doors. Start the immobilizer system. NOTE The door lock system can also be activated when the window is open. Make sure to close all windows and doors before leaving the vehicle. The anti-theft mode must be activated with the remote control. ! S t a r t i n g y o u r E V WARNING ! • Do not turn 'ON' ignition switch by using key with any type of metal wound around its grip or in contact with it. This may be detected as abnormal condition by immobilizer and prevent vehicle from starting. • Do not leave the key in high temperature areas. The transponder in it will behave abnormally when reused. OPENING & CLOSING 3 3-30 Warning sound In the anti-theft state, if one door or the trunk is opened by force without the unlock button of the remote control key pressed (including opening the driver side door with the key), the hazard warning lamp will ﬂash and the horn will beep for a period of warning. To stop warning sound Press the lock and unlock buttons on the transmitter to stop the warning sound; if not, the warning sound will be ended automatically after 30s, and the anti-theft mode is activated again. If the system fails to do so, it is recommended to have the system checked at the JSW MG authorised service center. Deactivation of door lock and anti- theft mode Press the door unlock button on the remote control once. • All the doors will be unlocked (except the liftgate). • The hazard warning lamp ﬂashes once. • The anti-theft status is cleared. Lock function alarm The horn will buzz 3 times and the hazard warning lamp will ﬂash 3 times to indicate that the doors are not locked successfully if the remote lock button is pressed when the door lock conditions are not met. These situations include: 1. There is a door not closed (including liftgate); 2. The door lock is under thermal protection Never leave a child or pet unattended in the vehicle. Otherwise, it may cause injuries or death due to high temperature in the vehicle. CAUTION S t a r t i n g y o u r E V NOTE The",
  "anti-theft mode must be activated with the transmitter. ! DANGER Never leave a child or pet unattended in the vehicle. Otherwise, it may cause injuries or death due to high temperature in the vehicle. OPENING & CLOSING 3 3-31 Automatic locking of door* When all doors are closed and the vehicle speed exceeds 10 km/h, all doors will be locked automatically. Automatic re-locking* With the key not in the ignition switch, the vehicle will activate re- locking if the alarm is disarmed but no doors and liftgate are opened within 30s after the vehicle is under the armed state successfully. Automatic unlocking* If the door lock is engaged, when the vehicle is parked and shifted from D or R to the P gear position, the doors will be automatically unlocked. Remote controller Each transmitter has its own electronic code to prevent the doors from being opened by other transmitters. If the remote control is lost or stolen, please contact the JSW MG authorised service center to buy a new one as soon as possible. If you need to replace one or more remote controls, please bring with the existing remote control(s) when you go to the JSW MG authorised service center. When the JSW MG authorised service center matches the new remote control with your vehicle, the existing remote control shall also be matched with the new code. After the new remote control has a new electronic code, the lost remote control will not unlock your vehicle. Remote window control Press and hold unlock button for 3 seconds, the windows will roll down and blower starts functioning which helps in escape of hot air and let fresh air inside the vehicle. S t a r t i n g y o u r E V OPENING & CLOSING 3 3-32 S t a r t i n g y o u r E V Signal transmission autostop function of remote control The remote control has the signal transmission auto stop function which can prevent unnecessary battery loss caused by mis operation and other reasons. Long press any button on the remote control for over 10s, the remote control will stop transmitting signals automatically. And release the button, the signal transmission autostop function is deactivated. Fault If the remote control cannot function normally, it may be caused by the following reasons: • Out of remote control working range; • Excessively low SOC of remote control battery; • Interference by external environment and other high- power radio signals (such as base station and launch tower); • Signal blocking by other barriers. OPENING & CLOSING Replace the battery Inside the key remote control, there is a lithium battery whose service life is 2 years generally. When the remote control distance is shortened gradually (must be closer to the vehicle to remotely control), it indicates a low battery. The key battery cannot be charged. After the battery runs out, please reach out the JSW MG authorised service center to have the battery changed or",
  "follow these steps to change the battery: 1. Remove the mechanical key by pressing the release button. 2. Use a slim tool to pry open the rear cover of the smart key. 3. Remove the old battery and insert the new battery (CR2032). Make sure the battery position is correct. 4. Reinstall the rear cover of the smart key. 3 3-32 S t a r t i n g y o u r E V OPENING & CLOSING NOTE To ensure normal functioning of the remote-control key, please follow the following rules: • Avoid dropping the remote- control key. • Please do not place a heavy object on the remote-control key. • Make sure the remote-control key is away from water or direct sunlight. If the remote-control key is socked, please wipe it with a soft cloth. ! DOORS Open the door To open doors from inside or outside, unlock the doors ﬁrst, and pull the external or internal door handles NOTE When you leave the vehicle unattended, you must lock all doors and take the key with you. The vehicle may be stolen if the door is not locked. ! 3 3-33 Door locking / unlocking from outside using key 1. Unlocking 2. Locking As shown in the above image, to unlock the car door with a key, for example, if the remote key is lost or out of power, press down on the left side of the door handle to expose the keyhole. The keyhole on the left front door handle is hidden under the handle and becomes visible when the handle is opened. When to S t a r t i n g y o u r E V OPENING & CLOSING lock/unlock the car door from the outside using a key, insert the key into the lock hole as shown in the image above to unlock/lock the car door. Unlocking the door from inside the vehicle To unlock the door from inside the vehicle, pull the interior door handle once for unlocking, and pull it again to open the door. Pull it once to open the door if the door is unlocked. 3 3-34 1. Locking 2. Unlocking To lock the door from inside the vehicle, press 1 (the lock button) to lock the vehicle. The exterior door handle is hidden, and the door cannot be opened from the outside. To unlock the door, pull the interior handle twice. The ﬁrst pull unlocks the door on the respective side, and the second pull opens the door. The exterior door handle on the respective side unfolds. Press 2 (the unlock button) to unlock the vehicle. Outside the door, the door handle unfolds. NOTE If there is noise while opening/ closing doors or driving, apply lubricating grease on the door catches and hinges. ! Do not leave your child or pet alone in the vehicle. Otherwise, severe casualty will be caused. The child may operate power windows or other control buttons or even drive the vehicle. Do not",
  "leave the child with a key in the vehicle. Such behaviors may cause severe casualties CAUTION S t a r t i n g y o u r E V Lock/unlock the door inside the vehicle OPENING & CLOSING 3 3-35 not a child safety door lock. Turn the knob with the key according to the arrow mark here, and then close the door. At last, pull the external handle to ensure that the doors are locked. For the left front door, please plug the key in the door outer handle and rotate the key clockwise to lock the door. Please refer to \"Mechanical Lock on Left Front Door\". Child safety door lock The rear doors are equipped with child safety locks. The function of the child safety lock is to prevent passengers (especially children) from pulling the door handle and accidentally opening the rear door. S t a r t i n g y o u r E V Rear door opening Door opening handle is provided on the side of the window. To unlock the door from inside the vehicle, pull the interior door handle once for unlocking, and pull it again to open the door. Pull it once to open the door if the door is unlocked. Door locking method when vehicle is powered oƯ In case of vehicle outage (for example, the battery is out of power or its positive and negative poles are disconnected), the central control door lock system does not function, and you need to lock side doors manually one by one. Open the front right door and the rear two doors, and ﬁnd the knob inside the door lock (as shown in the ﬁgure above). Note that the knob is 1. Locking 2. Unlocking To activate the child safety lock: OPENING & CLOSING 3 3-36 NOTE When the child safety door lock is set at LOCKING, do not attempt to pull the internal door handle to open the door. Otherwise, the door handle will be damaged. Please open the door with the external door handle. ! DANGER Do not leave your child or pet alone in the vehicle. Otherwise, it may result in severe casualties. Children may operate power windows or other control buttons or even drive the vehicle, causing severe casualty. Central door lock system* With the central door lock system, you can not only use the remote control to lock and unlock the door, but also unlock and lock the door with the door lock button on the driver's side door. S t a r t i n g y o u r E V 1. Open the rear door that you want to lock. 2. Find the child safety door groove knob on the door edge and near the middle position. 3. Insert the key into the slot and rotate it in the direction indicated by the arrow. NOTE The two rear doors are equipped with a child safety lock respectively. They work separately and must be activated manually",
  "and respectively. ! When the child safety door lock is enabled, it cannot be opened from inside the vehicle. The door can only be opened by pulling the outer handle of the door from outside the vehicle. To cancel the child safety door lock, insert the key into the slot and rotate it in the opposite direction. OPENING & CLOSING 3 3-37 key to a certain area (within about 1.2 m) away from the liftgate, and press the liftgate release switch to certify the system and the key. After successful authentication, the liftgate is unlocked. If the door is unlocked, the liftgate can be opened directly (unnecessary to carry the key to get close to the liftgate). Passive lock* When the liftgate is to be locked passively, the system will search whether there is a legal key in the vehicle. If there is no legal key in the vehicle, the system will automatically lock the liftgate. The hazard warning lamp ﬂashes twice. If there is a key in the vehicle, the system will give an alarm prompt, the horn will sound 3 times, the hazard warning lamp will ﬂash 3 times, and the door will be unlocked automatically. Please take away the key in the vehicle, and lock the doors again. If the doors are unlocked, the liftgate can only be locked after closing the liftgate and locking the doors. Please remember to lock the doors. S t a r t i n g y o u r E V Tailgate opening with tailgate switch Unlock the vehicle, press the liftgate switch and open it. For a vehicle equipped with Passive Entry Passive Start (PEPS), you can carry the remote control key directly to approach the tailgate and press the switch to open the tailgate. Tailgate opening with remote key* Press the remote control key Tailgate Opening button for about 3s to unlock the tailgate. To lock the liftgate, you need to close it and then lock it. Passive unlock/lock of tailgate* passive unlock* When the doors are locked and the vehicle is powered oƯ, carry a legal Tailgate OPENING & CLOSING 3 3-38 Liftgate lock maintenance hole 1. Side trim cover 2. Groove If other liftgate opening methods are invalid, the liftgate can be opened temporarily as per the following steps: 1. Adjust the seat and enter the trunk. 2. Open the trim cover outside the liftgate lock. 3. Insert a suitable tool (e.g., a straight screwdriver) into the groove and turn clockwise to unlock the liftgate. S t a r t i n g y o u r E V WARNING ! Make sure that the human body away from the tailgate when opening the tailgate. When closing the tailgate, make sure that hands and other parts of the human body are completely outside the closing area of the tailgate to avoid personal injury when the tailgate is opened or closed. Before driving, please make sure that the tailgate is closed and locked. When leaving the vehicle, please",
  "make sure that the tailgate is closed and locked, and the vehicle is locked. CAUTION OPENING & CLOSING 3 3-39 To activate this function, set in instrument panel under Door & Window > Door Lock > Open \"Keyless Entry\" switch. When the key is close to the tailgate, the tailgate will automatically. Tailgate open* Depending on the vehicle conﬁguration, some models are equipped with this function, as shown in the image. This function can be operated in instrument panel under Door & “Menu - Vehicle settings - Doors and windows - Tailgate - ON”. Clicking \"Tailgate ON” unlocks the tailgate and opens it automatically. Maximum tailgate opening setting* According to the vehicle conﬁguration, some vehicle models come with a feature that allows setting of the maximum tailgate opening, as shown in the image. This function can be adjusted in instrument panel under “Menu - Vehicle settings - Door and windows - Tailgate - maximum opening setting. You can set the tailgate opening degree to choose from 50% to 100% (50% / 60% / 70% / 80% / 90% / 100%). S t a r t i n g y o u r E V Power tailgate switch* Depending on the vehicle conﬁguration, some models are equipped with an electric tailgate switch. As shown in the image, press the electric tailgate switch, and the tailgate will automatically close. Proximity-triggered automatic opening* Depending on the vehicle conﬁguration, some vehicle models come with a feature that automatically opens or closes the tailgate when the key is near it. This is done through a proximity- activated electric tailgate switch. This function can be set in instrument panel under “Menu - Vehicle settings - Doors and windows - Lock - approach unlock”. OPENING & CLOSING 3 3-40 3. Separate the cowl hood prop rod from the ﬁxing clip. Plug the free end of the prop rod in the slot Close the hood 1. Support the engine hood to prevent it from closing, and take the prop rod out from the slot. Then, ﬁx the rod in the ﬁxing clamp. 2. Make sure that your or other persons' hands or other body parts are away from the engine compartment, cowl hood and vehicle body edges. 3. Slowly drop the cowl hood, and release it when the cowl hood front edge is about 30 cm vertically from the top cross member of the water tank to let it fall freely. S t a r t i n g y o u r E V Engine hood Open the hood 1. Pull the hood release handle on the left lower side of the instrument panel once 2. After the hood is opened, stretch your hand to the lower side of its front edge. Pull the hood release handle rightward as shown in the ﬁgure to open the hood completely. OPENING & CLOSING 3 3-41 Exterior rearview mirror NOTE Please check the visual ﬁeld of all rearview mirrors before driving. ! Adjustment of outside rearview mirror Option 1 :",
  "Manual adjustment Press the edge of the mirror by hand to an appropriate view angle. Option 2 : Motorized ORVM adjustment You can adjust the position of the exterior mirrors in instrument panel settings under “Menu - Vehicle setting - Door and windows - Rear side mirror - adjust. Additionally, manual adjustment can be done on S t a r t i n g y o u r E V Check that the engine hood is locked before driving the vehicle. Do not pull the engine hood release handle when the vehicle is moving. Do not drive the vehicle when the front engine hood is open. CAUTION Charging ﬂap opening As shown in the ﬁgure, press the right side of the charging port cap, and it will open automatically. 4. Always check and conﬁrm that the cowl hood is locked in place. OPENING & CLOSING Mirror 3 3-42 Folding of ORVM Option 1 : Automatic-folding while locked You can enable or disable the automatic folding of the exterior mirrors when locking the vehicle in instrument panel settings under “Menu - Vehicle setting - Door and windows - Rear side mirror - side mirror auto fold” Lock Auto Fold Rearview Mirrors. When this feature is enabled, the exterior rearview mirrors will automatically fold when remotely locking the vehicle. It will be unfolded automatically when unlocked by remote control. Option 2 : Rearview mirror folding You can enable or disable the exterior mirror folding feature in instrument panel settings under “Menu - Vehicle setting - Door and windows - Rear side mirror - side mirror unfold”. When this feature is enabled, the mirrors fold; when disabled, the mirrors unfold. Option 3 : Manual folding To ensure the pedestrian's safety, the outside rearview mirror can be folded forward or backward from its normal mounting position under suƯicient impact force. It can be moved and reset manually. S t a r t i n g y o u r E V the left side of the steering wheel. When cruise control/adaptive cruise control is not engaged, press the scroll wheel to toggle between left mirror adjustment mode, right rearview mirror adjustment mode, and A/C control mode in a loop. Left rearview mirror adjustment mode: Press and hold the left and right keys in the left mode area and toggle the scroll wheel to adjust the position of the left rearview mirror. It supports long press to adjust. Restore the A/C control mode without operation within 10s after adjustment. Right rearview mirror adjustment mode: Press and hold the left and right keys in the left mode area and toggle the scroll wheel to adjust the position of the right rearview mirror. It supports long press to adjust. Restore the A/C control mode without operation within 10s after adjustment. OPENING & CLOSING 3 3-43 Inside rearview mirror Adjust the rearview mirror to an appropriate angle manually. The interior rearview mirror has an anti- dazzling function, which can reduce the dazzling eƯect from vehicles behind at night.",
  "Turn the switch at the rearview mirror bottom forward to activate the anti-dazzling mode. Please remember to turn the switchback at day time. S t a r t i n g y o u r E V Precautions for icing of electric folding outside rearview mirror* In frosty weather, if the outside rearview mirror and its spindle are frozen, please remove the freeze ﬁrst, and use the electric folding/unfolding functions. For example, if the mirror is frozen after the vehicle is parked outdoors for a night in winter, please remove the freeze ﬁrst, and use the remote control or the passive entry button to unlock doors. Then, the outside rearview mirror will be unfolded smoothly. If the freeze is not removed, it will hinder the movement of the rearview mirror, damaging the mirror. If the outside rearview mirror glass is frozen, please remove the freeze ﬁrst, and then use the defrosting function for auxiliary heating and deicing. If the freeze is not removed, the freeze will hinder the movement of the mirror while adjusting the mirror, causing damage to the mirror. OPENING & CLOSING 3 3-43 Automatic anti-dazzle interior rearview mirror * When the START/STOP switch is in position ON/RUNNING, the automatic anti-sazzle function is switched on automatically. When a following vehicle’s headlamps could dazzle the driver, the light sensor activates the anti-dazzle function. The automatic anti-dazzle function can be inhibited if: • The light from the vehicle is not seen by the light sensor on the mirror. • Reverse gear is selected. NOTE The anti-dazzling mode will reduce the vision clarity behind the vehicle. Please drive carefully. ! S t a r t i n g y o u r E V OPENING & CLOSING The interior rearview mirror is equipped with a USB port, so that your vehicle data recorder can be powered during installation. 3 3-44 Vanity mirror NOTE Close the vanity mirror cover securely and return the sunvisor to its original position after use. ! To use the vanity mirror, pull down the sunvisor and slide the mirror cover to open. Vanity light will glow on sliding the mirror cover and goes oƯ when sliding back. S t a r t i n g y o u r E V Sun visor Your vehicle is conﬁgured with sun visors which can reduce dazzling eƯect on the driver and passengers. The sun visors can move upward, downward and sideward. • To use the sunvisor pull it downward. • To use the sunvisor to block the sun from the side window, pull it downward, release it from the bracket and swing it to the side; towards the window. The sun visors may be equipped with a vanity mirror, a vanity mirror trim cover, a bill folder, etc. according to the vehicle conﬁguration. OPENING & CLOSING 3 3-45 • Children may operate the power window and may get stuck by the window when they operate it. Do not leave a key or an unattended child in the vehicle. Misoperation",
  "of the power window may cause casualities. • Children may climb out of the vehicle window, resulting in serious injury or death. Therefore, no child is allowed to operate the window regulator switch or lean over the window. CAUTION S t a r t i n g y o u r E V Windows Power window The glass lift switch is located on the front door armrest panel. The left and right switches control the left and right window glass, respectively. To raise the window, pull upward the switch. To lower the window, press the switch down. Release the switch when the window has reached the required position. OPENING & CLOSING 3 3-46 S t a r t i n g y o u r E V Individual switches Individual switch has been provided on all doors. To close the glass pull the switch in upward direction. To open the glass press the switch in downward direction. NOTE Power windows can be operated for 30 seconds in 'IGN OFF' and 'KEY OUT' positions, provided the doors are closed. ! Automatic window closing upon vehicle locking The automatic window closing can be enabled/disabled in instrument panel “Menu - Vehicle setting - Door and windows - Window - close windows when door locked”. After enabling the auto window closing upon locking, long-pressing the unlock button will open the windows. One-button lowering of driver's side power window* The power window has the one- button lowering function. Press the switch to the bottom (2nd gear) and release, and the window will be lowered to the fully-open position automatically. To stop lowering the window, pull upward the button and release (short press is ok). One- button Lowering of Driver's and Front Passenger's Side Power Windows. One-button rising of four-door power window* One-button ascending is available in power window. To close the window, pull upward the switch to the top (2nd gear) and release, and the window will be raised automatically to the fully-close position. To stop OPENING & CLOSING 3 3-47 learning, it is recommended to drive to the JSW MG authorised service center for check and repair. Window motor thermal protection* Window motor thermal protection is a protection function of preventing the window regulator motor from overheating due to long-time use. The motor will not work or the working frequency will be reduced to prevent the motor from being damaged when the motor reaches the preset temperature limit. Please do not continuously and frequently lift the window. Window child safety lock The window child lock function can be enabled/disabled in instrument panel “Menu - Vehicle setting - Door and windows - Window - Window child lock”. In such case, the window can only be operated on driver's side. S t a r t i n g y o u r E V raising the window, press down the button and release (short press is ok). One-button Rising of Driver's and Front Passenger's Side Power Windows. Anti-pinch function of power window* The power window that",
  "has the one- button rising function also has the anti-pinch function to reduce pinching injuries. The power window will be lowered automatically for a certain distance in case of any obstruction in its one-button rising process. Initialization learning of power window* The driver's side window may lose the one - button rising and lowering functions in some cases, such as battery connection after disconnection. In such cases, the window initialization learning shall be conducted ﬁrst. First, pull upward the driver's side switch till the window glass is closed completely, and continue to pull upward the switch for at least 5s and release it. Now the initialization learning is completed. If the one-button rising or lowering function is still OPENING & CLOSING 3 3-48 S t a r t i n g y o u r E V Assist armrest On the front passenger side and above the rear seat are installed the folding auxiliary armrests. The assist armrest can provide easy access for you and your passengers. Passengers can also hold onto the armrest to maintain a comfortable position at a high speed. Roof When the vehicle is in high- voltage/READY state, you can operate the electric sunroof on instrument panel. Power sunroof sunshade* Sunroof shade The panoramic sunshade can be operated in instrument panel under Door & Window > Sunshade. 1. Press \"All Close\", the panoramic sunshade closes, and the degree of closure is 0%. 2. Press \"All Open\", the panoramic sunshade opens, and the degree of opening is 100%. 3. Slide to adjust: the opening degree ranges from 0% to 100%. Initialization learning of sunroof sunshade The sunroof may lose its one-button opening or closing function in some cases, such as the replacement of sunroof glass or motor. In such cases, the sunroof initialization learning shall be conducted ﬁrst. In the state where the sunroof is completely closed, set instrument OPENING & CLOSING 3 3-49 OPENING & CLOSING S t a r t i n g y o u r E V panel settings under “Menu - Vehicle setting - Maintenance - Sunshade initialization” and click on Sunshade Initialization, the sunshade will shake slightly, indicating the completion of the initialization learning process. If the one button opening or closing function is still unavailable after initialization learning, it is recommended to drive to the JSW MG authorised service center for check and repair. S t a r t i n g y o u r E V DRIVING & CONTROLS 3 Vehicle control Do not slide the vehicle with the power turned oƯ. In such case, many systems (e.g. brake booster) cannot work. Driving in this way will pose a danger to yourself and others. Pedals To ensure that the pedal travel is unhampered, the ﬂoor mat in the pedal area shall not be excessively thick, and no article shall be placed in the pedal area. Emergency measures If one tire is punctured when the vehicle is running, the driver shall hold the steering wheel tightly to control the",
  "driving direction, slowly decelerate, turn on the hazard ﬂasher, and gently depress the brake pedal to park the vehicle in a safe area. WARNING ! Do not brake suddenly when one tire is punctured. Braking suddenly will cause the vehicle to tilt towards one side, and thus an accident may be caused. S t a r t i n g y o u r E V 3-51 One fault exists When the vehicle is running if one fault exists when the vehicle is running, the driver shall turn on the hazard warning ﬂasher, slowly decelerate, and park the vehicle in a safe area at the curb. Place a warning triangle at a position 50 m behind the vehicle in the daytime while placing it at a position 100 m behind the vehicle at night. Please follow traƯic laws and regulations. After inspection, send the vehicle to the JSW MG authorised service center for inspection and maintenance. The warning triangle is placed under the second row of seats or handed over to you by a salesperson when the vehicle is delivered. Operation in heavy snow • Decelerate when the vehicle turns a corner, runs uphill or crosses a bridge. • Please avoid parking on the hard shoulders as this can hinder snow clearance. • Please keep safe distance from other vehicles; braking unnecessarily will be limited. S t a r t i n g y o u r E V 3 3-52 DRIVING & CONTROLS WARNING ! Wading is only necessary for emergency situations. Do not wade Vehicle Event Data Recorder (EDR) System Your vehicle is equipped with the Event Data Recorder (EDR). It can automatically record information about the vehicle's operation and safety system status for a period of time (Data about 5 seconds before the accident and data about 150 milliseconds after the accident) before and after a speciﬁc event such as a vehicle collision. The system can eƯectively solve the diƯiculties to determine the cause of accidents and to identify the responsibility of accidents, provide eƯective support for the road traƯic accidents, ensure the fairness and justice of accident processing, and help create a good and orderly road traƯic environment except in an emergency. If water enters the air cleaner, the engine will be damaged. • Frequent cleaning of snow around the vehicle can prevent diƯiculty in starting the vehicle. Wading In case of emergency, passenger cars, new energy vehicles and HEVs can pass through the accumulated water with a maximum depth of 200 mm at a speed no more than 10km/h; trucks and SUVs can pass through the accumulated water with a maximum depth of 300 mm at a speed no more than 10 km/h. The drive shall be more careful in ﬂowing water. When wading, the vehicle shall be kept at a low speed and shall not be stopped. After wading, check whether the brake, horn, vehicle lighting, and power steering of the steering wheel function well as soon as possible. Vehicle event data recorder (EDR)",
  "system Your vehicle is equipped with the Event Data Recorder (EDR). It can automatically record information about the vehicle's operation and safety system status for a period of time (Data about 5 seconds before the accident and data about 150 milliseconds after the accident) before and after a speciﬁc event such as a vehicle collision. The system can eƯectively solve the diƯiculties to determine the cause of accidents and to identify the responsibility of accidents, provide eƯective support for the road traƯic accidents, ensure the fairness and justice of accident processing, and help create a good and orderly road traƯic environment. S t a r t i n g y o u r E V 3 3-53 DRIVING & CONTROLS Cruise control system ①: Cruise control on/oƯ: press the steering button. ②: Scroll up: Increase cruise target speed. ③: Scroll down: Decrease cruise target speed. ④: Cruise on: Shift lever \"④\" down twice. 1 2 3 4 CAUTION In principle, the cruise control system should be used on expressways or totally- closed roads. It is not allowed to use the cruise control system in rainy, icy and snowy weather, and on hillside roads or densely- crooked roads. Avoid using cruise control on rough roads or heavily traƯicked routes. S t a r t i n g y o u r E V When the cruise control system is activated, the vehicle will maintain the set speed. Depress the brake pedal, and the function will be immediately canceled. You can also cancel the cruise control by using the parking brake or by exiting the cruise mode. The system is enabled when the vehicle speed is between 40 km/h and 130 km/h. 3 Step 1: Start cruise When the vehicle is in REARY state, press the \" ① \" button or shift to Drive (D) by moving the shift lever \"④\" down twice. The cruise indicator on the instrument cluster will ﬂash, indicating that the cruise control 3-54 DRIVING & CONTROLS system is in standby mode. Pressing \"②\" or \"③” will activate the cruise control, and the cruise indicator on the instrument cluster will remain lit, displaying the cruise target speed. (For example, if the driver wishes to set the vehicle speed to 100 km/h, they must ﬁrst bring the vehicle's speed within the range of 40 km/h to 130 km/h. Press the \"①\" button or shift the shift lever \"④\" down twice, then press \"② \" or \"③ \". Release the accelerator pedal, and the vehicle will accelerate to and maintain a a speed of 100 km/h.) After setting the cruise speed, the driver can still use the accelerator pedal to accelerate the vehicle in the usual way. Within a certain period of time and when the vehicle speed does not exceed the target value of cruise control by 20 km/h, the system will restore the vehicle speed to the originally set cruise speed after the driver release the accelerator pedal. NOTE Cruise control can only be activated when the vehicle",
  "is in a forward gear, the driver's seat belt is fastened, the brake pedal is not pressed, and the vehicle speed is within the rated value. The maximum speed in ECO mode + cruise control is 80km/h ! 3 S t a r t i n g y o u r E V Step 2: How to cancel cruise mode If there's an emergency ahead during cruise control and you need to slow down quickly, press the brake pedal or shift the gear selector up two gears to exit cruise mode. The cruise indicator will ﬂash, indicating standby mode. To completely exit cruise control, press button \"①\" and the cruise control indicator will turn oƯ. Step 3: Resume cruise mode When the vehicle exits cruise mode and enters standby mode, press \"②\" to resume cruise control at the last set speed. For instance, if the vehicle was cruising at 60 km/h, then slowed to 50 km/h after braking, the cruise indicator ﬂashes. Press \"②\" to restore the cruise indicator to 3-55 DRIVING & CONTROLS normal, and the vehicle will automatically accelerate back to 60 km/h and resume cruise control. Step 4: How to promote cruise control speed You can increase the cruise speed by pressing \"②\" instead of using the accelerator pedal. Each time the button is pressed, the vehicle speed will increase by 5 km/h. Long press ② to continuously increase the vehicle speed by 1 km/h. Once the button is released, the current driving speed will be stored in the memory and the vehicle will maintain the speed. Step 5: How to reduce cruise control speed Press ③ to decrease the cruise speed. Each time the button is pressed, the vehicle speed is decreased by 5 km/h; Holding the button down decreases the speed continuously by 1 km/h.; once the button is released, the current driving speed is stored in the memory and the vehicle cruises at this speed. Parking When parking on a ramp, press the brake pedal and apply electronic parking brake. On an uphill slope, turn the front wheels away from the road shoulder. On a downhill slope, turn the front wheels towards the road shoulder. CAUTION Avoid parking or driving over ﬂammable materials like straw and hay. If you must pass over them, park the vehicle afterward to ensure these materials are not stuck to the chassis. High- temperature parts on the chassis could ignite these materials, potentially causing a ﬁre accident. S t a r t i n g y o u r E V 3 3-56 DRIVING & CONTROLS Creeping Crawl mode allows the car to move slowly in D or R gear without pressing the accelerator or brake pedal, and with the EPB released. It maintains a low speed until reaching a maximum limit (7 km/h for D gear, 6 km/h for R gear). The maximum crawling speed h can vary based on terrain and load etc. CAUTION 1. When leaving the seat, engage the electronic parking brake or shift to",
  "P/N for vehicles with creep function. 2. Ensure the EPB is fully released when using the creep function. 3. Creep function activation requires the driver's side door to be closed, seat belt fastened, and automatic parking function turned oƯ. 4. Use the creep function only for driving assistance, not for staying on slopes, as there's a risk of slipping. 5. On snowy or icy roads, the creep function may not maintain a constant low speed. Drive cautiously in such conditions. 6. Creep function cannot be used when the intelligent driving assistance function is active. Electronic shifter Follow the markings on the lever when shifting. You can only drive in gear when the vehicle is in the READY state. Before selecting \"D\" or \"R\" gear, press the brake pedal; otherwise, you cannot engage the gear. Press the brake pedal, select the Drive (D) mode for forward motion or Reverse (R) mode for backward motion, then move the electronic shift lever upward to shift to the Reverse (R) mode. Move the electronic shift lever downward to shift to the Drive (D) mode. As shown in the ﬁgure, press the gearshift button to shift to P position (parking). Please apply the EPB when parking. Release the EPB before driving. The current gear (P, R, N, D) is displayed on the instrument cluster S t a r t i n g y o u r E V P: Park R: Reversing N: Neutral D: drive gear Driving mode adjustment: Economic + mode/Economic mode/ Standard mode/Sports mode The economy mode+, economy mode, standard mode and sport mode can be switched in \"Settings- Vehicle-Driving- Driving Mode\" of instrument panel. NOTE Do not allow children to operate the gearshift knob to avoid accidental start of the vehicle. ! NOTE When the gear is in R, turning the gearshift knob left returns the gear position to N. When the gear is in D, turning the knob right keeps the gear position in D. ! NOTE When switching between D gear or R gear, press the brake pedal to ensure the vehicle speed is less than 3 km/h. Otherwise, the gear cannot be engaged. ! 3 3-58 DRIVING & CONTROLS Instrument & controls l Overview Control device l Wireless charging Instrument cluster l Instrument cluster l Driving mode Lighting l Exterior lighting l Interior lighting l Interior ambient lamp* Temperature control system l Air outlet l A/c Interior Features 4 I n t e r i o r F e a t u r e s 4 Instrument Panel 1. Side air outlet 2. Glove box switch 3. USB interface 4. Defrost air outlet for front 5. Cup holder button/instrument cluster button 6. Defrost air outlet for front* 7. Windshield air outlet 8. Central air outlet 9. Infotainment & vehicle control screen 10. Audio system control key/Cruise control key*/Advanced 11. Shift lever 12. Instrument cluster 13. Voice control button/audio system control 14. Vehicle lamps, turn signal lamps and wiper 15. Defrost air outlet for front 16. Side air outlet",
  "17. Airbag - driver/horn switch 18. Electronic parking brake switch 19. Emergency power-oƯ switch 20. Cowl hood release handle 21. Accelerator pedal 22. Brake pedal 23. AC temperature control button 24. Air recirculation mode button 25. Rear defroster button 26. Front windshield defroster button 27. Hazard warning lamp 28. Auto AC button 29. AC on/oƯ button 30. Driving mode button 31. Fan speed control button 32. Cup holder 33. USB Interface 34. Rear console air outlet 35. 12V on-board power supply 36. Key induction area INSTRUMENT & CONTROLS 4-1 I n t e r i o r F e a t u r e s 4 Emergency power-oƯ switch* • If the vehicle is moving slower than 2 km/h, pressing this switch will immediately turn oƯ the power. • If the vehicle is moving at 2 km/h or faster, you can turn oƯ the power by either holding the switch for 5 seconds or pressing it three times in two seconds. • In an emergency, you can restart this function, but only if certain conditions are met (details on these conditions are typically in the vehicle's manual). • PEPS System Active: The Passive Entry and Push Start system must be working. • Brake Switch: The brake switch must be functional. • Speed: The vehicle must be moving slower than 2 km/h. Emergency power-oƯ: Activating this will cut oƯ power immediately. Only use it in emergencies. Hazard lights: Turn on and keep your hazard lights on before using the emergency power-oƯ. Vehicle position: Safely move the vehicle to the roadside or an emergency lane where it won't disrupt traƯic before using the emergency power-oƯ. Warning triangle: After parking, place a warning triangle 50-100 meters behind your vehicle. On an expressway, place it 150 meters away. CAUTION 4-2 • Driver's seat: Either the driver's seatbelt must be fastened or the driver's gravity sensor must be active. • Key: The key or Bluetooth key must be inside the vehicle and working. • Brake pedal / door: You must press the brake pedal or open the door. INSTRUMENT & CONTROLS I n t e r i o r F e a t u r e s 4 4-3 In an emergency Turn on the hazard lights, Park the car, Wear the reﬂective vest provided, Place a warning triangle as per local traƯic rules, Move to a safe area, Contact the appropriate authorities or services. After parking: Place the warning triangle, then quickly move the driver and passengers to the right shoulder or emergency lane. Contact the JSW MG authorised service center for assistance. On the expressway, follow regulations if you need to call the police. Restarting the vehicle: If the danger is resolved or the power-oƯ was accidental, you can restart the vehicle. Before doing so, check the vehicle and surroundings to make sure the emergency is over. CAUTION Press the center of the steering wheel to sound the horn. Control device Horn Tilt/telescopic adjustment: 1. Tilt adjustment: Adjust the steering wheel angle so",
  "it points toward your chest, not your face. Steering wheel adjustment INSTRUMENT & CONTROLS I n t e r i o r F e a t u r e s 4 2. Telescopic adjustment: Slide the steering wheel in or out to a comfortable distance. Steps: 1. Pull out the adjustment lever. 2. Adjust the steering wheel to your desired angle and distance. 3. Push the lever back in to lock the steering wheel. 4. Ensure the steering wheel is securely locked in position before driving. Adjusting the steering wheel: Only adjust the steering wheel when the vehicle is fully stopped. You can adjust its angle with these steps: 1. Pull out the steering wheel adjustment lever. 2. Adjust the steering wheel to your preferred position. 3. Push the lever back in to lock the steering wheel. 4. Ensure the steering wheel is securely locked. 4-5 CONTROL DEVICE The driver must maintain full control of the steering wheel while driving. Do not adjust the steering wheel while the vehicle is moving, as it can cause loss of control. DANGER To use the front windshield wiper: 1. Turn on the power switch. 2. Push the windshield wiper/ washer control lever. The front windshield wiper has these 5 positions: • OFF: Wipers are turned oƯ. • AUTO: Wipers automatically adjust speed based on rainfall. • LO: Wipes continuously at low speed. OFF MIST AUTO HI LO Front windshield wiper I n t e r i o r F e a t u r e s 4 Wiper sensitivity adjustment: 1. Access settings: Go to the car's infotainment system. 2. Navigate: Select Vehicle > Doors/ Windows > Wipers > Wiper Sensitivity. 3. Adjust sensitivity: Choose from 7 levels (1 to 7) to set the sensitivity for automatic wiper operation. The starting position adjustment only adjusts the threshold for automatic wiper activation. The higher the position, the easier it is to initiate wiping, resulting in a more sensitive detection for light rain. This adjustment only aƯects when the automatic wipers turn on, not their speed. The wiper speed adjusts automatically based on rainfall without manual input. 4-6 NOTE Even if the wiper switch is set to \"AUTO,\" the driver should still manually control the wipers to maintain a clear view. ! CONTROL DEVICE • HI: Wipes continuously at high speed. • MIST: Push the lever up once to wipe the windshield once. When the lever is pushed down one gear from the OFF position to the AUTO operating position, the inductive automatic wiper will function. Depending on the rainfall, the front wiper will automatically turns on or oƯ and the wiping speed can be automatically adjusted when it is turned on. I n t e r i o r F e a t u r e s 4 4-6 Front windshield washer To spray cleaning ﬂuid on the front windshield: 1. Ensure the vehicle is in the HV/READY state. 2. Press the button to spray water onto the front windshield. 3. The spraying stops",
  "when you release the button. 4. If you pull the control lever for more than 1 second, the wipers will run for 3 cycles at low speed before stopping. Blurred view: A blurred view can cause accidents and damage. Ensure your windshield is clear to avoid personal injuries and property damage. In cold weather: If the wipers are frozen, spray warm water to deice them, then wipe oƯ the water immediately to prevent refreezing. CAUTION CONTROL DEVICE Reﬁlling washer ﬂuid 1. Open the engine hood cover 2. Open the washer ﬂuid reservior cap 3. Reﬁll the washer ﬂuid to the maximum level I n t e r i o r F e a t u r e s 4 4-7 NOTE Avoid dry glass: Do not use the wipers on dry glass, as this can damage the blade. Limit washer use: Do not operate the windshield washer for more than 10 seconds at a time, and avoid using it if the washer ﬂuid reservoir is empty. Overuse or running the washer dry can overheat the motor and lead to costly repairs. ! Instrument panel USB interface A USB port under the central control panel can charge phones and connect data cables. The charging power supply can be used when the vehicle is in the READY/HV state. Console rear USB interface The USB interface is positioned behind the console and provides charging power for rear passenger. The charging power supply can be used when the vehicle is in the READY/HV state. CONTROL DEVICE I n t e r i o r F e a t u r e s 4 On-board power interface A 12V/120W power socket is located in the front armrest box. It only works when the vehicle is in the READY/HV state. 4-8 Dashcam USB interface Your vehicle is equipped with a USB interface of the vehicle traveling data recorder, which is located on the back of the interior rearview mirror to facilitate the power supply of the vehicle traveling data recorder. CONTROL DEVICE 12V/120W 12V/120W I n t e r i o r F e a t u r e s 4 Wireless charging The wireless charging function for a mobile phone is realized without the necessity for a connection cable. It is achieved using electromagnetic induction. Wireless charging system for mobile phones * 4-9 NOTE The wireless charging function does not apply to all mobile phones, only brands/models with wireless charging function. Wireless Charger in the car can be used to charge Qi certiﬁed mobile phones wirelessly. Mobile phone (Receiver) controls the power transfer from the Wireless charger in the Car (Transmitter). So, Charging rate of the phone will vary based on type/brand of phone used. ! NOTE The wireless charging function does not apply to all mobile phones, only brands/models with wireless charging function. For using a mobile phone without wireless charging function, need to use Qi certiﬁed accessories/ adapter. ! CONTROL DEVICE I n t e r i o r F e a t",
  "u r e s 4 The wireless charging area is located in the area shown in the ﬁgure. The charging function is enabled when the START/STOP Switch is placed in the ACC/ON/READY positions. Place the phone face up horizontally in the charging area, which can be used for wireless charging. Wireless charging of mobile phones Ensure that phone is kept properly on the charging pad. There is possibility of inadequate charging if the mobile phone is not resting properly on the charging pad, in such conditions the phone should be lifted and placed back properly. Do not keep any metal object in the charging pad along with Mobile Phone. It will aƯect phone charging performance. Also, it may cause overheating of phone and metal objects. Smart phones of some manufacturers may display charging indication on weak current and no increase in net charge. This is due to the particular characteristic of the smart phone and does not imply a malfunction on wireless charging function. For certain mobile phones with their own protection, the wireless charging speed may decrease sometimes, and the wireless charging may stop. When the wireless charging system of the mobile phone is being used, make sure that the smart key is 20cm or more away from the wireless charging area. 4-10 NOTE Only one mobile phone can be charged at a time. ! CONTROL DEVICE I n t e r i o r F e a t u r e s 4 4-11 NOTE 1. On bumpy roads, the wireless charging function of the mobile phone may intermittently stop and resume. If the mobile phone deviates from the charging area and stops charging, it will need to be placed back in the rechargeable area. Note: The size ! of each brand of mobile phone is diƯerent, and the position of the charging coil on the mobile phone is diƯerent. Please adjust the position of the mobile phone accordingly. In addition, the case of some mobile phones may have an impact on wireless charging. It may be necessary to adjust or remove the case to achieve wireless charging. 2. If the mobile phone cannot be charged correctly, please make sure that there is no foreign matter in the wireless charging area or wait for the wireless charging area to cool down before further attempts. If it still fails, seek an MG Authorised Dealership. “The wireless cellular phone charging system may not support certain cellular phones, which are not veriﬁed for QI speciﬁcation”. Few wireless charger cellular phone have limited charging performance, and this is due to inbuilt protection added by phone manufacturers. Eg. Latest iPhone models have inbuilt Mag safe technology which limits the wireless charging performance. CONTROL DEVICE WARNING ! The wireless charging eƯiciency may reduce when there is a heavy accessory cover on the smart phone. Items like vehicle Keys, Pen, Coins, Magnetic components such as credit card, telephone card, bankbook, any transportation ticket or any metallic objects should not be kept on Wireless charging pad",
  "/over mobile phone while charging. They may get damaged and may also aƯect mobile charging performance. When any smart phone without a wireless charging function is placed on the charging pad, It does not aƯect the vehicle or the smart phone in any way. I n t e r i o r F e a t u r e s 4 1. FCS Indicator 2. Front Passenger's Seat Belt Unfastened Warning Lamp 3. Driver Seat Belt Warning Lamp 4. Door Ajar Warning Lamp 5. Charging Cable Connection Indicator 6. Rear Fog Light Indicator 7. Low Beam Indicator 8. High Beam Indicator 9. Position Indicator 10. READY Indicator 11. Automatic Vehicle Hold (AVH) Working Indicator Instrument cluster 12. Automatic Vehicle Hold (AVH) Fault Warning Lamp 13. Electronic Parking Brake (EPB) Working Indicator 14. Electronic Parking Brake (EPB) Fault Warning Lamp 15. Brake System Fault Warning Lamp 16. Vehicle Fault Warning Lamp 17. EPS Fault Warning Lamp 18. Tire Pressure Monitor System (TPMS) Fault Indicator 19. Airbag Fault Warning Lamp 20. Electronic Stability Control (ESC) State Indicator* 4-12 INSTRUMENT CLUSTER I n t e r i o r F e a t u r e s 4 21. Electronic Stability Control (ESC) OFF Indicator* 22. Battery Pack Heating Indicator 23. Energy Recovery Indicator 24. Engine Compartment Opening Indicator 25. Cruise Control Failure Warning Light 26. Rear Passenger Belt Warning Light 27. 12V Battery Fault Indicator 28. Charging Status Indicator 29. Traction Battery Thermal Runaway Warning Lamp 30. Left Turn Signal Indicator/Hazard Warning Flasher 31. Gear Display 32. Right Turn Signal Indicator/ Hazard Warning Flasher 33. Immobilizer System Indicator 34. Vehicle insulation warning lamp 35. Constant Speed Cruise Work Status Indicator 36. ACC speed set indicator 37. Drive Power Limit Indicator 38. ABS Indicator 39. Motor Overheating Warning Indicator 40. Lane Departure Warning & Corrective Steering Function Fault Warning Lamp 41. ACC Indicator 42. Driving mode 43. Display 44. Vehicle Status Display 45. Tire Pressure Monitor System (TPMS) 46. Range 47. SOC Indication 48. Traction battery low SOC indicator 4-13 INSTRUMENT CLUSTER I n t e r i o r F e a t u r e s 4 Speedometer It displays the vehicle speed. SOC indicator The traction battery's State of Charge (SOC) is displayed from 0% to 100%. • Battery percentage between 20% to 30%: The SOC bar is yellow. • Battery percentage between 0% to 20%: The SOC bar is red, indicating that charging is urgently needed. Motor speed/battery voltage/ battery current meter motor speed 9999 rpm Voltage 99 V current 999 A On the lower left of the instrument, you can switch to display the motor speed/battery voltage/ battery current meter. It displays the motor speed per minute. This parameter displays the battery voltage. Display battery current. 4-14 NOTE Please keep the speed within the limit when driving in a speed limit zone. ! NOTE 1. Avoid letting the traction battery run completely out of power. Always keep enough charge for your next trip. 2. When the low traction",
  "battery warning lamp illuminates, the battery's capacity is signiﬁcantly reduced. Avoid driving on expressways or overpasses and charge the battery as soon as possible. ! INSTRUMENT CLUSTER km/h0 100% I n t e r i o r F e a t u r e s 4 Odometer The trip and total mileage are displayed. • Switching modes: Short press the right side of the steering wheel scroll wheel to enter the instrument cluster control mode. • Navigating pages: • Turn upwards: Scrolls to the previous page. • Turn downwards: Scrolls to the next page. • To reset the trip mileage, go to Settings > Vehicle > Vehicle Maintenance and click \"Reset” Range The actual endurance mileage is related to various factors such as current road conditions (such as a long steep slope), driving habits (such as frequent acceleration and deceleration), temperature (such as low temperature), and whether electrical equipment (such as A/C) is on. 4-15 NOTE Keep the motor speed under 7000 rpm. Running at high speed for a long time may overheat and damage the motor. ! NOTE It is lawfully forbidden to adjust the odometer for illegal purposes. ! NOTE The range is estimated for the reference of the driver and passengers only. ! It indicates the mileage which the vehicle can be driven with the remaining SOC. INSTRUMENT CLUSTER 460km I n t e r i o r F e a t u r e s 4 Gear display It displays the gear status. N: Neutral D: Drive R: reverse gear P: Park gear Display the current driving mode in the lower right corner (Eco+ mode, Eco mode, Standard mode, Sport mode). Driving mode The economy mode+, economy mode, standard mode and sport mode can be switched in \"Settings- Vehicle-Driving-Driving Mode\" of instrument panel. Eco+ mode: Extreme energy-saving mode, where the overall vehicle thermal management eƯiciency is reduced, energy recovery intensity is set to the highest, maximum speed is restricted, driving experience is not good, but it supports the longest range, with a maximum speed limit of 80 km/h. Eco mode: Weaker acceleration in this mode. Standard mode: Moderate acceleration in this mode. Sports mode: Stronger acceleration in this mode. 4-16 INSTRUMENT CLUSTER P R N D Control indicators Ready indicator When the READY indicator illuminates, the vehicle is ready to drive. For this to happen: 1. The legal key must be inside the vehicle. 2. The driver's seat must be occupied. Press the brake pedal until the READY indicator on the instrument cluster illuminates, and the vehicle enters the READY state. Charging status indicator High voltage mode: When the door is opened and the vehicle is in high voltage mode, this indicator lights up brieﬂy and then turns oƯ, showing that the charger is functioning normally. Charging: The indicator lights up when the vehicle is charging. It will turn oƯ once charging is complete. \u0000 Low Battery: If the indicator stays on continuously and the traction battery's state of charge (SOC) is very low, charge the",
  "battery as soon as possible. I n t e r i o r F e a t u r e s 4 4-17 INSTRUMENT CLUSTER READY I n t e r i o r F e a t u r e s 4 Charging cable connection indicator High voltage mode: When the door is opened and the vehicle is in high voltage mode, the indicator brieﬂy lights up and then turns oƯ, showing that the charging circuit is normal. Charging: The indicator lights up when the charging cable is connected. No illumination: If the indicator does not light up during charging, check if the charging cable connectors are securely connected. Energy recovery indicator When the battery pack can be charged and the vehicle is at high speed with the accelerator released or brake applied, the system recovers energy by converting mechanical energy into electric energy, which is stored in the traction battery to extend the driving range. Energy recovery: The indicator lights up and power is shown as a negative value when the system is working. Limitations: 1. No energy recovery if the battery pack cannot be charged. 2. Energy recovery is limited in cold conditions and cannot occur below -10°C. 3. Energy recovery is not possible if the vehicle speed is below 8 km/h. 4. Energy recovery is paused when ESC is activated. It resumes after ESC is deactivated for 1 minute. 4-18 INSTRUMENT CLUSTER I n t e r i o r F e a t u r e s 4 Turn signal indicator/ hazard warning ﬂasher The turn signal indicator/hazard warning ﬂasher shows if the exterior turn signals or hazard warning ﬂashers are working. If the green arrow does not blink when using the turn signal or pressing the hazard warning button, check and replace the fuse or bulb if needed. 5. No energy recovery if the ABS MIL or ESC indicator is on. In some cases, the energy recovery indicator might not light up, but energy recovery could still occur at a lower power. Adjustable energy recovery strength To adjust the energy recovery strength: 1. Default setting: Energy recovery is set to standard mode by default. 2. Adjusting: Go to Settings > Vehicle > Driving > Energy Recovery Mode in the infotainment system. Choose from three levels: Weak, Standard, and Strong. Energy recovery strength increases gradually from Weak to Strong. CAUTION These indicators are crucial for driving safety. If the turn signal or hazard ﬂasher bulbs are burnt out, replace them immediately. Failure to maintain these indicators can lead to accidents, personal injuries, and damage to the vehicle or other property. 4-19 INSTRUMENT CLUSTER I n t e r i o r F e a t u r e s 4 Door ajar warning lamp The warning lamp illuminates when the door is opened or is not completely closed. NOTE If the ﬂashing time is shorter than normal, it indicates that the turn signal lamp bulb has burnt out and must be replaced. ! Battery fault",
  "warning lamp When the vehicle is powered on, this indicator will illuminate, and the READY lamp should illuminate and then turn oƯ, indicating that the 12V battery is connected normally. If this indicator illuminates at any other time, it indicates that the 12V battery is being or has a fault. Please charge the 12V battery ﬁrst. If you encounter any of the following situations, contact the nearest JSW MG authorised service center for a vehicle inspection: 1. The lamp does not illuminate when the vehicle is powered on. 2. The lamp lights up but does not turn oƯ. 3. The warning lamp illuminates while the \"READY\" indicator turns oƯ, indicating the vehicle cannot run. 4-20 INSTRUMENT CLUSTER I n t e r i o r F e a t u r e s 4 Battery pack heating indicator The battery pack heating indicator lights up in low temperatures to show that the system is heating the battery to maintain a safe charging temperature. • During charging: The indicator will illuminate to indicate that the battery is being heated to ensure it charges safely. • After full charge: If charging power is not disconnected in cold weather, the indicator remains on, showing that the system continues to heat the battery to reach an optimal temperature. This lamp is a state indicator, not a malfunction indicator light (MIL). It does not aƯect driving and should not be on while driving. If it lights up during driving, contact the nearest JSW MG authorised service center. High beam indicator The high beam indicator illuminates when the headlamp high beam is turned on. Low beam indicator The low beam indicator illuminates when the headlamp low beam is turned on. 4-21 INSTRUMENT CLUSTER HEAT I n t e r i o r F e a t u r e s 4 ABS fault warning lamp When the vehicle is powered on, the ABS warning lamp will brieﬂy illuminate to show that the system is self-checking and that the lamp is functioning. It should turn oƯ after a few seconds. Consult the nearest JSW MG authorised service center if: 1. The lamp does not light up when the vehicle is powered on. 2. The lamp stays on continuously. 3. The lamp lights up while driving, indicating a potential ABS fault. Although the vehicle can operate normally without ABS, it's strongly recommended to have the ABS inspected and repaired as soon as possible. Rear fog light indicator The indicator illuminates when the rear fog lamp is turned on. Refer to relevant contents in Section \"Rear Fog Lamp\" of Chapter \" Lighting\". Position indicator This indicator illuminates when the position lamp is turned on. 4-22 INSTRUMENT CLUSTER ABS I n t e r i o r F e a t u r e s 4 CAUTION An illuminated ABS warning lamp may signal that the braking system is not functioning properly. If the brakes are not in good working condition, it can lead to collisions, personal injuries, and damage",
  "to your vehicle or other property. 4-23 INSTRUMENT CLUSTER 4 Exterior lighting Lighting switch You can set the lighting status in “Menu - Vehicle settings - Lights - Headlight setting” to options like Auto, Low beam, Position lamp and OƯ. High beam To switch on the high beam: 1. Make sure the headlamp is on low beam. 2. Push the control lever towards the instrument panel. 3. The high beam indicator will light up. 4. Push the lever to turn the high beam on or oƯ. LIGHTING I n t e r i o r F e a t u r e s CAUTION When approaching oncoming vehicles or a vehicle ahead, switch from high beam to low beam. High beams can temporarily blind other drivers, increasing the risk of a collision. 4-24 OFF: All lights are turned oƯ. AUTO: Lights turn on automatically. Position lamp: Interior switch backlight, position light, and license plate light are on. Low beam: Low beam and all the above lights are on. The default setting is Auto, which activates every time the power is turned on. Headlamp flashing To activate the headlamp high beam ﬂash: 1. Pull the control lever on the right side of the steering wheel towards you. 2. Release the lever after ﬂashing. The lever will return to its normal position. 3. Keep the lever pulled to keep the high beams on. Hazard warning lamp switch Press | to turn on/oƯ the hazard ﬂasher. Turn and lane change signal lamp • Control lever upward: Activates the left turn signal lamp. • Control lever downward: Activates the right turn signal lamp. After you complete a turn, the signal will automatically stop, and the lever will return to the normal position. For changing lanes: 1. Pull the lever up or down to the halfway position (not the full turn signal position). 2. Hold the lever until you complete the lane change. 3. Release the lever, and it will return to the normal position automatically. 4 I n t e r i o r F e a t u r e s 4-25 LIGHTING Reversing lamp The reversing light will illuminate when the vehicle is in the READY state and the reverse gear is engaged. Brake light The brake lamp illuminates as you depress the brake pedal. Daytime running lamps* After the vehicle is started, the daytime running lamp will be turned on automatically; after the position lamp is turned on, the lamp will go out automatically. Rear fog lamp To turn the rear fog light on or oƯ: 1. Go to “Menu - Vehicle settings - Lamp - Rear fog light”. 2. When the rear fog light is on, the dipped beam will also turn on. Headlamp height adjustment To adjust the headlamp range based on vehicle load: 1. Go to “Menu - Vehicle settings - Lights - Headlight setting” in the infotainment system. 2. Choose from the following levels (0-3): - 0 : Front seats occupied - 1: All seats occupied -",
  "2: All seats occupied with luggage compartment loaded - 3: Driver's seat occupied with luggage compartment loaded Adjusting the headlamp height helps achieve optimal lighting and avoid dazzling other drivers.. Follow-Me-Home Your vehicle has a \"Follow-Me-Home\" function that provides lighting when you leave the vehicle at night after turning oƯ the engine. To adjust the Follow-Me-Home lighting: 1. Go to “Menu - Vehicle settings - Light - Follow me home” in the infotainment system. 2. Choose the delay time for turning oƯ the dipped beam: 15 seconds, 30 seconds, or 60 seconds. The delay time will increase accordingly. After activating the \"Follow-Me- Home\" function: • Turn the lighting switch control lever towards the steering wheel twice to trigger the delayed turn- oƯ. • If the vehicle is locked remotely, the low beam will turn oƯ automatically after 30 seconds. 4 I n t e r i o r F e a t u r e s 4-26 LIGHTING 4 I n t e r i o r F e a t u r e s • If the vehicle is not remotely locked, the low beam will turn oƯ automatically after 10 minutes. Interior lighting Front reading lamp The front reading lamp has 2 working switches: ①: The lamp illuminates and keeps illuminated until it is manually turned oƯ. ②: The lamp is on when the front door is opened, and the lamp is oƯ when the front door is closed. CAUTION Please avoid usage of the inside lamps during driving in night or darkness. A bright passenger compartment can reduce the visibility exterior ambient and cause collision as a result. 4-27 LIGHTING 4 Rear reading lamp* If the vehicle is equipped with a reading lamp at the auxiliary armrests on both sides of the rear seat, press the switch on the reading lamp to turn it on or oƯ. WARNING ! Please avoid usage of the inside lamps during driving in night and darkness. A bright compartment can reduce the visibility outside and cause collision as a result. I n t e r i o r F e a t u r e s The trunk illumination lamp illuminates as the tailgate is opened. It goes out after the tailgate is closed. Trunk lamp 4-28 LIGHTING 4 If equipped, the ambient lights are arranged in the instrument panel and four door storage areas. Ambient lights You can set ambient lights to Auto/ On/ OƯ in “Menu - Vehicle settings - Lamp - Ambient light - Auto/On/OƯ”. Adjustment mode You can set ﬁxed mode/random mode in “Menu - Vehicle settings - Lamp - Ambient light - Mode adjustment - Constant/Random”. Constant mode a. Colour selection You can select the desire colour from the colour panel. Interior ambient lamp* I n t e r i o r F e a t u r e s b. Breathing eƯect You can set the breathing eƯect of ambient lights in “Menu - Vehicle settings - Lamp - Ambient light - Mode adjustment -",
  "Constant - Breathing eƯect”. Random mode On selecting random mode you can select “Soft/smooth/all” mode setting and also choose duration of the same. Brightness adjustment You can adjust the brightness of ambient lights (0%-100%) in \"Settings - Vehicle - Lights - Ambient Lights - Brightness Adjustment\". 4-29 LIGHTING 4 Air outlet 1. Front Door Window Defogger Air Outlet 2. Side Air Outlet 3. Front Windshield Defogger Air Outlet 4. Central Air Outlet 5. Floor Air Outlet Front door window defogger air outlet The front door window defogger air outlet is used to divert the air to the side door window, mainly to the outside rearview mirror area. Side air outlet You can divert air through the two adjustable side air outlets to both sides of the front passenger area or to the side window. TEMPERATURE CONTROL SYSTEM I n t e r i o r F e a t u r e s 4-30 1 2 3 4 2 1 5 5 4 Front windshield defogger air outlet Divert air to the front windshield. Central air outlet You can control the air ﬂow direction of the central air outlets. Floor air outlet The ﬂoor air outlet is used to divert the air to the front foot area. Ventilation mode Turn the mode selection button to acquire the desired air ﬂow direction. Five ventilation modes are available as follows: Face mode In this mode, the air ﬂows out from the central and side air outlets. Face/foot mode In this mode, the air ﬂows in two directions. Half of the air passes through the ﬂoor air outlets, and the rest of the air passes through the central and side air outlets. I n t e r i o r F e a t u r e s 4-31 TEMPERATURE CONTROL SYSTEM 4 Foot mode Most of the air ﬂows out from the ﬂoor air outlet, a small amount of air ﬂows out from the windshield and the front door window defroster air outlet and the side air outlet. Defrosting mode This mode allows air to be passed through the front windshield defroster air outlet and front door defroster air outlet. Foot/defrosting mode In this mode, air ﬂows out from the front windshield defroster air outlet, the front door window defroster air outlet, the ﬂoor air outlet and the side air outlet. TEMPERATURE CONTROL SYSTEM I n t e r i o r F e a t u r e s 4-32 4 1. Scenario Mode 2. Air Volume Adjustment 3. Front Defrosting 4. Rear Defroster 5. Temperature Adjustment 6. Internal circulation mode 7. External circulation mode A/C Air conditioner interface display 8. A/C button 9. Power button 10. Face Blowing Mode 11. Face & Foot Blowing mode 12. Foot Blowing Mode 13. Foot & Windshield Blowing Mode TEMPERATURE CONTROL SYSTEM I n t e r i o r F e a t u r e s 4-33 4 Turn on the air conditioning (A/C) system: 1. The vehicle is in \"READY\" state.",
  "2. Press the air conditioner (A/C) button. When the \"A/C\" button on the A/C page of instrument cluster illuminates, conﬁrm that the A/C is working. 3. Adjust the fan speed. Turn oƯ the A/C: Press the A/C button again to make sure that the A/C stops refrigerating. If the air conditioning system is turned on when the vehicle is powered oƯ, the system will turn on automatically as the vehicle is started next time. A/C button Low-SOC A/C limit The low-SOC A/C limit can be turned on/oƯ in instrument panel “Settings- Vehicle-Energy-Low-SOC A/C Limit\". After the function is enabled, when the SOC is lower than 10%, the A/C refrigeration or heating system will automatically turn oƯ. Please charge the vehicle in time. Internal circulation mode button Press this button during driving on a dusty road, or when you want to prevent the exhaust or outside smoke entering inside, or when you want to quickly decrease or increase temperature in the passenger area. The indicator will illuminate and the inside air will start to circulate internally. Press this button again to switch to the external circulation mode and the TEMPERATURE CONTROL SYSTEM I n t e r i o r F e a t u r e s NOTE The A/C system may work only after the A/C fan is turned on. ! 4-34 A/C 4 indicator will go out. The system memorizes the previously set air circulation mode the next time you start the vehicle. After the internal circulation mode is turned on for about 20 min, it will automatically switch to the external circulation mode for a while to obtain fresh air. In this period, you may feel that the hot or cool air outside enters the vehicle. CAUTION You may feel tired and sleepy after long-time driving in the internal circulation mode. Please switch to the external circulation mode on a regular basis to intake fresh air. Front defrosting Press this button to select the front windshield defrosting mode. Turn on the fan. Switch the air blowing mode to defrosting mode, the A/C function will be automatically activated, and the A/C button will illuminate. Switch the air circulation mode to external circulation. TEMPERATURE CONTROL SYSTEM I n t e r i o r F e a t u r e s 4-35 4 Rear windshield defrosting button* In the AUTO mode, the A/C system automatically adjusts to keep the temperature inside the vehicle within a certain range. Press the AUTO button, and the AUTO button lights up. At this time, the air volume, cooling/heating damper, A/C state, air distribution mode, and internal/external circulation mode all enter the automatic control state. If the air volume, blowing mode or A/C state is manually adjusted in the AUTO mode, the adjusted function is no longer automatically controlled by the system and the AUTO indicator will turn oƯ. Other related functions are still controlled by the system automatically. When the air conditioner is powered oƯ, you can press the automatic mode (AUTO)",
  "button to turn the A/C system on and enter the automatic mode. AUTO Rear windshield defrosting button* Press the rear windshield defrosting button to turn on the rear windshield defroster on the instrument panel. The button indicator will illuminate. Please turn oƯ the defroster after your view becomes clear. After you press the button, the defroster will work for about 15 minutes and then turn oƯ. TEMPERATURE CONTROL SYSTEM I n t e r i o r F e a t u r e s 4-36 4 CAUTION Lack of proper maintenance may cause damage to the defroster or scratches on the glass. It is not allowed to use any sharp cleaner or that prone to cause glass wear to clean the rear windshield. During vehicle cleaning or when operating near the rear windshield, please take care not to shake or damage the defroster wire. If the driver’s view is aƯected, an accident can happen, causing personal injuries, damage to the vehicle or property loss. CAUTION Do not use the rear windshield defroster under the following circumstances: Snow or ice has deposited on the rear windshield. Common Settings of Air Conditioner Refrigerating device of the A/C system is used to cool down the inside air and remove the moisture and dust contained in the air. If the temperature set to a comparatively high temperature, warm air will be generated inside the vehicle even though the air conditioner (A/C) refrigeration function is activated. NOTE After the refrigeration turned on, you can ﬁnd water drops in the lower area of the engine compartment. It is normal that the water drops are formed as water vapor condenses on surface of the air conditioning system component. ! NOTE As the operation of the air conditioner compressor needs to consume a part of power. This is the reason why you may ﬁnd that the power of the vehicle drops rapidly when the air conditioning cooling function is activated. ! TEMPERATURE CONTROL SYSTEM I n t e r i o r F e a t u r e s 4-37 4 To cool down fast in scorching hot days or after the vehicle is exposed to the blazing sun for a long time: 1. Open the windows a little to expel the hot air inside. 2. Turn on the air conditioning (A/C) system. 3. Activate the internal circulation mode. 4 . Switch the air distribution mode to face mode ( ). 5. Adjust the temperature to the maximum coolness. 6. Adjust the fan speed to the maximum. Normal cooling 1. Turn on the A/C button. 2. Activate the internal circulation mode. 3. Switch the air distribution mode to face mode ( ) or dual mode ( ). 4. Adjust the temperature to the cool air area. 5. Adjust the fan speed to the desired value. Cool air Quick cooling Warm air Quick heating Activate the rapid heating mode to increase the passenger area temperature quickly. It is prohibited to activate this mode for a long time,",
  "otherwise the inside air quality will decrease and the windows will fog up. To clear up the fog on the windows, turn oƯ the internal circulation mode so that fresh air enters inside. To acquire the warmest air: 1. Activate the internal circulation mode. 2. Switch the air distribution mode to foot mode ( ). 3. Adjust the temperature to the maximum warmness. 4. Adjust the fan speed to the maximum. Normal heating 1. Activate the external circulation. 2. Switch the air distribution mode to foot mode ( ) or dual mode ( ). 3. Adjust the temperature to the warm air area. 4. Adjust the fan speed to the desired value. TEMPERATURE CONTROL SYSTEM I n t e r i o r F e a t u r e s 4-38 4 To control the air to ﬂow out from the central air outlet and the side air outlet: 1. Activate the external circulation mode. 2. Switch the air distribution mode to face mode ( ) or dual mode ( ). 3. Adjust the temperature to the cool air area. 4. Adjust the fan speed to the desired value. Ventilation TEMPERATURE CONTROL SYSTEM I n t e r i o r F e a t u r e s 4-39 Storage compartments l Instrument panel central storage box l Storage box sliding curtain l Console storage box l Armrest storage box l Glove box l Map pocket l Cup holder l Door storage groove and armrest l Armrest l Storage tank l Rear side wall storage groove and armrest* l Backrest hook l Luggage Storage 5 1) I nstrument Panel Central S torage Box 2) S torage box Sliding Curtain* 3) C onsole Storage box 4) A rmrest storage box 5) G love Box 6) M ap Pocket 7) C up Holder 8) Door storage groove and Armrest 9) Rear side wall storage Groove and armrest 10) Backrest hook 11) Luggage 12) Emergency equipment The storage box is positioned below the central control screen. 1) Instrument panel central storage box If equipped, you can manually slide the curtain to open the storage box. S t o r a g e 2) Storage box sliding curtain Storage compartments STORAGE COMPARTMENT 5 5-1 S t o r a g e 3) Console storage box The console storage box is positioned behind the armrest box. 4) Armrest storage box It is positioned between the front seats. Pull up to open the storage box cover and close it after use. 5) Glove box To open: Press the knob and open the glove box ﬂap. To close: Lift glove box ﬂap upward until it engages. 6) MAP pocket The map pocket is located on the backside of the front seat backrest. 5 5-2 STORAGE COMPARTMENT 7) Cup Holder The cup holder is located on the console between the front seats. 8) Door storage groove and Armrest 1. Armrest 2. Storage tank The door storage groove and armrest are located on the front doors and",
  "rear doors S t o r a g e On the rear seat armrests, there are also cupholders for some models. WARNING ! When the car is moving, you must not put an uncovered container of hot drinks in the cup holder. If the drink spills, it could burn someone or make it harder to control the car. To lower the chance of getting hurt during sudden stops or crashes, don't place a bottle, glass, or similar container without a cover in the cup holder while driving. 5 5-3 STORAGE COMPARTMENT 10) Backrest Hook The hook is located at the junction of the seat backrest and the headrest. You can hang a shopping bag or other suitable objects on the hook as required. 11) Luggage • Store the luggage in luggage compartment. You can keep suitcase, bags, etc • Luggage cover is designed only for hiding the luggage compartment. S t o r a g e 9) Rear Side Wall Storage Groove and Armrest* The rear side wall storage and armrest in provided in the middle of the rear seat, which can be opened by pulling the drawstring. It has a built-in cup holder for placing your cups and other items. ( if equipped) NOTE Do not put anything on the luggage cover because it might block the driver's view out the back. If there's an accident or sudden braking, it could injure the people inside the car. ! 5 5-4 STORAGE COMPARTMENT 12) Emergency equipment kit: You need to know where the emergency equipment is in your vehicle and how to use it. Check this equipment regularly to ensure it's working properly and stored where it belongs. First Aid Kit: The ﬁrst aid kit is stored in the glove box. It has items for treating minor injuries only. S t o r a g e Loading info: • Heavy objects in the trunk should be placed near the backrest and make sure the seat backrest is secure. If you need to stack objects, put the heavier ones at the bottom. • Objects should be secured to prevent them from sliding a round. Don't leave loose objects in the vehicle. • Loaded items should not be higher than the top of the seat backrest. • Nothing should be placed on the tailgate panel or instrument panel. Don't cover any sensors on the instrument panel. • Objects should not block the pedals, parking brake gear liver not to limit the free driver movement • Do not drive the vehicle if the lift gate is open. WARNING ! It is forbidden to place a perfume, cigarette lighter, propane gas cylinder or other combustible/ explosive materials in the vehicle. These items may catch ﬁre or explode if the vehicle is left in high temp. NOTE Check the contents of the ﬁrst aid kit regularly and replace any items that have been used or have expired. ! 5 5-5 STORAGE COMPARTMENT Tool Kit, Tow Hook, Jack And Spare Wheels Following parts are provided in",
  "the Bag as a Toolkit and kept in the Spare wheel. Tow hook • Wheel Spanner • Jack Handle • Jack • Warning triangle S t o r a g e 5 5-6 STORAGE COMPARTMENT Jump start 1-1 l Jump starting (Dead Battery) l Before jump starting l Connecting the jumper cables Towing the vehicle 1-5 l Recommended towing procedure l Towing with a wheel lifter l Emergency towing l Spare wheel removal process l Puncture repair kit l Emergency equipment kit l First aid kit l Tool kit, tow hook, jack and spare wheels Emergency & Breakdown 6 E m e r g e n c y B r e a k d o w n 6 Jump Starting (Dead Battery) If you cannot unlock the vehicle with the remote control or if nothing appears on the instrument cluster, the 12V battery might be low. In this situation, you can use another vehicle's 12V battery to jump start your vehicle, unless you are conﬁdent in your electrical knowledge and can do it safely. Before Jump Starting: 1. Place the vehicles close enough so the jumper cables can reach but ensure that their body parts do not touch. 2. Always avoid fans or any moving parts in the engine compartment, even when the vehicles are switched oƯ. 3. Turn oƯ all electrical devices like radios, lights, and air conditioning. Put both vehicles in Park (P) and engage the parking brake. Turn oƯ both vehicles. 4. Open the hood (bonnet). 5. Take oƯ the battery cover inside the front trunk. 6. Remove the cover of the engine compartment fuse box. Connecting the Jumper Cables: Before jump starting, make sure to correctly identify the positive (+) and negative (-) terminals to avoid reverse polar connections. CAUTION To jump start the vehicle, follow these steps: Follow these steps to connect the jumper cables correctly and make sure to follow this sequence as shown in the illustration. 1. First, attach one end of the jumper cable to the red, positive (+) jumper terminal of your vehicle (1). 2. Then, connect the other end of this jumper cable to the red, positive (+) battery/jumper terminal of the assisting vehicle (2). JUMP START NOTE Turn oƯ the audio and other equipment before jump starting. ! 6-1 3. Next, take the second jumper cable and attach it to the black, negative (-) battery / jumper terminal of the assisting vehicle (3). 4. Finally, connect the other end of this second jumper cable to the black, negative (-) chassis ground of your vehicle (4). Ensure the jumper cables only touch the correct battery or jumper terminals and the proper ground. Avoid leaning over the battery while making connections. CAUTION 5. After connecting, follow the starting procedure to get the vehicle into the \"READY\" state and start it. 6. Keep the vehicle in the \"READY\" state or at idle or drive the vehicle to ensure the battery receives suƯicient charge to start independently after the vehicle is turned oƯ.",
  "A fully discharged battery may need up to 120 minutes (about 2 hours) of runtime to recharge completely. Running the vehicle for less time may not be enough to restart the battery. If your vehicle does not start after several attempts, it needs service. Please seek assistance from Roadside Assistance or the nearest JSW MG authorised service center and let it be attended by trained professionals. If you are unsure why your battery discharged, we recommend having your vehicle inspected by JSW MG authorised service center. It is advisable to contact the JSW MG authorised service center for dedicated charging of the 12V battery as soon as possible. To safely disconnect the jumper cables, follow these steps in reverse order of connection: 1. Remove the jumper cable from the black, negative (-) chassis ground of your vehicle (4). 2. Disconnect the other end of this jumper cable from the black, negative (-) battery/chassis ground of the assisting vehicle (3). 3. Take oƯ the second jumper cable from the red, positive (+) battery/jumper terminal of the assisting vehicle (2). 6-2 JUMP START E m e r g e n c y B r e a k d o w n 6 4. Disconnect the other end of this jumper cable from the red, positive (+) jumper terminal of your vehicle (1). Ensure you follow this exact sequence to avoid any electrical hazards. DANGER There is a risk of battery explosion, which can cause burns from battery acid and could lead to electrical short circuits, resulting in personal injury or vehicle damage. • Keep the battery away from ﬂames or sparks. Avoid leaning over the battery during jump- starting. • Prevent the cable terminals from touching each other. • Wear safety goggles when working near the battery. • Avoid contact between battery acid and eyes, skin, fabric, or paint surfaces. • Make sure the replacement automotive battery for jump- starting matches the voltage of the original vehicle battery. • Do not disconnect a dead battery from the vehicle. Failure to follow these precautions or instructions could lead to a battery explosion, causing burns from battery acid or electrical system damage in both vehicles, and serious personal injury. WARNING ! When connecting the jumper cables to charge a vehicle: • When jump-starting your vehicle, prevent the positive (+) and negative (-) cables from touching each other. A spark could result in personal injury. • Avoid connecting to the negative (-) terminal of the battery last. - Instead, attach the ﬁnal clip to a metal part of the car's body, away from the battery. Do not connect it to any components. • Connecting the jumper cable to the negative terminal of a dead battery could create sparks and lead to the battery exploding. A spark could cause the battery to explode, resulting in personal injury or vehicle damage. • This can cause severe injuries or harm to the vehicle. • Connecting jumper cables to components can also damage them. 6-3 JUMP START E m",
  "e r g e n c y B r e a k d o w n 6 Avoid using the battery to power other devices for extended periods. This can drain the battery quickly and might lead to accidents. CAUTION NOTE To protect your vehicle from damage: • Use only a 12-volt power source (battery or jumper system) for jump-starting. • Do not try to jump-start your vehicle by pushing it. • Always ensure that the battery cover and cables are securely tightened after completing the jump start. Failure to do so could damage parts, cause noise issues, or allow foreign substances to enter. ! Towing the Vehicle If emergency towing is required, we recommend having it performed by an authorized JSW MG RSA partner or a professional tow-truck service. Recommended Towing Procedure: If your vehicle breaks down, we recommend towing it with the driving wheels oƯ the ground or placing it on a ﬂatbed truck, as illustrated. Proper lifting and towing methods are crucial to avoid damaging the vehicle. Using wheel dollies or a ﬂatbed is highly recommended. 6-4 NOTE Improperly disposing of a battery can harm the environment and human health. Follow your local laws or regulations for proper battery disposal. ! TOWING THE VEHICLE E m e r g e n c y B r e a k d o w n 6 For 2WD vehicles, towing with the front wheels on the ground (without dollies) and the rear wheels oƯ the ground is acceptable. If any loaded wheels or suspension components are damaged or if towing with the rear wheels on the ground is necessary, use a towing dolly under the rear wheels. It is prohibited to allow passengers to be seated in the towed vehicles. Towing speed is not allowed to exceed the safe speed or the indicated road speed limit. It is prohibited to use damaged parts that are not ﬁrmly secured onto the vehicle for towing. Failure to comply with the above precautions may result in personal injury. CAUTION Guidelines for moving a short distance before towing a vehicle: • Only move within 394 inches (10 meters) at a speed of 5 km/hr or slower, typically when loading onto a tow truck or adjusting position. • Ensure the gear is in 'N' (neutral) and the parking brake is oƯ during this movement. If unable to operate the transmission and parking brake, lift the rear wheels. 6-5 NOTE Do not use lifting chain equipment to tow the vehicle. Instead, use plates or wheel lifting devices. If towing the vehicle from the front is necessary, ensure the towing device supports the rear wheels oƯ the ground. The rear wheels should not touch the ground during front towing. If the rear wheels are on the ground during towing from the front, it can cause signiﬁcant damage to the car's engine. ! NOTE Avoid lifting the vehicle with the tow ﬁtting or body and chassis parts to prevent potential damage to the vehicle. ! E m e",
  "r g e n c y B r e a k d o w n 6 TOWING THE VEHICLE WARNING ! Do not tow with sling-type equipment. Use wheel lift or ﬂatbed equipment. Towing with a wheel lifter Step 1: Installing the Removable Towing Hook: 1. Open the tailgate and take out the towing hook from the tool case. 2. Remove the hole cover: l For the front: Push the lower part of the bumper hole cover. l For the rear: Push the upper part of the bumper hole cover, then pull the lower part. 3. Insert the towing hook into the hole and turn it clockwise until it is fully tightened. 4. After use, remove the towing hook and reinstall the cover. Please ensure that the towing hook is tightened properly. If not, during towing the towing hook may be thrown oƯ the vehicle resulting in serious injury or accident. CAUTION Step 2 : a. Turn on the hazard warning lamp. b. Power oƯ the vehicle. c. Release the parking brake. d. Front wheels must be oƯ the ground when towing. When towing the vehicle with a ﬂatbed trailer, check that it is ﬁrmly ﬁxed to the trailer. 6-6 NOTE Failure to properly tighten the towing hook may result in vehicle damage and damage of related parts. ! E m e r g e n c y B r e a k d o w n 6 TOWING THE VEHICLE • Do not exceed 30 km/h when towing and limit towing distances to 40 km. • For longer distances, contact an JSW MG authorised service center or professional towing service for assistance. CAUTION Emergency Towing If a towing truck is not available during an emergency, you can temporarily secure a rope to the front towing hook under the vehicle for traction. When towing the vehicle using the front towing hook, only use a tow rope. Do not use a rigid tow bar. Your vehicle can be towed by other vehicles, but it should not be used to tow other vehicles. needs to be pulled out of a diƯicult situation. • Always tow the vehicle from the front only. • Ensure the tow rope does not touch the bumper. • Secure both ends of the tow rope tightly to the towing hook. Check the rope for any signs of wear. • Drive the vehicle slowly and avoid sharp turns to prevent loss of control. • Keep the towing distance short and maintain a low towing speed. • Do not tow the vehicle if the wheel, axle, steering, or brakes are damaged. • Do not remove the key from the ignition switch to prevent the steering wheel from locking and immobilizing the vehicle. 6-7 NOTE If the vehicle needs to be towed from the front, make sure to use a towing device that lifts the rear wheels oƯ the ground. The rear wheels should not touch the ground during towing from the front. If the rear wheels are on the ground",
  "during towing, it can cause signiﬁcant damage to the car's engine. ! NOTE ! When towing the vehicle with ropes, there is a risk of damage. Follow these guidelines to minimize potential problems: • Use the towing hook if other towing equipment is unavailable or if the vehicle E m e r g e n c y B r e a k d o w n 6 TOWING THE VEHICLE Electric vehicle 1-1 l Electric vehicle information 1-2 l Characteristics of EV 1-3 l Warning - EV vehicle related 1-4 Main components of electric vehicle 1-5 l Main components 1-6 l HV battery 1-7 w HV battery disposal /storage guidelines 1-8 l Common terminologies 1-9 l Safety of HV system / HV system: contact with water 1-10 l Warning, cautions - HV battery related 1-11 7 Vehicle Maintenance 7 V e h i c l e M a i n t e n a n c e 7 General Information Inadequate or incomplete servicing may lead to operational issues, potentially causing vehicle damage, accidents, or personal injury. This chapter oƯers instructions for easy- to-perform maintenance tasks. Maintenance Services It is crucial to exercise utmost care to avoid vehicle damage or personal injury during any maintenance or inspection procedures. We strongly advise having your vehicle maintained and repaired by JSW MG authorised service center. These dealers meet MG's stringent service quality standards and receive technical support to ensure your satisfaction. Owner's Responsibility It is the owner's responsibility to manage maintenance services and retain records. Keep documents demonstrating proper maintenance as per the scheduled service charts provided in the following pages. These records are essential to validate compliance with your vehicle's servicing and maintenance requirements outlined in your Service Passport, which also contains detailed warranty information. Accessories and Vehicle Retroﬁtting We recommend the use of original parts and components as well as those specially suitable for this vehicle approved by our company. We are unable to guarantee the compatibility of other products with the vehicle, even if these products meet the speciﬁed requirements or are otherwise approved. Without the approval of MG, do not retroﬁt the electrical system. CAUTION Do not retroﬁt the vehicle. Retroﬁtting may aƯect the vehicle performance, durability and safety. Any problems caused by retroﬁtting are not within the scope of warranty. The Company will not bear corresponding responsibilities for the safety problems caused by retroﬁtting. 7-1 VEHICLE MAINTENANCE Vehicle Storage Long-term Storage • Several months of vehicle storage: • Clean and wax the vehicle. • Check the wax coating of front compartment and the underbody. • Clean and protect the rubber seal. • Drain the washing ﬂuid reservoir. • Adjust the tire pressure according to the speciﬁed value under full load. • Charge the traction battery to about 60%. Park the vehicle in a dry and well- ventilated area. • Check that the EPB is applied and the vehicle will not move. Close all doors and lock the vehicle. • Disconnect the wire clamp from the vehicle 12V",
  "battery negative terminal. Please note that all systems are out of service at this time, e.g., theft alarm system. Traction Battery Recycling If you need to replace the traction battery, please handover the old one to a recycling service station designated by MG for recycling. Discarding traction batteries will pollute the environment and even cause personal injury. According to the applicable laws and regulations, this kind of waste must be recycled and disposed of. Refer to the oƯicial website or consult the JSW MG authorised service center for speciﬁc recycling rules. V e h i c l e M a i n t e n a n c e 7 7-2 VEHICLE MAINTENANCE When the vehicle is to be put back into service: • Connect the wire clamp to the 12V battery negative terminal. Enable the electronic device of power window. Driver Checklist • Regularly check the interior, exterior and front compartment of the vehicle to keep it safe and reliable. Exterior Tire • Inﬂate tires correctly. (Refer to \"Wheels and tires\" in this section). • There is no crack on tire wall or tire tread. There are no foreign matters in tread pattern. Lamp • Include all driving lamps, headlamps, tail lamps, turn signal lamps, brake lamps and rear fog lamps. Liquid Tank • Check whether the level of ﬂuid reservoirs under cowl hood is appropriate. Windshield Wiper • Check the state of wiper arms and blades. V e h i c l e M a i n t e n a n c e 7 7-3 VEHICLE MAINTENANCE Interior Steering • Check whether the steering wheel is too loose (free stroke) Parking Brake • Ensure the stroke of parking brake lever is appropriate. Instrument Panel • Check whether all instruments, control buttons and warning lamps work normally. Rearview Mirror • Ensure the reﬂecting surface of rearview mirror is in good state and clean. • Check whether all rearview mirrors can be readjusted. Control • Check the brake pedal and clutch pedal for appropriate stroke Engine Compartment Front Compartment* 1. Coolant 2. 12V battery 3. Brake ﬂuid reservoir 4. Windshield washing ﬂuid reservoir Front Compartment* 1. Brake ﬂuid reservoir 2. Coolant 3. Coolant 4. Brake ﬂuid reservoir 12V battery 5. Windshield washing ﬂuid reservoir V e h i c l e M a i n t e n a n c e 7 7-4 VEHICLE MAINTENANCE 12 V Battery The 12V battery is at the lower right of the front compartment. Warning notice on battery: Wear glasses! Wear protective gloves and glasses since battery acid is highly corrosive! Open ﬂames, electric sparks, strong light and smoking are prohibited! Explosive mixed gas may be produced during battery charging! Children should be kept away from acid and battery! Your vehicle is equipped with a MG authorized genuine battery, located in the front compartment. According to the current load condition and battery status, the system may limit the power of some electrical appliances. Please ensure the vehicle is placed in READY mode",
  "as soon as possible to charge the battery. Best Battery Service DO NOT leave electric components switched on when not in READY mode, this may cause the battery to become ﬂat, resulting in the failure of the ability to set vehicle into READY mode and the reduction of battery life. Keep the battery top clean and dry. • Keep the terminals and connections clean, tight, and coated with petroleum jelly or terminal grease. • Rinse any spilled electrolyte from the battery immediately with a solution of water and baking soda. • Keep the battery securely mounted. • Tighten loose terminals and hold down clamp nuts only enough to keep the battery ﬁrmly in place. • Tightening excessively may damage the battery terminals. V e h i c l e M a i n t e n a n c e 7 7-5 VEHICLE MAINTENANCE CAUTION To avoid battery discharge, please turn oƯ the ignition switch when leaving the vehicle. Do not leave the power tailgate open for a long period of time. This may drain the battery. Unauthorized Electrical Devices The vehicle can detect self- discharge of the battery due to over-current that is generated by unauthorized electrical devices such as dashboard camera (dash cam) mounting during parking. If the warning continues even after external electrical devices are removed, have your vehicle inspected by a professional workshop. Accessories- All accessories connected to the battery powered outlets should be removed or turned oƯ when the vehicle is not in use to protect the battery against discharge. It is advisable to avoid use of any 12V vehicle systems & accessories such as Power tail gate, Sound system, Interior & Exterior lamps, AC Blower, ….etc when engine is switched oƯ. This may cause 12V battery to drain faster. Risk of injury, corrosion, accident and ﬁre exists when operating on vehicle battery and electrical appliance! Wear protective glasses. Prevent acidic or lead particles from falling into eyes, on skin or clothes. Wear protective gloves and glasses since battery acid is highly corrosive! The battery can not be turned over because the acid may ﬂow out of the air vent. If the acid splashes into eyes, wash with clean water for a few minutes, then go to see a doctor immediately. If the acid splashes on skin or clothes, immediately neutralize it with rich soap solution and rinse with plenty of water. If you mistakenly drink acid, go to see a doctor immediately. Open ﬂames, electric sparks, strong light and smoking are prohibited! Avoid sparking when handling cables and electrical equipment and removing electrostatic loads. Battery electrode must not be short- circuited because sparks with high energy pose a risk of injury. A battery generates hydrogen gas which is ﬂammable and explosive. Keep any ﬂame or spark away from the vent holes. V e h i c l e M a i n t e n a n c e 7 7-6 VEHICLE MAINTENANCE Battery charging may produce explosive mixed gas, you must ensure that",
  "the battery air vent is open to successfully discharge the gas. The battery should be located in a well ventilated space during charging. Children should be kept away from acid and battery. Turn oƯ the engine, ignition switch and all the electrical appliances before working on electrical appliances. Remove the battery negative cable. Turn oƯ the lamp in bulb replacement. Please pay attention to the polarity of power supply. check if the polarity of power supply matches before energizing. Each energizing period should not be less than 5 seconds, to avoid frequent or fast on and oƯ operation. Turn oƯ all the electrical appliances before energizing the battery again. First connect the positive cable, then the negative one. Do not connect the wrong cable - Risk of ﬁre! Unauthorized removal and installation of battery are prohibited, because in some cases, this operation will lead to serious damage to the battery and fuse box. Please contact Service Dealer. Do not disconnect the battery when the ignition switch is on or the engine is running, otherwise it may damage the electrical appliances (electrical components). To prevent the battery case from being exposed to ultraviolet light, do not expose the battery to sunlight. Never attempt to dismantle a battery, they are sealed units. While removing the battery, always disconnect the negative terminal ﬁrst. And while installing the battery, ensure the negative terminal is connected last. If the battery has been disconnected or a new battery has been installed, the preset radio (if equipped) stations will get reset, once the battery is reconnected. The replacement battery must meet the speciﬁcation of the MG recommended battery. V e h i c l e M a i n t e n a n c e 7 7-7 VEHICLE MAINTENANCE Car Parking Period If the vehicle is to be parked for an extended period of time, the static current electrical appliance (like clock, security devices) will drain the battery, and the battery has to be recharged. To avoid such case, charge the battery or disconnect the battery negative cable during the vehicle parking. NOTE Please pay attention to the warnings & instructions for battery before working on it. ! It is recommended to ensure the vehicle is placed in READY mode for half an hour every week to help extend the service life of the battery. If the vehicle is stored for more than 1 month, remove the negative terminal from the battery. Make sure that the vehicle power system has been turned oƯ before connecting or disconnecting the negative terminal. CAUTION Always turn oƯ the ignition switch when parking, otherwise, it will greatly reduce the parking time. Turn oƯ the ignition switch and all electrical appliances before charging. If the vehicle has been stored for an extended period of time, and can not be started due to battery undercharge (general terminal voltage ≤ 12V), the battery must be removed from the vehicle and charged with ground equipment (operating in accordance with the charging device manufacturer’s instructions).",
  "When charging with a low current (such as a small charging device), generally it is not required to remove the battery connecting cables. But you must pay attention to the instructions given by the charging equipment manufacturer. Before the quick charge, that is, before the high current charge, you must remove two connecting cables. V e h i c l e M a i n t e n a n c e 7 7-8 VEHICLE MAINTENANCE NOTE Please pay attention to the warnings & instructions for battery before working on it. When charging, the power supply of charging device can be switched on only after the charging device electrode chuck clipped to the battery electrode as speciﬁed. After charging, ﬁrst turn oƯ the charging device, unplug the power cord, and then remove the electrode chuck of charging device from the battery. ! CAUTION • Keep children away from the battery, battery acid and charging devices. • The battery can only be charged in an ventilated space. Smoking, open ﬂame and electrical sparks are prohibited, because explosive mixed gas will be produced during battery charging! • To protect your eyes and face, please stay away from the battery. • If the acid splashes into eyes or on skins, rinse with clean water for a few minutes and go to see a doctor immediately. • Battery fast charging is dangerous and should be performed by Service Dealer, because it requires specialized charging equipment and knowledge. • Replace the frozen or unfrozen battery. Cracking may occur on the battery case because of freezing. Battery acid may leak and damage the vehicle. V e h i c l e M a i n t e n a n c e 7 7-9 VEHICLE MAINTENANCE NOTE Checking the Electrolyte Level Check the electrolyte level and speciﬁc gravity at speciﬁc PMS intervals. Check proper electrolyte levels for all the cells. If the level is below the lower marker, add distilled water until the level reaches the upper marker. Adding distilled water: • Remove the vent plugs • Add distilled water to all the cells that require the ﬂuid and secure the plugs properly. ! Battery Removal Turn oƯ the ignition switch and all electrical appliance before removing the battery. To remove the battery, you should ﬁrst remove the negative cable, next the positive cable, and then remove bolts on the battery retaining bracket, ﬁnally remove the battery. Battery Replacement Please go to an MG Authorised Repairer to remove and reﬁt the battery. Only ﬁt MG recommended battery while replacement to maintain the correct vehicle functionality. Please note that the ignition switch and the electrical appliance have been turned oƯ when installing the battery. NOTE Battery needs to dimensionally OK, to avoid terminals fouling with Battery Tray. ! The used battery should not be discarded at will, for it is harmful to the environment. It must be recycled by approved agencies. Please consult JSW MG authorised service center for more details. V e h i c l",
  "e M a i n t e n a n c e 7 7-10 VEHICLE MAINTENANCE Coolant Coolant (1) Coolant (2) The vehicle is equipped with a vehicle charging machine cooling system. The cooling system is ﬁlled with ethylene glycol coolant. In the correct mixing ratio, this coolant provides excellent corrosion and anti-freeze performance for cooling and warm air systems. Battery Installation Turn oƯ the ignition switch and all electrical appliance before removing the battery. Place the battery in the mounting position and secure it with battery bracket. Secure the positive cable then the negative one, then energize the battery. NOTE The JSW MG MOTOR shall not be liable/responsible for any damages / injuries, including consequential damages/injuries, resulting due to ﬁtment of non OEM approved batteries. ! CAUTION To avoid battery discharge, please turn oƯ the ignition switch when leaving the vehicle. V e h i c l e M a i n t e n a n c e 7 7-11 VEHICLE MAINTENANCE The coolant reservoir is located on the side of the front compartment, and its position is not easily observable. Please visit JSW MG authorised service center to have professional technicians inspect the coolant level, and if necessary, add or replace the coolant. NOTE Ordinary water or coolant in wrong mixing ratio will cause damage to the cooling system. It is prohibited to use ordinary water, alcohol or methanol on the vehicle for anti- freezing. ! CAUTION Under pressure, hot coolant and steam may spray out, causing serious personal injuries. It is prohibited to open the coolant tank cover before the charger and radiator cool down. The coolant is a dangerous substance. • Avoid repeated or prolonged exposure to coolant. • In case of contact with coolant, wash the skin and ﬁngernails with soapy water. • Keep it out of reach of children. • Coolant is irritating to the skin and can cause illness or fatal danger in case of swallowing. V e h i c l e M a i n t e n a n c e 7 7-12 VEHICLE MAINTENANCE Brake and Clutch Fluid The vehicle is equipped with a brake ﬂuid reservoir. The brake ﬂuid is moisture absorbing, and the ﬂuid with excessive water content will reduce the eƯiciency of the hydraulic brake system. Replace the ﬂuid as per the instructions in this Manual to avoid corrosion of the hydraulic system. Be sure to use the brake ﬂuid recommended by MG. Add ﬂuid into the reservoir to reach a proper level. The ﬂuid level shall not be lower than the MIN mark or higher than the MAX mark. A low level in the brake ﬂuid reservoir can be caused by leakage in the brake system or normal wear of the brake pads/linings. Please contact the JSW MG authorised service center to check whether the system needs to be repaired. If repairs are necessary, add ﬂuid after repairing the hydraulic brake system. When the brake ﬂuid level is lower than the MIN mark, the",
  "braking system warning lamp “q” will turn on. Refer to \"Brake System Warning Lamp\" under \"Instrument and Control Device\". Reﬁlling Brake Fluid 1. Thoroughly wipe oƯ the dirt around the reservoir ﬁller cap. 2. Open the ﬁller cap. 3. Fill the brake ﬂuid recommended by Not MG to the MAX mark of the ﬂuid reservoir. Be careful not to spill the ﬂuid on the paint's surface. In case of spilling on the paint surface, wash the area with cold water immediately. 4. Re-install the reservoir ﬁller cap. NOTE Before opening the ﬁller cap, clean the area around the brake ﬂuid reservoir ﬁller cap. Contamination of the brake ﬂuid system will aƯect the system performance, resulting in costly repairs. ! V e h i c l e M a i n t e n a n c e 7 7-13 VEHICLE MAINTENANCE CAUTION The brake ﬂuid is irritating to the skin and eyes. Avoid contacting the brake ﬂuid with the skin or eyes. In case of contact, wash the part in contact with the brake ﬂuid with soapy water or hand sanitizer thoroughly. Transmission Fluid Check Reducer Fluid for Leakage This work requires professional skills and equipment. To avoid personal injury or vehicle damage, it is recommended that you have this work done at JSW MG authorised service center. CAUTION The brake ﬂuid spilling over the front compartment may cause a ﬁre. An overfull ﬂuid reservoir is not allowed. Front compartment ﬁre may cause personal injury and damage to the vehicle and other properties. CAUTION It is prohibited to dispose of the old brake ﬂuid as household garbage. Be sure to use the local legal waste management agencies. The old brake ﬂuid and container are dangerous, and may be harmful to health and the Windshield Washing Fluid Before driving, ensure that the reservoir contains a suƯicient volume of the speciﬁed cleaning ﬂuid. In cold weather, the windshield washing ﬂuid reservoir cannot be overﬁlled. Washer ﬂuid will swell under low temperatures due to freezing. An overfull container has no enough space for expansion, thus resulting in damage. V e h i c l e M a i n t e n a n c e 7 7-14 VEHICLE MAINTENANCE NOTE Please go to the JSW MG authorised service center to ﬁll the correct washing ﬂuid. Do not ﬁll water or radiator anti-freezing agent into the windshield washing ﬂuid reservoir. The water will lead the solution to freeze, and the frozen solution will damage the windshield washing system. The radiator anti-freeze agent will damage the windshield washing system and vehicle paint. ! NOTE When ﬁlling windshield washing ﬂuid: It is recommended to use the ready-to-use special washing ﬂuid. If concentrated washing ﬂuid is used, please add water to dilute it according to the manufacturer's instructions. If the temperature is likely to fall below freezing point, use windshield washer solvent with good antifreezing performance. ! Windshield Wiper Foreign matters on the windshield and blade will reduce the eƯectiveness of the wiper. If the blade",
  "does not work properly, wipe the windshield and the blade with special or neutral washing ﬂuid. Flush with water thoroughly. If necessary, repeat the above operation. Do not wipe the windshield with corrosive substances or materials that cannot be removed from the glass (e.g. silicone). The strips have a layer of graphite on the surface for lubrication and protection. It should be protected from excessive wiping and undue polishing. Do not start the wiper when the glass surface is dry. Park the vehicle in a cool place as far as possible to prevent exposure to high temperature, which will accelerate the aging and deformation of strips. Remove foreign matters such as bird droppings, dust and leaves from the glass surface before starting the wiper; otherwise, the service life of strips will be reduced. V e h i c l e M a i n t e n a n c e 7 7-15 VEHICLE MAINTENANCE Wiper Repair The windshield wiper maintenance switch can be turned on or oƯ in instrument panel under \"Settings\"-- \"Vehicle\"--\"Vehicle Maintenance\"-- \"Windshield Wiper Maintenance\". After the windshield wiper maintenance function is turned on, the wiper will swing to the maintenance position. Wiper Blade Replacement As shown in the ﬁgure, adjust the wiper blade to an angle perpendicular to the wiper arm, and then press the blade in the direction of the arrow to separate the blade from the wiper arm. Do the opposite steps to install the wiper blade. Brake Pedal Check for Brake Pedal Stroke Brake pedal stroke: To avoid aƯecting the pedal stroke, do not lay a thick carpet in the brake pedal area. The reasonable range of brake pedal free travel is 0~30 mm. If the brake pedal fails to return or the brake pedal stroke becomes longer, please go to the JSW MG authorised service center for inspection. This may indicate faults of the brake system. V e h i c l e M a i n t e n a n c e 7 7-16 VEHICLE MAINTENANCE FUSES Fuse replacement: 1. Open the fuse box cover. 2. Identify damaged fuses by ﬁnding out blown fuses. 3. Use a fuse extractor to remove the blown fuses. The fuse extractor is in the front compartment fuse box cover. 4. Figure out the cause of fuse blowout and remove the fault. 5. Install new fuses with rated current meeting the requirements. Fuse Box Interior Fuse Box The interior fuse block is located on the instrument panel, and its label is pasted inside the knee bolster at the driver's side. Front Compartment Fuse Box B replacemet The front compartment fuse box is located in the front compartment. V e h i c l e M a i n t e n a n c e 7 7-17 VEHICLE MAINTENANCE CAUTION It is forbidden to remove a blown fuse with a conductive tool. A fuse remover must be used. The use of metal and other electric conductors may cause a short circuit, damage the electrical system",
  "or cause a ﬁre, resulting in serious personal injury. CAUTION The use of fuse substitutes or the fuse with an incorrect type and rated value may damage the electrical system or cause a ﬁre. Be sure to use a fuse whose type and rated current that meet the requirements. Otherwise, it may cause personal injury and damage the vehicle and other properties. Interior Fuse Box layout The arrangement of the internal components of the fuse box may diƯer depending on the vehicle model or conﬁguration. Please refer to the actual vehicle. CAUTION The gas in the halogen bulb is under pressure. Handle with care and properly dispose of the halogen bulb. • Wear safety glasses when removing or installing the bulb. • Take care to prevent bulbs from wear and scratches. • When the bulb lights up without being packaged, prevent it from contacting liquids. • Light up the lamp for test after the bulb being installed. • Replace the cracked or damaged headlamp in time. • Do not touch the glass portion with ungloved ﬁngers when replacing the halogen bulb. • Keep the bulb out of reach of children. • Dispose of the old bulb carefully to prevent personal injury due to bulb explosion. Lamp Bulb Replacement V e h i c l e M a i n t e n a n c e 7 7-18 VEHICLE MAINTENANCE CAUTION Clean the halogen bulb with alcohol or mineral spirits and non- woven fabrics. Do not touch the bulb with hands directly. Fingerprints may signiﬁcantly shorten the eƯective service life of the halogen bulb. CAUTION Professional skills and special equipment are required for lamp bulb replacement. It is recommended that you have this done at the JSW MG authorised service center. Otherwise, it may cause personal injury or damage to the vehicle. Lamp Fogging When the headlamp is on, a large amount of heat will be generated, which needs to be dissipated through the vent hole on the lamp, so the lamp is not completely sealed, and humid air can enter the lamp through the vent hole. When the temperature in the lamp is obviously higher than the ambient temperature or the ambient humidity is high, for example, in cold or humid weather, or when the vehicle is running in rain, or after it is washed, the water vapor inside the lamp will condense on the surface of the lamp cover, resulting in water mist (similar to the fogging phenomenon of the window glass). It is normal that the lighting function and the service life of headlamps will not be aƯected. Park the vehicle in a dry, ventilated area and the moisture will gradually dissipate. The water mist dissipates faster when the vehicle is driving with lamps on or exposed to sunlight, but there may still be residue at the corners of the lamps. It may take 2-3 days for the water mist to completely dissipate. If there are a lot of water drops or accumulated water in the lamp,",
  "please contact the JSW MG authorised service center for maintenance. V e h i c l e M a i n t e n a n c e 7 7-19 VEHICLE MAINTENANCE Bulb Speciﬁcation V e h i c l e M a i n t e n a n c e 7 7-20 VEHICLE MAINTENANCE CAUTION Be sure to use wheels and tires of speciﬁed speciﬁcations. The use of wheels and/or tires of other speciﬁcations may result in abnormal operation of ABS and other relevant components and even cause collision accidents. Please consult the JSW MG authorised service center before replacing original tires or wheels. Otherwise, it may cause personal injury and damage the vehicle or other properties. Maintenance The tire pressure shall meet provisions of this Manual so as to ensure optimum matching of driving comfort, safety and driveability. Please refer to “Technical Data” for the correct tire pressure. When the vehicle is in a cool state, check the tire pressure with an accurate tire pressure gauge. After check of tire pressure, tighten the valve core cap. NOTE Make sure to check the tire pressure when the vehicle is in a cool state. It cannot be based on a reading after the tire temperature has risen. Tires will become hot after traveling for 1.6 Km and will not cool down completely within 3h after stopping. ! Wheels and Tires Original tires guarantee optimum matching of riding comfort, tread life and performance. The car is not provided with spare tire, jack and socket wrench. If you need to change the tire, please contact the JSW MG authorised service center for wheel and tire replacement. V e h i c l e M a i n t e n a n c e 7 7-21 VEHICLE MAINTENANCE InsuƯicient Pressure Suitable Pressure Too high Pressure Check the tire pressure atleast once a month. Incorrect tire pressure may: • Increase tire wear • AƯect the vehicle maneuverability and safety • AƯect the riding comfort • Reduce the drive economy NOTE • Vehicle overload is prohibited. • Be sure to keep a proper tire inﬂation pressure. • Be sure to check the tire inﬂation pressure at the time of cold start (ambient temperature). ! Excessively low tire pressure will cause overheat of the tire, leading to internal damage and layered tread and even tire burst when driving at a high speed. Even if the tire pressure is restored later, driving under excessively low pressure may have damaged the tire. Tires and Wheels Maintenance Running over sharp objects may damage tires and wheels. If it is inevitable, please slow down. Do not touch the curb when parking. Regular Tire Check • Appearance damage. • Foreign matter • Piercing • Cut • Crack • Protruding on side wall Wheels should also be checked for damage. Tire defects, including those mentioned above, can result in loss of vehicle control and personal injury. Incase of damage or abnormal wear of tires or wheels, please consult the JSW",
  "MG authorised service center for help. The vehicle is equipped with radial tires. MG suggests replacing with radial tires of the same size, pattern, tread wear, temperature and rated speed. V e h i c l e M a i n t e n a n c e 7 7-22 VEHICLE MAINTENANCE NOTE The use of tires with diƯerent size than the original tires may cause the tire and the vehicle component to interfere with each other, thus causing damage to the tire and vehicle. ! CAUTION If the vehicle is equipped with TPMS, the tire repairing liquid for tire repair may result in the failure of the tire pressure monitoring system sensor. It is suggested to go the JSW MG authorised service center for inquiries and repair. Internal tread wear indicator Check the tire tread depth as per the tread wear indicator regularly. The mark on the tire wall indicates the position of the tread wear indicator. The tire must be replaced when the tread wear indicator appears. When the tread depth is equal to or less than 1.6 mm due to wear, the tread wear indicator will appear between the tread grooves. CAUTION It is forbidden to drive the vehicle in case of tire wear or damage. The worn or damaged tires may lead to the vehicle out of control and cause collision accidents, resulting in personal injury and damage of vehicle or other properties. V e h i c l e M a i n t e n a n c e 7 7-23 VEHICLE MAINTENANCE Tire rotation The front tires and the rear tires have diƯerent functions and therefore have diƯerent levels of wear. The front tires wear faster than the rear tires. In order to prolong the tire life and avoid uneven tread wear: 1. Rotate tires according to the maintenance procedures in this Manual. 2. Keep a proper tire pressure. 3. Check the tightening of nuts/bolts CAUTION Please use the recommended wheels and wheel nuts/bolts. Otherwise, it may lead to the vehicle out of control and cause collision accidents, resulting in personal injury and damage of vehicle or other properties. Winter Tire Using winter tires when driving on icy and snowy roads can improve the driving safety of vehicles. Please select winter tires with radial tire structure and use such winter tires on all four wheels. Please use the speciﬁed tire pressure. Do not drive the vehicle at a speed exceeding the maximum speed speciﬁed by the tire manufacturer. In addition to winter tires, all-weather tires can also be selected. Tire Chain Tire chains are only used for emergencies or in areas clearly deﬁned by law and should be installed on the drive wheels. Be especially careful when driving the vehicle equipped with tire chains. Compared with tires without tire chains, when tires are installed with tire chains, the maneuverability of the vehicle is poor, and the tire chain may damage the vehicle tire, suspension or vehicle body. Therefore, use ﬁne antiskid chains as",
  "much as possible to ensure enough space between the tire and other parts in the wheelhouse. V e h i c l e M a i n t e n a n c e 7 7-24 VEHICLE MAINTENANCE Vehicle Maintenance Cleaner The manufacturer's suggestions must be observed when you use detergent or other chemical products inside or outside the vehicle. Do not use dangerous detergent when cleaning the interior and exterior of the vehicle. For example: • Acetone • Paint diluent • Porcelain glaze reducing agent • Nail polish remover When you clean the inside and outside of the vehicle, the following cleaning agents are prohibited unless special instructions for cleaning stains are included in the fabric cleaning tips: • Laundry soap • Bleaching powder • Reducing agent When using antiskid chains, carefully read the installation and other related instructions of the tire chains manufacturer. NOTE After installation of tire chains, it is suggested to drive the vehicle at the speed of below 30 km/h or the limited speed recommended by the tire chains manufacturer (whichever is smaller). ! CAUTION Some cleaning agents are toxic, corrosive or ﬂammable. Improper use is very dangerous and easy to cause personal injury or vehicle damage. V e h i c l e M a i n t e n a n c e 7 7-25 VEHICLE MAINTENANCE Do not use the following materials for cleaning: • Carbon tetrachloride • Gasoline Benzene • Naphtha When using any detergent or other chemical products inside the vehicle, please open the doors for proper ventilation. To avoid permanent color change of light- colored interior trims, do not allow the easy-to-discolor fabrics to come into contact with the seat liner unless both materials are completely dry. Fabrics with easy-to- discolor materials are: • Casual clothes • Dyed denim • Leather • Goatskin • Newspapers and decorative paper CAUTION Avoid prolonged exposure to cleaning agents and other chemical vapors. Such chemical vapor is extremely dangerous and harmful to the health, especially in limited space without ventilation Interior Maintenance and Cleaning Clean the inside and outside of the vehicle with proper cleaning methods and materials. Use a vacuum cleaner or a banister brush to frequently remove dust and scum that accumulate on the fabric inside the vehicle. Wipe vinyl and leather trims regularly with a clean, damp cloth. Remove dust, spots or stains on trims with a suitable detergent NOTE Clean the interior trims of the vehicle with proper cleaning methods and materials. Otherwise, it will produce water spots, watermarks and permanent spots, especially during the ﬁrst washing. These substances will permanently damage the vehicle. ! V e h i c l e M a i n t e n a n c e 7 7-26 VEHICLE MAINTENANCE Seat Belt Maintenance Keep seat belts clean and dry. Prevent seat belts from being contaminated by polishing agents, oils and chemical products, especially battery ﬂuid, bleaching powder or dyestuƯ. These contaminants will reduce the strength of the seat belt material. Check all",
  "seat belt parts regularly. Replace any damaged seat belts or parts immediately. The seat belts or related parts that are stretched during the accident must be replaced, even if the damage is not obvious or is not visible. The seat belt for replacement must be new. MG suggests replacing the whole seat belt assembly after collision. If the seat belt is not damaged and everything is normal after inspection by JSW MG authorised service center, it is unnecessary to replace belt. NOTE The seat belt must be kept in a good working condition to maintain its normal function. ! Glass Surface Make sure that the window glass is clean, which helps reduce glare and improve vision. Front Windshield Outside Cleaning Waxes or other materials on the front windshield and blade may cause the blade to shake when working. Moreover, such foreign matters are not conducive to keeping the front windshield clean. Clean the outside of the front windshield regularly with a non- abrasive cleaning agent. Water does not form water droplets on the clean front windshield. NOTE The abrasive detergent will scratch the glass and damage the rear windshield defroster grid lines. Do not use the abrasive detergent on vehicle glass. Otherwise, it will aƯect the driver's vision. ! NOTE The decal will aƯect the rear window defroster. Do not paste decals on the inner side of the rear windshield. Otherwise, it will aƯect the driver's vision. ! V e h i c l e M a i n t e n a n c e 7 7-27 VEHICLE MAINTENANCE Exterior Maintenance and Cleaning Vehicle Cleaning Be sure to turn oƯ the power before washing the vehicle, and inform the washing personnel that the vehicle is a battery electric vehicle. Do not ﬂush its front compartment, front grille and traction battery under the vehicle with a water gun. CAUTION If the front compartment or the front grille and the traction battery under the vehicle are ﬂushed with a water gun, the vehicle may be damaged or electric shock may occur. The best way to maintain the ﬁnish paint of vehicles is to wash it regularly and keep it clean. • Park the vehicle in a place out of direct sunlight. • Wash the vehicle with the speciﬁed neutral soap liquid and cold or warm water. • Be sure to ﬂush the soap and detergent from the surface. MG vehicles are designed to operate under normal environmental conditions and natural factors. NOTE Do not use the household dishwashing detergent to wash the vehicle. The dishwashing detergent can wash oƯ paint and wax. Avoid excessive vehicle washing pressure. Water may enter the vehicle and damage the inside. ! Polishing and Waxing Regular polishing can remove residues from the surface of the vehicle. After polishing, use high- quality car wax for protection. NOTE It is forbidden to clean or polish aluminum trims with the automotive or chrome polishing agent, steam or alkaline soap liquid. These materials are abrasive and may damage trims and",
  "wheels. ! V e h i c l e M a i n t e n a n c e 7 7-28 VEHICLE MAINTENANCE Exterior Bright Metal Parts Protection Clean the bright metal parts regularly. They are usually washed with water. When waxing the vehicle, please also wax these bright metal parts. Aluminum Wheels and Wheel Trim Cover Cleaning To maintain the original appearance of the wheel and wheel trim cover (if any), do not allow them to collect dust or brake dust. Clean the wheels/wheel trim cover regularly. Do not use the abrasive cleaning agent or brush that may damage the ﬁnish paint. Corrosion Prevention MG vehicles are designed to have anti corrosion capabilities. The use of special materials and protective paint on most vehicle parts helps maintain satisfactory appearance, strength and reliability. Although the surfaces of certain parts inside the front compartment or of the underbody may rust, the reliability or performance of these parts will be aƯected. Damage to Sheet Metal Parts If the body needs to be repaired or replaced, ensure that the repair shop uses proper anti corrosion materials to restore the anti corrosion protection performance. Foreign Matter Deposition The following substance may damage the paint surface: • Calcium chloride and other salts • Ice melting agent • Road oil and asphalt Sap • Bird droppings • Industrial dust Remove harmful substances on the vehicle in time. If residues cannot be removed with soap water, a special cleaning agent can be used. NOTE Do not use the abrasive cleaning agent or brush to clean the aluminum wheels or wheel trim cover. ! V e h i c l e M a i n t e n a n c e 7 7-29 VEHICLE MAINTENANCE Finish Paint Damage Repair the gravel scratches, cracks or deep scratches on the ﬁnish paint as soon as possible. Exposed metal is prone to corrosion. Quick-drying products can be used to repair tiny cracks and scratches. Body and paint repair shops can complete large-scale repairs. NOTE Use only safe cleaning agents that are not harmful to painted surfaces. Other cleaning agents may permanently damage the paint. ! Underbody Maintenance Corrosive substances used for ice and snow melting and dust prevention may accumulate at the underbody. Failure to remove these substances will accelerate corrosion and rusting. V e h i c l e M a i n t e n a n c e 7 7-29 VEHICLE MAINTENANCE PERIODIC MAINTENANCE 1 Month 6 Months 1 Year 2 Years 3 Years 4 Years 5 Years 6 Years 7 Years 8 Years 9 Years 10 Years OPERATION / PROCESSES FOR PERIODIC SERVICE SCHEDULE Replacement Frequency: Km / Year whichever is earlier 1000 5000 15000 30000 45000 60000 75000 90000 105000 120000 135000 150000 Vehicle Interior and Exterior Check the function of the parking brake Inspection only I I I I I I I I I I I I Check the interior and exterior lighting, horn and system warning display functions. Inspection only I I",
  "I I I I I I I I I I Check the surfaces of windscreen and rear window, and the working condition of wipers and washers. Inspection only I I I I I I I I I I I I Check the status and function of seat belt. Inspection only I I I I I I I I I I I I Check various control functions of A/C. Inspection only I I I I I I I I I I I I Check AC ﬁlter, replace if necessary. 15K/1 Year I I R R R R R R R R R R Check the status and function of seat. Inspection only I I I I I I I I I I I I Check the conditions of front compartment cover lock, tailgate lock, door locks, hinges, door checks, etc., clean up all the dust and reﬁll lubricating grease as necessary. Inspection only I I I I I I I I I I I I Front Compartment Check the connection and status of 12V battery. Inspection only I I I I I I I I I I I I Check the high-voltage harness for mutual interference, wear or damage. Inspection only I I I I I I I I I I I I Check the washer ﬂuid level and add to the standard level as necessary. 10K/1 Year I I I I I I I I I I I I Check brake ﬂuid level and add to the standard level as necessary. 30 K KM/2 Years I I I R I R I R I R I R Check transmission ﬂuid levels, and add to the standard level as necessary. 80 K KM/8 Years I I I I I I I I I R I I Check the status of cooling system pipeline and connecting parts. Inspection only I I I I I I I I I I I I Periodic Maintenance - Service Schedule- Windsor 1 Month 6 Months 1 Year 2 Years 3 Years 4 Years 5 Years 6 Years 7 Years 8 Years 9 Years 10 Years OPERATION / PROCESSES FOR PERIODIC SERVICE SCHEDULE Replacement Frequency: Km / Year whichever is earlier 1000 5000 15000 30000 45000 60000 75000 90000 105000 120000 135000 150000 Check the level and concentration of coolant, and add to the standard level as necessary. 30K KM/ 2 Years* I I I R I R I R I R I R Check the status of A/C system pipeline such as the compressor, the cooling pipeline and the condenser, and clean relevant surfaces as necessary. Inspection only I I I I I I I I I I I I Check the status of brake vacuum booster and hose. Inspection only I I I I I I I I I I I I Check the drive motor mounting bracket. Inspection only I I I I I I I I I I I I Vehicle Bottom Check the appearance of high- voltage connector and if it is",
  "ﬁtted properly; check the surface of high-voltage connector for damage and if it is ﬁtted in place. Inspection only I I I I I I I I I I I I Check reducer oil level and add to the standard level as necessary. First 5K then every 30 K KM/ 2 Years I R I R I R I R I R I R Check the high-voltage harness for mutual interference, wear or damage. Inspection only I I I I I I I I I I I I Check the appearance of vent valve for damage, and check the marking for ﬁtting to see if it is moved. Inspection only I I I I I I I I I I I I Check the status of manual service switch to ensure reliable mounting and clean up the dust on the surface. Inspection only I I I I I I I I I I I I Check the mounting position of the cooling water pipe clip to ensure reliable sealing. Inspection only I I I I I I I I I I I I Periodic Maintenance - Service Schedule- Windsor PERIODIC MAINTENANCE Symbol Abbreviation: R - Replace • I - Inspect- Top up if require-Adjust-Clean-Reﬁll. Check the coolant level and top up as required, replace if it is contaminated/discoloured or there is sludge formation. ** Tightening of underbody fasteners, door adjustments and functional checks of all the systems during every service is mandatory - Check 1 Month 6 Months 1 Year 2 Years 3 Years 4 Years 5 Years 6 Years 7 Years 8 Years 9 Years 10 Years OPERATION / PROCESSES FOR PERIODIC SERVICE SCHEDULE Replacement Frequency: Km / Year whichever is earlier 1000 5000 15000 30000 45000 60000 75000 90000 105000 120000 135000 150000 Check the marking for ﬁtting the mounting bolt to see if it is moved and ensure the bolts are fastened. Inspection only I I I I I I I I I I I I Check the appearance of housing (including the bracket) for crack or deformation. Inspection only I I I I I I I I I I I I Check the appearance of high- voltage battery pack grounding wire and replace it as necessary. Inspection only I I I I I I I I I I I I Vehicle Interior and Exterior Check the equilibrium state of the high-voltage battery pack and carry out equalizing charge as necessary. Inspection only I I I I I I I I I I I I Check the status and thickness of front and rear brake pads and brake discs, and replace them as necessary. Inspection only I I I I I I I I I I I I Check brake pipes and hoses for condition and security. Ensure that hoses are not twisted or kinked. Inspection only I I I I I I I I I I I I Check the wheel bearings and drive shaft sleeve. Inspection only I I I I I I I I",
  "I I I I Check the suspension and steering system for leakage or wear. Inspection only I I I I I I I I I I I I Check the tread depth to see if the tyre is worn or damaged abnormally. Check the four-wheel alignment data and perform front and rear wheel rotation as appropriate. Inspection only I I I I I I I I I I I I Check the tyre pressure and make adjustment as necessary. Inspection only I I I I I I I I I I I I Check if the chassis and underbody bolts and nuts are fastened or ﬁxed, and replace them as necessary. Inspection only I I I I I I I I I I I I Periodic Maintenance - Service Schedule- Windsor PERIODIC MAINTENANCE Symbol Abbreviation: R - Replace • I - Inspect- Top up if require-Adjust-Clean-Reﬁll. Check the coolant level and top up as required, replace if it is contaminated/discoloured or there is sludge formation. ** Tightening of underbody fasteners, door adjustments and functional checks of all the systems during every service is mandatory - Check Periodic Maintenance - Service Schedule- Windsor 1 Month 6 Months 1 Year 2 Years 3 Years 4 Years 5 Years 6 Years 7 Years 8 Years 9 Years 10 Years OPERATION / PROCESSES FOR PERIODIC SERVICE SCHEDULE Replacement Frequency: Km / Year whichever is earlier 1000 5000 15000 30000 45000 60000 75000 90000 105000 120000 135000 150000 After Maintenance and Repair Use diagnostic software to reset maintenance interval indicator. Check for fault codes and determine operation status of the control systems. Inspection only I I I I I I I I I I I I Check the status and function of communication module with the scan tool. Inspection only I I I I I I I I I I I I Check software version of electronic control units and upgrade to latest version if available. Inspection only I I I I I I I I I I I I Carry out the road test, and check the status and function of power system, brake, steering and other systems. Inspection only I I I I I I I I I I I I \"Check speciﬁc gravity of the Battery electrolyte Level for all the cells. If the level is below the marker, pl top up the distilled water till the uper marker.\" Inspection only I I I I I I I I I I I I Symbol Abbreviation: R - Replace • I - Inspect- Top up if require-Adjust-Clean-Reﬁll. Check the coolant level and top up as required, replace if it is contaminated/discoloured or there is sludge formation. ** Tightening of underbody fasteners, door adjustments and functional checks of all the systems during every service is mandatory - Check PERIODIC MAINTENANCE NEW VEHICLE WARRANTY JSW MG Motor New Vehicle Warranty Terms & Conditions 1. General: Your JSW MG MOTOR vehicle is manufactured to meet the regulations and environmental requirements for Indian conditions. In case you",
  "relocate it to any other country than INDIA, it may be very diƯicult to make modiﬁcations to comply with the regulations and environmental requirements of that country and it may be diƯicult to perform repair service in that country. Please note that a vehicle relocated to any other country than India shall not be covered by the warranty. 2. New Vehicle Warranty 2.1 Duration of New Vehicle Warranty: New vehicle delivered by an authorized JSW MG MOTOR DEALER, are warranted against any material, assembly or manufacturing defects by the Manufacturer. The New Vehicle shall be covered under a Warranty by JSW MG MOTOR for a period of 3 years* or Unlimited kms. • Personal Registration • Commercial Registration 3 years or 1,00,000 kms (whichever is earlier) JSW MG MOTOR new vehicle warranty starts from the Delivery Date shown in the Owner's Manual issued to the Customer/ First Owner of the vehicle upon delivery of the vehicle purchased. (Transfer of ownership of the vehicle does not alter the warranty period of a vehicle.) • Battery Pack The warranty coverage for Battery pack is valid for 8 years or 1,50,000 kms (Personal) whichever is earlier / 3 years or 1,00,000 kms (Commercial) whichever is earlier starting from the Delivery Date. 2.2 Geographical coverage: 2.2.1 This warranty covers any new vehicle sold within geographical boundaries of INDIA. NEW VEHICLE WARRANTY If the vehicle is to be driven and, more importantly, registered outside the geographical area deﬁned above, such vehicle will not be covered under the current warranty as stated herein. 2.3 The period of warranty on the vehicle shall not be deemed to be extended by repairs or replacements of any parts. 2.4 In the event the Original Purchaser of the vehicle transfers the vehicle during the period of warranty, it shall be obligation of the subsequent purchaser to notify and inform JSW MG MOTOR or its authorized dealer of such transfer. 2.5 If the vehicle identiﬁcation number (VIN) of an insured vehicle is declared as total loss by the insurer, any Warranty, Extended Warranty, free services, i-call, e-call and i- smart app (facilities if applicable) provided in respect of such vehicle shall become null and void with eƯect from the date VIN of such vehicle is declared as total loss by the insurer. Field of Application: 2.5 The Customer is covered for: 2.5.1 Free repair (parts, consumables and labour) of any material or assembly defect duly found in the vehicle, at their own request, as well as any repairs on damage caused by this defect to other vehicle parts. 2.5.2 24/7 assistance services as deﬁned in the “JSW MG MOTOR Road Side Assistance” section. 2.5.3 It is the authorized JSW MG MOTOR EV Dealer's discretion to decide whether it is appropriate to repair or replace the defective part with new part(s), whilst keeping the Customer informed. 2.5.4 During a capacity check at an Authorised MG EV Dealer if it is determined that battery pack has suƯered a capacity drop below acceptable degradation",
  "according to the use and ageing of the vehicle, the module below this acceptable degradation will be deemed excessive loss. Where possible the excessive loss portion will be repaired, if NEW VEHICLE WARRANTY unrepairable the battery pack will be replaced with either a new / re manufactured / reconditioned battery as per JSW MG MOTOR Dealer's discretion. 2.6 Parts not covered under warranty conditions contained herein: The following are the parts not covered by warranty conditions contained herein. Hence, it is requested to contact your nearest JSW MG MOTOR Dealer for more details. 2.6.1 Battery: The warranty coverage for 12V Battery is valid for 1 year starting from the Delivery Date shown in the Owner's Manual issued to the customer and shall be provided by the battery manufacturer as per their terms and conditions. 2.6.2 Tire: The warranty coverage for Tire is valid for 1 year starting from the Delivery Date shown in the Owner's Manual issued to the Customer and shall be provided by the respective tire manufacturer as per their warranty terms and conditions. 2.6.3 Infotainment / Audio system including T-Box: The warranty coverage for Infotainment / Audio system is valid for 3 years from the Delivery Date shown in the Owner's Manual issued to the customer and shall be provided by the respective manufacturer as per their terms and conditions. 2.6.4 Battery Pack: The warranty coverage for Battery pack is valid for 8 years or 1,50,000 kms (Personal) whichever is earlier / 3 years or 1,00,000 kms (Commercial) whichever is earlier starting from the Delivery Date. 2.6.5 AC Chargers: The warranty coverage for AC chargers is valid for 1 year starting from the Delivery Date. It shall be provided by the respective AC Charger manufacturer as per their warranty terms and conditions. NEW VEHICLE WARRANTY 2.7 The JSW MG MOTOR New Vehicle Warranty does not cover and JSW MG MOTOR India Private Limited (JSW MG MOTOR) and / or JSW MG MOTOR authorized workshop shall not be responsible for the following: 2.7.1 Normal maintenance services other than 3 free services*, including without limitation, cleaning and polishing, minor adjustments, engine tuning, oil / ﬂuid changes, consumables (like lubes, grease etc) ﬁlters replenishment, fastener retightening, wheel balancing, wheel alignment and tyre rotation etc. 2.7.2 If the degree of degradation of the high-voltage battery is within the normal aging level according to the use of the vehicle. The criterion for normal aging of high-voltage battery conforms to our internal quality standards. 2.7.3 The indirect and remote consequences of any fault (loss of operation, duration of immobilization, etc.); 2.7.4 Vehicle components which have undergone conversion work, and/or speciﬁcation and design changes and the consequences (deterioration, premature wear and tear, alterations, etc.) of the conversion work on other vehicle parts or components, or on its speciﬁcations; 2.7.5 The costs incurred by the customer for routine maintenance; 2.7.6 Replacement of parts due to normal wear and tear resulting from use of the vehicle or from its mileage including but not limited to shocker",
  "absorbers, wiper blades, brake drum, brake disk, brake pads, brake shoe, lamp, plugs, belts, linings, bulbs, fuses, suspension parts, mountings, parts made of rubber, etc. Other parts, not limited to steering wheel, gear knobs, gear bellows prone to normal wear & tear will have a limited coverage**: NEW VEHICLE WARRANTY 2.8 Damage or failure resulting due to the following causes: 2.8.1 Poor vehicle maintenance, in particular if the instructions for the treatment, the frequency of maintenance or care to be applied to the vehicle set out in the Owner's Manual have not been observed; 2.8.2 Use of improper battery charger, ﬂuids or lubricants. 2.8.3 Due to lack of use / operation of vehicle over prolonged period[s]; 2.8.4 Misuse, abuse, negligence, improper driving habits, theft etc. of the vehicle; 2.8.5 Damage from stress, like use of vehicles in races, rallies or as taxis. The warranty terms for the use of JSW MG MOTOR vehicle shall be diƯerent / separate from the terms contained herein. 2.8.6 Use of parts other than JSW MG MOTOR Genuine Parts. 2.8.7 Any device and / or accessories not Supplied / Fitted by JSW MG MOTOR. 2.8.8 Modiﬁcations , alterations, tampering or improper repair. 2.8.9 Parts used in applications of which they were not designed or not approved by JSW MG MOTOR. Slight irregularities not recognized as aƯecting quality or function of the vehicle or parts, such as slight noise or vibrations, or items considered characteristic of the vehicle. 2.9 Damage caused by the following external causes: 2.9.1 Accidents, impacts, scratches, scoring, projection of gravel or solid bodies, hail, acts of vandalism; 2.9.2 Failure to observe the Manufacturer recommendations; 2.9.3 Deposits due to atmospheric pollution, plant- based deposits such as resin, animal-based deposits such as bird droppings, chemical deposits; 2.9.4 Transportation of the vehicle; 2.9.5 Fitting accessories not approved by the manufacturer; 2.9.6 Fitting accessories approved by the manufacturer, but installed without observing NEW VEHICLE WARRANTY the recommendations deﬁned by the manufacturer; 2.9.7 Damage due to airborne fallout, industrial fallout, acid rain, hail and wind storms, or other force majeure events like lightning, ﬁre, ﬂoods, earthquakes, war, riots, attacks, prolonged driving in submerged condition etc. 2.9.8 Damage caused due to hydro-static lock. 2.9.9 Paint scratches, dents or similar paint or body damage. Incidental or consequential damages, including without limitation, loss of time, inconvenience, loss of use of vehicle or commercial loss. How does the JSW MG MOTOR New Vehicle Warranty work? 2.10 To be eligible for the JSW MG MOTOR New Vehicle Warranty, the Customer must: 2.10.1 check that the Owner's Manual does contain the Delivery Date of the vehicle - their warranty entitlement is dependent on this; 2.10.2 contact any workshop of the JSW MG MOTOR Authorized Workshop Network – only such Workshop have the authorization for operations of this sort; 2.10.3 show the duly completed Owner's Manual, as proof of entitlement to the warranty and that the maintenance operations recommended by the Manufacturer have been carried out; 2.10.4 have the defect covered by the JSW",
  "MG MOTOR New Vehicle Warranty conﬁrmed as soon as possible, by a JSW MG MOTOR authorized workshop in writing. If the vehicle is unroadworthy, the Customer must contact the nearest JSW MG MOTOR authorized workshop member or JSW MG MOTOR Assistance. 2.11 The JSW MG MOTOR New Vehicle Warranty does not apply, and JSW MG MOTOR and JSW MG MOTOR authorized dealer members are exempt from all liabilities, if: NEW VEHICLE WARRANTY 2.11.1 The vehicle has been driven under conditions not in accordance with those stated in the Owner's Manual (example: vehicle overloaded or taking part in any type of sports competition, etc.); The defect observed is due to the Customer having had the vehicle repaired or serviced in a workshop outside the JSW MG MOTOR authorized network and not observing JSW MG MOTOR's recommendations on the subject. 2.12 By way of consideration for the parts supplied by JSW MG MOTOR under the JSW MG MOTOR New Vehicle Warranty, parts replaced under this warranty, shall legally become the property of JSW MG MOTOR. 2.13 All operations, parts and labour, carried out under the JSW MG MOTOR New Vehicle Warranty are guaranteed until the new vehicle warranty expires. 2.14 Transferring ownership of the vehicle shall not alter the application conditions of the JSW MG MOTOR New Vehicle Warranty. 3. The JSW MG MOTOR Anti- corrosion Warranty: 3.1 Duration of the Anti- Corrosion Warranty: This warranty will apply from the delivery date given on the Owner's Manual for a period of: Personal Registration - 3 years* or Unlimited kms. Commercial Registration - 3 years or 1,00,000 kms (whichever is earlier). 3.2 Geographical Coverage: The geographical coverage of the Anti-Corrosion Warranty is identical to that for the JSW MG MOTOR New Vehicle Warranty 3.3 Anti-Corrosion Warranty ﬁeld of application 3.3.1 In addition to the JSW MG MOTOR New Vehicle Warranty, JSW MG MOTOR guarantees the bodywork and sub frame of JSW MG MOTOR vehicle Schedule I from perforation from the interior, NEW VEHICLE WARRANTY due to steel panel corrosion caused by a manufacturing, material or protective product application defect. 3.3.2 This guarantee covers the repair or replacement of components with perforated steel panel work due to a manufacturing, material or protective product application defect, acknowledged by the Manufacturer. 3.3.3 It is authorized JSW MG MOTOR workshop's discretion to decide whether it is appropriate to repair or replace these components, and to inform the Customer. 3.4 The JSW MG MOTOR Anti- Corrosion Warranty does not cover: 3.4.1 any damage which is not covered by the JSW MG MOTOR New Vehicle Warranty, as deﬁned at the start of this booklet; Mechanical components which are not an integral part of the bodywork or sub-frame (wheel rims, exhaust system, etc.). 3.4.2 In case, repairs (including denting or painting) have been carried out on the body of the JSW MG MOTOR Vehicle in a workshop outside the JSW MG MOTOR authorized network. 3.5 Anti-Corrosion Warranty conditions of application 3.5.1 To obtain the Anti- Corrosion Warranty, the Customer must",
  "contact any Workshop of the JSW MG MOTOR Authorized Workshop Network - only such Workshop have authorization for operations of this sort. 3.5.2 The Customer shall show the duly completed (delivery date and validation of anti- corrosion test coupons) the Owner's Manual as proof of their warranty entitlement. 3.5.3 Application of the JSW MG MOTOR Anti-Corrosion Warranty is subject to the anti- corrosion tests on the bodywork and sub-frame. Customer shall ensure that these tests are conducted at the mileage intervals stated in the Owner's Manual, and at least once every two years. Scheduled maintenance NEW VEHICLE WARRANTY services in the JSW MG MOTOR authorized workshop network incorporate these tests. 3.5.4 If the Customer requests to have the anti-corrosion test conducted independently of the scheduled maintenance service, the same will be carried out at an extra cost to the Customer. 3.5.5 During these tests the Customer shall make sure that the professional carrying out the operation correctly completes the bodywork and sub frame test coupon, in order to validate the continuation of the Anti Corrosion Warranty. 3.5.6 Repairs on any deterioration must be made as soon as possible. 3.5.7 The application of the JSW MG MOTOR Anti- Corrosion Warranty is also subject to bodywork and subframe repairs being carried out in accordance with JSW MG MOTOR recommendations. 3.5.8 The repair or replacement of components under the conditions described in the “ﬁeld of application” (Paragraph 7.3), shall taken into account the general condition of the vehicle with regard to its age, mileage and maintenance level. 3.5.9 Parts replaced under the Anti Corrosion Warranty legally become the property of JSW MG MOTOR. 3.5.10 Repairs and components ﬁtted under the Anti-Corrosion Warranty are guaranteed until the end of the term of the original Anti corrosion Warranty. 3.5.11 Transferring ownership of the vehicle does not alter the application conditions of the Anti-Corrosion Warranty The JSW MG MOTOR Paintwork Warranty: 3.6 Duration of the Paintwork Warranty: JSW MG MOTOR guarantees the bodywork paintwork and painted parts paintwork (door mirrors, bumpers etc.) for 3 NEW VEHICLE WARRANTY years* or Unlimited kilometers (for Personal Registration) 3 years or 1,00,000 kms (for Commercial Registration) (whichever is earlier) from the Delivery Date of the new vehicle. 3.7 Geographical Coverage: The geographical coverage of the Paintwork Warranty is identical to that for the JSW MG MOTOR New Vehicle Warranty. 3.8 Paintwork Warranty ﬁeld of application: 3.8.1 This warranty covers the free repair or replacement of components with inherent paintwork defects (deterioration of lacquer or ﬁnishing varnish, due to any material, manufacturing or application defect) acknowledged by the Manufacturer, with the JSW MG MOTOR authorized workshop carrying out the operation, keeping the Customer informed. 3.8.2 This repair shall take into account the general condition of the vehicle with regard to its age, mileage and maintenance level. 3.9 The JSW MG MOTOR Paintwork Warranty does not cover: 3.9.1 any damage which is not covered by The JSW MG MOTOR New Vehicle Warranty, as deﬁned at the start of this booklet; 3.9.2 damage",
  "due to force majeure events: lightning, ﬁre, ﬂoods, earthquakes, war, riots and attacks; 3.9.3 Mechanical components which are not an integral part of the bodywork or sub-frame (wheel rims, exhaust system, etc.). Damage due to action of road elements (sand, gravel, dust or road debris) which results in stone chipping of paint or glass. 3.10 Paintwork Warranty conditions of application 3.10.1 To obtain the Paintwork Warranty, the Customer must contact any workshop of the JSW MG MOTOR Authorized Workshop Network - only such Workshop have authorization for operations of this sort. NEW VEHICLE WARRANTY 3.10.2 The Customer shall show the duly completed (delivery date) Owner's Manual as proof of their entitlement to the warranty. 3.10.3 By way of consideration for the parts supplied by JSW MG MOTOR under the Paintwork Warranty, parts replaced under this warranty legally become the property of JSW MG MOTOR. 3.10.4 Repairs and components ﬁtted under the Paintwork Warranty are guaranteed until the end of the term of the original Paintwork Warranty. 3.10.5 Transferring ownership of the vehicle does not alter the application conditions of the Paintwork Warranty. 4. This warranty is the entire Warranty given by JSW MG MOTOR and no Authorized Dealer of JSW MG MOTOR or its or his agent or employee is authorized to extend or enlarge this warranty and no Authorized Dealer of JSW MG MOTOR or its or his agent or employee is authorized to make any oral warranty on JSW MG MOTOR's behalf. 5. JSW MG MOTOR reserves the right to make any change in design or make any improvement in the design, structure, technology etc. of the vehicle at any time without any obligation to make the same change on the vehicles already sold. 6. Warranty service shall be provided only by JSW MG MOTOR's Authorized Dealers and Dealer Service Branch. 7. JSW MG MOTOR's decision is ﬁnal and binding on the Owner of the vehicle in all warranty matters. JSW MG MOTOR reserves the right for the ﬁnal decision on all warranty matters. 8. The terms and conditions as contained herein shall be construed in accordance to the laws as applicable in India and all disputes arising out of this Warranty will be subject to the jurisdiction of Courts in Gurugram only. NEW VEHICLE WARRANTY JSW MG Motor India has partnered with multiple application services & content providers for developing the complete/overall ecosystem experience of Internet Car features across all MGI models*. JSW MG MOTOR India is committed to providing the best user experience and services and acts as an integrator for these application services & content providers. For any customer feedback, JSW MG MOTOR India will coordinate with the respective content/service provider for resolution. *Model variants applicable with Internet features. **For limited coverage details, please contact JSW MG authorised service center. DISCLAIMER"
]